Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
/*
 ***********************************************************************************************************************
 *
 * Copyright (c) 2015, Infineon Technologies AG
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,are permitted provided that the
 * following conditions are met:
 *
 *   Redistributions of source code must retain the above copyright notice, this list of conditions and the  following
 *   disclaimer.
 *
 *   Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the
 *   following disclaimer in the documentation and/or other materials provided with the distribution.
 *
 *   Neither the name of the copyright holders nor the names of its contributors may be used to endorse or promote
 *   products derived from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE  FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY,OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT  OF THE
 * USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 **********************************************************************************************************************/
/**
 * \file     tle985x.h
 *
 * \brief    CMSIS register HeaderFile
 *
 * \version  V1.1.0
 * \date     02. Mar 2020
 *
 * \note This file violates [MISRA 2012 Rule 6.1, required], [MISRA 2012 Rule 5.1, required], [MISRA 2012 Rule 5.2, required], [MISRA 2012 Rule 5.4, required], [MISRA 2012 Rule 5.5, required], [MISRA 2012 Rule 2.5, advisory]
 */

/*******************************************************************************
**                             Author(s) Identity                             **
********************************************************************************
** Initials     Name                                                          **
** ---------------------------------------------------------------------------**
** BG           Blandine Guillot                                              **
*******************************************************************************/

/*******************************************************************************
**                          Revision Control History                          **
********************************************************************************
** V1.0.0: 2017-10-05, ? :   Initial version                                  **
** V1.1.0: 2020-03-02, BG:   Initial version of revision history              **
*******************************************************************************/

/** @addtogroup Infineon Technologies AG
  * @{
  */


/** @addtogroup TLE985x
  * @{
  */


#ifndef TLE985X_H
#define TLE985X_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* =======================================  ARM Cortex-M0 Specific Interrupt Numbers  ======================================== */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* ==========================================  TLE985x Specific Interrupt Numbers  =========================================== */
  INTISR0_IRQn              =   0,              /*!< 0  Interrupt node 0: GPT1 Block                                           */
  INTISR1_IRQn              =   1,              /*!< 1  Interrupt node 1: GPT2 Block                                           */
  INTISR2_IRQn              =   2,              /*!< 2  Interrupt node 2: ADC2, Timer3                                         */
  INTISR3_IRQn              =   3,              /*!< 3  Interrupt node 3: ADC1                                                 */
  INTISR4_IRQn              =   4,              /*!< 4  Interrupt node 4: CCU6 node0                                           */
  INTISR5_IRQn              =   5,              /*!< 5  Interrupt node 5: CCU6 node1                                           */
  INTISR6_IRQn              =   6,              /*!< 6  Interrupt node 6: CCU6 node2                                           */
  INTISR7_IRQn              =   7,              /*!< 7  Interrupt node 7: CCU6 node3                                           */
  INTISR8_IRQn              =   8,              /*!< 8  Interrupt node 8: SSC1                                                 */
  INTISR9_IRQn              =   9,              /*!< 9  Interrupt node 9: SSC2                                                 */
  INTISR10_IRQn             =  10,              /*!< 10 Interrupt node 10: UART1(ASC,LIN), Timer2                              */
  INTISR11_IRQn             =  11,              /*!< 11 Interrupt node 11: UART2, Timer21                                      */
  INTISR12_IRQn             =  12,              /*!< 12 Interrupt node 12: EINT0                                               */
  INTISR13_IRQn             =  13,              /*!< 13 Interrupt node 13: EINT1                                               */
  INTISR14_IRQn             =  14,              /*!< 14 Interrupt node 14: Wakeup                                              */
  INTISR15_IRQn             =  15,              /*!< 15 Interrupt node 15: Math Div                                            */
  INTISR17_IRQn             =  17,              /*!< 17 Interrupt node 17: BDRV LS1, OC, OT, OL                                */
  INTISR18_IRQn             =  18,              /*!< 18 Interrupt node 18: BDRV LS2, OC, OT, OL                                */
  INTISR19_IRQn             =  19,              /*!< 19 Interrupt node 19: BDRV HS1, OC, OT, OL                                */
  INTISR20_IRQn             =  20,              /*!< 20 Interrupt node 20: BDRV HS2, OC, OT, OL                                */
  INTISR21_IRQn             =  21,              /*!< 21 Interrupt node 21: Differential Unit                                   */
  INTISR22_IRQn             =  22,              /*!< 22 Interrupt node 22: MONx                                                */
  INTISR23_IRQn             =  23               /*!< 23 Interrupt node 23: Port 2.x (ADC1)                                     */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* ===========================  Configuration of the ARM Cortex-M0 Processor and Core Peripherals  =========================== */
#define __CM0_REV                 0x0000U       /*!< CM0 Core Revision                                                         */
#define __NVIC_PRIO_BITS               2        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */


/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0.h"                           /*!< ARM Cortex-M0 processor and core peripherals                              */
#include "system_TLE985x.h"                     /*!< TLE985x System                                                            */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif

#ifdef UNIT_TESTING_LV2
  #undef __IM
  #define __IM volatile
#endif  

/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                           ADC1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief ADC1 (ADC1)
  */

typedef struct {                                /*!< (@ 0x40004000) ADC1 Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) ADC1 Control and Status Register                           */
    
