Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t PD_N       : 1;            /*!< [0..0] ADC1 Power Down Signal                                             */
      __IOM uint32_t SOOC       : 1;            /*!< [1..1] ADC1 Start of Offset Calibration (software mode)                   */
      __IOM uint32_t SOS        : 1;            /*!< [2..2] ADC1 Start of Sampling/Conversion (software mode)                  */
      __IM  uint32_t            : 1;
      __IM  uint32_t READY      : 1;            /*!< [4..4] HVADC Ready bit                                                    */
      __IM  uint32_t CAL_SIGN   : 1;            /*!< [5..5] Output of Comparator to Steer Gain / Offset calibration            */
      __IM  uint32_t            : 1;
      __IM  uint32_t EOC        : 1;            /*!< [7..7] ADC1 End of Conversion (software mode)                             */
      __IOM uint32_t SW_CH_SEL  : 4;            /*!< [11..8] Channel for software mode                                         */
      __IM  uint32_t            : 6;
      __IOM uint32_t STRTUP_DIS : 1;            /*!< [18..18] DPP1 Startup Disable                                             */
    } bit;
  } CTRL_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Sequencer Feedback Register                                */
    
    struct {
      __IM  uint32_t SQ_FB      : 5;            /*!< [4..0] Current Sequence that caused software mode                         */
      __IM  uint32_t            : 3;
      __IM  uint32_t SQ_STOP    : 1;            /*!< [8..8] ADC1 Sequencer Stop Signal for DPP                                 */
      __IM  uint32_t EIM_ACTIVE : 1;            /*!< [9..9] ADC1 EIM active                                                    */
      __IM  uint32_t ESM_ACTIVE : 1;            /*!< [10..10] ADC1 ESM active                                                  */
      __IM  uint32_t SQx        : 4;            /*!< [14..11] Current Active ADC1 Sequence                                     */
      __IM  uint32_t            : 1;
      __IM  uint32_t CHx        : 4;            /*!< [19..16] Current ADC1 Channel                                             */
    } bit;
  } SQ_FB;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Channel Setting Bits for Exceptional Interrupt
                                                                    Measurement                                                */
    
    struct {
      __IOM uint32_t EIM_CHx    : 4;            /*!< [3..0] Channel set for exceptional interrupt measurement (EIM)            */
      __IM  uint32_t            : 4;
      __IOM uint32_t EIM_REP    : 3;            /*!< [10..8] Repeat count for exceptional interrupt measurement (EIM)          */
      __IOM uint32_t EIM_EN     : 1;            /*!< [11..11] Exceptional interrupt measurement (EIM) Trigger Event
                                                     enable                                                                    */
      __IM  uint32_t            : 4;
      __IOM uint32_t ADC1_EIM_TRIG_SEL : 3;     /*!< [18..16] Trigger selection for exceptional interrupt measurement
                                                     (EIM)                                                                     */
    } bit;
  } CHx_EIM;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Channel Setting Bits for Exceptional Sequence
                                                                    Measurement                                                */
    
    struct {
      __IOM uint32_t ESM_0      : 14;           /*!< [13..0] Channel Sequence for Exceptional Sequence Measurement
                                                     (ESM)                                                                     */
      __IM  uint32_t            : 2;
      __IOM uint32_t ADC1_ESM_TRIG_SEL : 3;     /*!< [18..16] Trigger selection for exceptional interrupt measurement
                                                     (ESM)                                                                     */
      __IM  uint32_t            : 11;
      __IOM uint32_t ESM_EN     : 1;            /*!< [30..30] Enable for Exceptional Sequence Measurement Trigger
                                                     Event                                                                     */
      __IOM uint32_t ESM_STS    : 1;            /*!< [31..31] Exceptional Sequence Measurement is finished                     */
    } bit;
  } CHx_ESM;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Maximum Time for Software Mode                             */
    
    struct {
      __IOM uint32_t MAX_TIME   : 8;            /*!< [7..0] Maximum Time in Software Mode                                      */
    } bit;
  } MAX_TIME;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Measurement Unit 1 Control Register 2                      */
    
    struct {
      __IOM uint32_t CAL_EN     : 14;           /*!< [13..0] Calibration Enable for Channels 0 to 13                           */
    } bit;
  } CTRL2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Measurement Unit 1 Control Register 3                      */
    
    struct {
      __IOM uint32_t MCM_PD_N   : 1;            /*!< [0..0] Power Down Signal for MCM                                          */
      __IOM uint32_t SW_MODE    : 1;            /*!< [1..1] Flag to enter SW Mode                                              */
      __IM  uint32_t            : 2;
      __OM  uint32_t EoC_FAIL_CLR : 1;          /*!< [4..4] Fail of ADC End of Conversion Signal Clear                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t EoC_FAIL   : 1;            /*!< [6..6] Fail of ADC End of Conversion Signal                               */
      __IM  uint32_t MCM_RDY    : 1;            /*!< [7..7] Ready Signal for MCM after Power On or Reset                       */
      __IOM uint32_t SAMPLE_TIME_HVCH : 5;      /*!< [12..8] Sample time of ADC1                                               */
      __IM  uint32_t            : 3;
      __IOM uint32_t SAMPLE_TIME_LVCH : 4;      /*!< [19..16] Sample time of ADC1                                              */
    } bit;
  } CTRL3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Measurement Unit 1 Control Register 5                      */
    
