Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t FILT_OUT_SEL_13_0 : 14;    /*!< [13..0] Output Filter Selection for Channels 0 to 13                      */
    } bit;
  } CTRL5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Measurement Unit 1 Channel Enable Bits for Cycle
                                                                    0-1                                                        */
    
    struct {
      __IOM uint32_t SQ0        : 14;           /*!< [13..0] Sequence 0 channel enable                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t SQ1        : 14;           /*!< [29..16] Sequence 1 channel enable                                        */
    } bit;
  } SQ0_1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Measurement Unit 1 Channel Enable Bits for Cycle
                                                                    2-3                                                        */
    
    struct {
      __IOM uint32_t SQ2        : 14;           /*!< [13..0] Sequence 2 channel enable                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t SQ3        : 14;           /*!< [29..16] Sequence 3 channel enable                                        */
    } bit;
  } SQ2_3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Measurement Unit 1 Channel Enable Bits for Cycle
                                                                    4-5                                                        */
    
    struct {
      __IOM uint32_t SQ4        : 14;           /*!< [13..0] Sequence 4 channel enable                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t SQ5        : 14;           /*!< [29..16] Sequence 5 channel enable                                        */
    } bit;
  } SQ4_5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) Measurement Unit 1 Channel Enable Bits for Cycle
                                                                    6-7                                                        */
    
    struct {
      __IOM uint32_t SQ6        : 14;           /*!< [13..0] Sequence 6 channel enable                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t SQ7        : 14;           /*!< [29..16] Sequence 7 channel enable                                        */
    } bit;
  } SQ6_7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Measurement Unit 1 Channel Enable Bits for Cycle
                                                                    8-9                                                        */
    
    struct {
      __IOM uint32_t SQ8        : 14;           /*!< [13..0] Sequence 8 channel enable                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t SQ9        : 14;           /*!< [29..16] Sequence 9 channel enable                                        */
    } bit;
  } SQ8_9;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) Measurement Unit 1 Channel Enable Bits for Cycle
                                                                    10-11                                                      */
    
    struct {
      __IOM uint32_t SQ10       : 14;           /*!< [13..0] Sequence 10 channel enable                                        */
      __IM  uint32_t            : 2;
      __IOM uint32_t SQ11       : 14;           /*!< [29..16] Sequence 11 channel enable                                       */
    } bit;
  } SQ10_11;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) ADC1 Channel Mapping for Sequencer                         */
    
    struct {
      __IM  uint32_t            : 5;
      __IOM uint32_t SQ_CH5_MAP : 1;            /*!< [5..5] ADC mapping to CH5                                                 */
      __IOM uint32_t SQ_CH6_MAP : 1;            /*!< [6..6] ADC mapping to CH6                                                 */
      __IM  uint32_t            : 5;
      __IOM uint32_t SQ_CH12_MAP : 1;           /*!< [12..12] ADC mapping to CH12                                              */
    } bit;
  } SQ_CH_MAP;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) ADC1 Offset Calibration Register                           */
    
    struct {
      __IOM uint32_t OFFSET_SHIFT : 3;          /*!< [2..0] Set the Value of the Offset Shift DAC                              */
      __IM  uint32_t            : 5;
      __IOM uint32_t OFFSET_DAC : 5;            /*!< [12..8] Set the Value of the Offset Calibration DAC                       */
    } bit;
  } OFFSETCALIB;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Lower Comparator Trigger Level Post-Processing-Channel
                                                                    0-3                                                        */
    
    struct {
      __IOM uint32_t PP_CH0_LOW : 8;            /*!< [7..0] Post-Processing-Channel 0 lower trigger level                      */
      __IOM uint32_t PP_CH1_LOW : 8;            /*!< [15..8] Post-Processing-Channel 1 lower trigger level                     */
      __IOM uint32_t PP_CH2_LOW : 8;            /*!< [23..16] Post-Processing-Channel 2 lower trigger level                    */
      __IOM uint32_t PP_CH3_LOW : 8;            /*!< [31..24] Post-Processing-Channel 3 lower trigger level                    */
    } bit;
  } TH0_3_LOWER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000044) Lower Comparator Trigger Level Post-Processing-Channel
                                                                    4-7                                                        */
    
    struct {
      __IOM uint32_t PP_CH4_LOW : 8;            /*!< [7..0] Post-Processing-Channel 4 lower trigger level                      */
      __IOM uint32_t PP_CH5_LOW : 8;            /*!< [15..8] Post-Processing-Channel 5 lower trigger level                     */
      __IOM uint32_t PP_CH6_LOW : 8;            /*!< [23..16] Post-Processing-Channel 6 lower trigger level                    */
      __IOM uint32_t PP_CH7_LOW : 8;            /*!< [31..24] Post-Processing-Channel 7 lower trigger level                    */
    } bit;
  } TH4_7_LOWER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000048) Calibration for Channel 0 and 1                            */
    
