Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t CALOFFS_CH0 : 5;           /*!< [4..0] Offset Calibration for channel 0                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t CALGAIN_CH0 : 8;           /*!< [15..8] Gain Calibration for channel 0                                    */
      __IOM uint32_t CALOFFS_CH1 : 5;           /*!< [20..16] Offset Calibration for channel 1                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t CALGAIN_CH1 : 8;           /*!< [31..24] Gain Calibration for channel 1                                   */
    } bit;
  } CAL_CH0_1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) Calibration for Channel 2 and 3                            */
    
    struct {
      __IOM uint32_t CALOFFS_CH2 : 5;           /*!< [4..0] Offset Calibration for channel 2                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t CALGAIN_CH2 : 8;           /*!< [15..8] Gain Calibration for channel 2                                    */
      __IOM uint32_t CALOFFS_CH3 : 5;           /*!< [20..16] Offset Calibration for channel 3                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t CALGAIN_CH3 : 8;           /*!< [31..24] Gain Calibration for channel 3                                   */
    } bit;
  } CAL_CH2_3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Calibration for Channel 4 and 5                            */
    
    struct {
      __IOM uint32_t CALOFFS_CH4 : 5;           /*!< [4..0] Offset Calibration for channel 4                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t CALGAIN_CH4 : 8;           /*!< [15..8] Gain Calibration for channel 4                                    */
      __IOM uint32_t CALOFFS_CH5 : 5;           /*!< [20..16] Offset Calibration for channel 5                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t CALGAIN_CH5 : 8;           /*!< [31..24] Gain Calibration for channel 5                                   */
    } bit;
  } CAL_CH4_5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000054) Calibration for Channel 6 and 7                            */
    
    struct {
      __IOM uint32_t CALOFFS_CH6 : 5;           /*!< [4..0] Offset Calibration for channel 6                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t CALGAIN_CH6 : 8;           /*!< [15..8] Gain Calibration for channel 6                                    */
      __IOM uint32_t CALOFFS_CH7 : 5;           /*!< [20..16] Offset Calibration for channel 7                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t CALGAIN_CH7 : 8;           /*!< [31..24] Gain Calibration for channel 7                                   */
    } bit;
  } CAL_CH6_7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000058) Calibration for Channel 8 and 9                            */
    
    struct {
      __IOM uint32_t CALOFFS_CH8 : 5;           /*!< [4..0] Offset Calibration for channel 8                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t CALGAIN_CH8 : 8;           /*!< [15..8] Gain Calibration for channel 8                                    */
      __IOM uint32_t CALOFFS_CH9 : 5;           /*!< [20..16] Offset Calibration for channel 9                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t CALGAIN_CH9 : 8;           /*!< [31..24] Gain Calibration for channel 9                                   */
    } bit;
  } CAL_CH8_9;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000005C) Calibration for Channel 10 and 11                          */
    
    struct {
      __IOM uint32_t CALOFFS_CH10 : 5;          /*!< [4..0] Offset Calibration for channel 10                                  */
      __IM  uint32_t            : 3;
      __IOM uint32_t CALGAIN_CH10 : 8;          /*!< [15..8] Gain Calibration for channel 10                                   */
      __IOM uint32_t CALOFFS_CH11 : 5;          /*!< [20..16] Offset Calibration for channel 11                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t CALGAIN_CH11 : 8;          /*!< [31..24] Gain Calibration for channel 11                                  */
    } bit;
  } CAL_CH10_11;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) Filter Coefficients Measurement Unit Channel
                                                                    0-13                                                       */
    
    struct {
      __IOM uint32_t CH0        : 2;            /*!< [1..0] Filter Coefficients ADC channel 0                                  */
      __IOM uint32_t CH1        : 2;            /*!< [3..2] Filter Coefficients ADC channel 1                                  */
      __IOM uint32_t CH2        : 2;            /*!< [5..4] Filter Coefficients ADC channel 2                                  */
      __IOM uint32_t CH3        : 2;            /*!< [7..6] Filter Coefficients ADC channel 3                                  */
      __IOM uint32_t CH4        : 2;            /*!< [9..8] Filter Coefficients ADC channel 4                                  */
      __IOM uint32_t CH5        : 2;            /*!< [11..10] Filter Coefficients ADC channel 5                                */
      __IOM uint32_t CH6        : 2;            /*!< [13..12] Filter Coefficients ADC channel 6                                */
      __IOM uint32_t CH7        : 2;            /*!< [15..14] Filter Coefficients ADC channel 7                                */
      __IOM uint32_t CH8        : 2;            /*!< [17..16] Filter Coefficients ADC channel 8                                */
      __IOM uint32_t CH9        : 2;            /*!< [19..18] Filter Coefficients ADC channel 9                                */
      __IOM uint32_t CH10       : 2;            /*!< [21..20] Filter Coefficients ADC channel 10                               */
      __IOM uint32_t CH11       : 2;            /*!< [23..22] Filter Coefficients ADC channel 11                               */
      __IOM uint32_t CH12       : 2;            /*!< [25..24] Filter Coefficients ADC channel 12                               */
      __IOM uint32_t CH13       : 2;            /*!< [27..26] Filter Coefficients ADC channel 13                               */
    } bit;
  } FILTCOEFF0_13;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000064) ADC1 Interrupt Status 1 Register                           */
    
