Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t IIR_CH0_IS : 1;            /*!< [0..0] ADC1 IIR-Filter-Channel 0 Interrupt Status                         */
      __IOM uint32_t VS_IS      : 1;            /*!< [1..1] ADC1 IIR-Filter-Channel 1 Interrupt Status                         */
      __IOM uint32_t IIR_CH2_IS : 1;            /*!< [2..2] ADC1 IIR-Filter-Channel 2 Interrupt Status                         */
      __IOM uint32_t IIR_CH3_IS : 1;            /*!< [3..3] ADC1 IIR-Filter-Channel 3 Interrupt Status                         */
      __IOM uint32_t IIR_CH4_IS : 1;            /*!< [4..4] ADC1 IIR-Filter-Channel 4 Interrupt Status                         */
      __IOM uint32_t IIR_CH5_IS : 1;            /*!< [5..5] ADC1 IIR-Filter-Channel 5 Interrupt Status                         */
      __IOM uint32_t IIR_CH6_IS : 1;            /*!< [6..6] ADC1 IIR-Filter-Channel 6 Interrupt Status                         */
      __IOM uint32_t IIR_CH7_IS : 1;            /*!< [7..7] ADC1 IIR-Filter-Channel 7 Interrupt Status                         */
      __IOM uint32_t IIR_CH8_IS : 1;            /*!< [8..8] ADC1 IIR-Filter-Channel 8 Interrupt Status                         */
      __IOM uint32_t IIR_CH9_IS : 1;            /*!< [9..9] ADC1 IIR-Filter-Channel 9 Interrupt Status                         */
      __IOM uint32_t IIR_CH10_IS : 1;           /*!< [10..10] ADC1 IIR-Filter-Channel 10 Interrupt Status                      */
      __IOM uint32_t IIR_CH11_IS : 1;           /*!< [11..11] ADC1 IIR-Filter-Channel 11 Interrupt Status                      */
      __IOM uint32_t IIR_CH12_IS : 1;           /*!< [12..12] ADC1 IIR-Filter-Channel 12 Interrupt Status                      */
      __IOM uint32_t IIR_CH13_IS : 1;           /*!< [13..13] ADC1 IIR-Filter-Channel 13 Interrupt Status                      */
      __IM  uint32_t            : 2;
      __IOM uint32_t EIM_IS     : 1;            /*!< [16..16] Exceptional Interrupt Measurement (EIM) Status                   */
      __IOM uint32_t ESM_IS     : 1;            /*!< [17..17] Exceptional Sequence Measurement (ESM) Status                    */
      __IM  uint32_t            : 6;
      __IOM uint32_t DU1LO_IS   : 1;            /*!< [24..24] ADC1 Differential Unit 1 (DU1) lower Channel Interrupt
                                                     Status                                                                    */
      __IOM uint32_t DU1UP_IS   : 1;            /*!< [25..25] ADC1 Differential Unit 1 (DU1) upper Channel Interrupt
                                                     Status                                                                    */
    } bit;
  } IRQS_1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000068) ADC1 Interrupt Enable 1 Register                           */
    
    struct {
      __IOM uint32_t IIR_CH0_IEN : 1;           /*!< [0..0] ADC1 IIR-Filter-Channel 0 Interrupt Enable                         */
      __IOM uint32_t VS_IEN     : 1;            /*!< [1..1] ADC1 IIR-Filter-Channel 1 Interrupt Enable                         */
      __IOM uint32_t IIR_CH2_IEN : 1;           /*!< [2..2] ADC1 IIR-Filter-Channel 2 Interrupt Enable                         */
      __IOM uint32_t IIR_CH3_IEN : 1;           /*!< [3..3] ADC1 IIR-Filter-Channel 3 Interrupt Enable                         */
      __IOM uint32_t IIR_CH4_IEN : 1;           /*!< [4..4] ADC1 IIR-Filter-Channel 4 Interrupt Enable                         */
      __IOM uint32_t IIR_CH5_IEN : 1;           /*!< [5..5] ADC1 IIR-Filter-Channel 5 Interrupt Enable                         */
      __IOM uint32_t IIR_CH6_IEN : 1;           /*!< [6..6] ADC1 IIR-Filter-Channel 6 Interrupt Enable                         */
      __IOM uint32_t IIR_CH7_IEN : 1;           /*!< [7..7] ADC1 IIR-Filter-Channel 7 Interrupt Enable                         */
      __IOM uint32_t IIR_CH8_IEN : 1;           /*!< [8..8] ADC1 IIR-Filter-Channel 8 Interrupt Enable                         */
      __IOM uint32_t IIR_CH9_IEN : 1;           /*!< [9..9] ADC1 IIR-Filter-Channel 9 Interrupt Enable                         */
      __IOM uint32_t IIR_CH10_IEN : 1;          /*!< [10..10] ADC1 IIR-Filter-Channel 10 Interrupt Enable                      */
      __IOM uint32_t IIR_CH11_IEN : 1;          /*!< [11..11] ADC1 IIR-Filter-Channel 11 Interrupt Enable                      */
      __IOM uint32_t IIR_CH12_IEN : 1;          /*!< [12..12] ADC1 IIR-Filter-Channel 12 Interrupt Enable                      */
      __IOM uint32_t IIR_CH13_IEN : 1;          /*!< [13..13] ADC1 IIR-Filter-Channel 13 Interrupt Enable                      */
      __IM  uint32_t            : 2;
      __IOM uint32_t EIM_IEN    : 1;            /*!< [16..16] Exceptional Interrupt Measurement (EIM) Interrupt Enable         */
      __IOM uint32_t ESM_IEN    : 1;            /*!< [17..17] Exceptional Sequence Measurement (ESM) Interrupt Enable          */
      __IM  uint32_t            : 6;
      __IOM uint32_t DU1LO_IEN  : 1;            /*!< [24..24] Differential Unit 1 lower Interrupt Enable                       */
      __IOM uint32_t DU1UP_IEN  : 1;            /*!< [25..25] Differential Unit 1 upper Interrupt Enable                       */
    } bit;
  } IRQEN_1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000006C) ADC1 Interrupt Status Clear 1 Register                     */
    
    struct {
      __OM  uint32_t IIR_CH0_ISC : 1;           /*!< [0..0] ADC1 IIR-Filter-Channel 0 Interrupt Status Clear                   */
      __OM  uint32_t VS_ISC     : 1;            /*!< [1..1] ADC1 IIR-Filter-Channel 1 Interrupt Status Clear                   */
      __OM  uint32_t IIR_CH2_ISC : 1;           /*!< [2..2] ADC1 IIR-Filter-Channel 2 Interrupt Status Clear                   */
      __OM  uint32_t IIR_CH3_ISC : 1;           /*!< [3..3] ADC1 IIR-Filter-Channel 3 Interrupt Status Clear                   */
      __OM  uint32_t IIR_CH4_ISC : 1;           /*!< [4..4] ADC1 IIR-Filter-Channel 4 Interrupt Status Clear                   */
      __OM  uint32_t IIR_CH5_ISC : 1;           /*!< [5..5] ADC1 IIR-Filter-Channel 5 Interrupt Status Clear                   */
      __OM  uint32_t IIR_CH6_ISC : 1;           /*!< [6..6] ADC1 IIR-Filter-Channel 6 Interrupt Status Clear                   */
      __OM  uint32_t IIR_CH7_ISC : 1;           /*!< [7..7] ADC1 IIR-Filter-Channel 7 Interrupt Status Clear                   */
      __OM  uint32_t IIR_CH8_ISC : 1;           /*!< [8..8] ADC1 IIR-Filter-Channel 8 Interrupt Status Clear                   */
      __OM  uint32_t IIR_CH9_ISC : 1;           /*!< [9..9] ADC1 IIR-Filter-Channel 9 Interrupt Status Clear                   */
      __OM  uint32_t IIR_CH10_ISC : 1;          /*!< [10..10] ADC1 IIR-Filter-Channel 10 Interrupt Status Clear                */
      __OM  uint32_t IIR_CH11_ISC : 1;          /*!< [11..11] ADC1 IIR-Filter-Channel 11 Interrupt Status Clear                */
      __OM  uint32_t IIR_CH12_ISC : 1;          /*!< [12..12] ADC1 IIR-Filter-Channel 12 Interrupt Status Clear                */
      __OM  uint32_t IIR_CH13_ISC : 1;          /*!< [13..13] ADC1 IIR-Filter-Channel 13 Interrupt Status Clear                */
      __IM  uint32_t            : 2;
      __OM  uint32_t EIM_ISC    : 1;            /*!< [16..16] Exceptional Interrupt Measurement (EIM) Status Clear             */
      __OM  uint32_t ESM_ISC    : 1;            /*!< [17..17] Exceptional Sequence Measurement (ESM) Status Clear              */
      __IM  uint32_t            : 6;
      __OM  uint32_t DU1LO_ISC  : 1;            /*!< [24..24] Differential Unit 1 lower Interrupt Status Clear                 */
      __OM  uint32_t DU1UP_ISC  : 1;            /*!< [25..25] Differential Unit 1 lower Interrupt Status Clear                 */
    } bit;
  } IRQCLR_1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) ADC1 or Filter Output Channel 0                            */
    
