Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IM  uint32_t FILT_OUT_CH0 : 12;         /*!< [11..0] ADC or filter output value channel 0                              */
      __IM  uint32_t            : 4;
      __IOM uint32_t WFR0       : 1;            /*!< [16..16] Wait for Read Mode                                               */
      __IM  uint32_t VF0        : 1;            /*!< [17..17] Valid Flag                                                       */
      __IM  uint32_t OF0        : 1;            /*!< [18..18] Overrun Flag                                                     */
    } bit;
  } FILT_OUT0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000074) ADC1 or Filter Output Channel 1                            */
    
    struct {
      __IM  uint32_t FILT_OUT_CH1 : 12;         /*!< [11..0] ADC or filter output value channel 1                              */
      __IM  uint32_t            : 4;
      __IOM uint32_t WFR1       : 1;            /*!< [16..16] Wait for Read Mode                                               */
      __IM  uint32_t VF1        : 1;            /*!< [17..17] Valid Flag                                                       */
      __IM  uint32_t OF1        : 1;            /*!< [18..18] Overrun Flag                                                     */
    } bit;
  } FILT_OUT1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000078) ADC1 or Filter Output Channel 2                            */
    
    struct {
      __IM  uint32_t FILT_OUT_CH2 : 12;         /*!< [11..0] ADC or filter output value channel 2                              */
      __IM  uint32_t            : 4;
      __IOM uint32_t WFR2       : 1;            /*!< [16..16] Wait for Read Mode                                               */
      __IM  uint32_t VF2        : 1;            /*!< [17..17] Valid Flag                                                       */
      __IM  uint32_t OF2        : 1;            /*!< [18..18] Overrun Flag                                                     */
    } bit;
  } FILT_OUT2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000007C) ADC1 or Filter Output Channel 3                            */
    
    struct {
      __IM  uint32_t FILT_OUT_CH3 : 12;         /*!< [11..0] ADC or filter output value channel 3                              */
      __IM  uint32_t            : 4;
      __IOM uint32_t WFR3       : 1;            /*!< [16..16] Wait for Read Mode                                               */
      __IM  uint32_t VF3        : 1;            /*!< [17..17] Valid Flag                                                       */
      __IM  uint32_t OF3        : 1;            /*!< [18..18] Overrun Flag                                                     */
    } bit;
  } FILT_OUT3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) ADC1 or Filter Output Channel 4                            */
    
    struct {
      __IM  uint32_t FILT_OUT_CH4 : 12;         /*!< [11..0] ADC or filter output value channel 4                              */
      __IM  uint32_t            : 4;
      __IOM uint32_t WFR4       : 1;            /*!< [16..16] Wait for Read Mode                                               */
      __IM  uint32_t VF4        : 1;            /*!< [17..17] Valid Flag                                                       */
      __IM  uint32_t OF4        : 1;            /*!< [18..18] Overrun Flag                                                     */
    } bit;
  } FILT_OUT4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000084) ADC1 or Filter Output Channel 5                            */
    
    struct {
      __IM  uint32_t FILT_OUT_CH5 : 12;         /*!< [11..0] ADC or filter output value channel 5                              */
      __IM  uint32_t            : 4;
      __IOM uint32_t WFR5       : 1;            /*!< [16..16] Wait for Read Mode                                               */
      __IM  uint32_t VF5        : 1;            /*!< [17..17] Valid Flag                                                       */
      __IM  uint32_t OF5        : 1;            /*!< [18..18] Overrun Flag                                                     */
    } bit;
  } FILT_OUT5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000088) ADC1 or Filter Output Channel 6                            */
    
    struct {
      __IM  uint32_t FILT_OUT_CH6 : 12;         /*!< [11..0] ADC or filter output value channel 6                              */
      __IM  uint32_t            : 4;
      __IOM uint32_t WFR6       : 1;            /*!< [16..16] Wait for Read Mode                                               */
      __IM  uint32_t VF6        : 1;            /*!< [17..17] Valid Flag                                                       */
      __IM  uint32_t OF6        : 1;            /*!< [18..18] Overrun Flag                                                     */
    } bit;
  } FILT_OUT6;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000008C) ADC1 or Filter Output Channel 7                            */
    
    struct {
      __IM  uint32_t FILT_OUT_CH7 : 12;         /*!< [11..0] ADC or filter output value channel 7                              */
      __IM  uint32_t            : 4;
      __IOM uint32_t WFR7       : 1;            /*!< [16..16] Wait for Read Mode                                               */
      __IM  uint32_t VF7        : 1;            /*!< [17..17] Valid Flag                                                       */
      __IM  uint32_t OF7        : 1;            /*!< [18..18] Overrun Flag                                                     */
    } bit;
  } FILT_OUT7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) ADC1 or Filter Output Channel 8                            */
    
    struct {
      __IM  uint32_t FILT_OUT_CH8 : 12;         /*!< [11..0] ADC or filter output value channel 8                              */
      __IM  uint32_t            : 4;
      __IOM uint32_t WFR8       : 1;            /*!< [16..16] Wait for Read Mode                                               */
      __IM  uint32_t VF8        : 1;            /*!< [17..17] Valid Flag                                                       */
      __IM  uint32_t OF8        : 1;            /*!< [18..18] Overrun Flag                                                     */
    } bit;
  } FILT_OUT8;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000094) ADC1 or Filter Output Channel 9                            */
    
