Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IM  uint32_t FILT_OUT_CH9 : 12;         /*!< [11..0] ADC or filter output value channel 9                              */
      __IM  uint32_t            : 4;
      __IOM uint32_t WFR9       : 1;            /*!< [16..16] Wait for Read Mode                                               */
      __IM  uint32_t VF9        : 1;            /*!< [17..17] Valid Flag                                                       */
      __IM  uint32_t OF9        : 1;            /*!< [18..18] Overrun Flag                                                     */
    } bit;
  } FILT_OUT9;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000098) ADC1 or Filter Output Channel 10                           */
    
    struct {
      __IM  uint32_t FILT_OUT_CH10 : 12;        /*!< [11..0] ADC or filter output value channel 10                             */
      __IM  uint32_t            : 4;
      __IOM uint32_t WFR10      : 1;            /*!< [16..16] Wait for Read Mode                                               */
      __IM  uint32_t VF10       : 1;            /*!< [17..17] Valid Flag                                                       */
      __IM  uint32_t OF10       : 1;            /*!< [18..18] Overrun Flag                                                     */
    } bit;
  } FILT_OUT10;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000009C) ADC1 or Filter Output Channel 11                           */
    
    struct {
      __IM  uint32_t FILT_OUT_CH11 : 12;        /*!< [11..0] ADC or filter output value channel 11                             */
      __IM  uint32_t            : 4;
      __IOM uint32_t WFR11      : 1;            /*!< [16..16] Wait for Read Mode                                               */
      __IM  uint32_t VF11       : 1;            /*!< [17..17] Valid Flag                                                       */
      __IM  uint32_t OF11       : 1;            /*!< [18..18] Overrun Flag                                                     */
    } bit;
  } FILT_OUT11;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) ADC1 Differential Channel Output 1                         */
    
    struct {
      __IM  uint32_t DCH1       : 12;           /*!< [11..0] ADC differential output value 1                                   */
      __IM  uint32_t            : 4;
      __IOM uint32_t DWFR1      : 1;            /*!< [16..16] Wait for Read Mode                                               */
      __IM  uint32_t DVF1       : 1;            /*!< [17..17] Valid Flag                                                       */
      __IM  uint32_t DOF1       : 1;            /*!< [18..18] Overrun Flag                                                     */
    } bit;
  } DIFFCH_OUT1;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B0) Upper And Lower Threshold Filter Enable                    */
    
    struct {
      __IOM uint32_t FUL_PP_CH0_EN : 1;         /*!< [0..0] Upper and lower threshold IIR filter enable Post-Processing-Channel
                                                     0                                                                         */
      __IOM uint32_t FUL_PP_CH1_EN : 1;         /*!< [1..1] Upper and lower threshold IIR filter enable Post-Processing-Channel
                                                     1                                                                         */
      __IOM uint32_t FUL_PP_CH2_EN : 1;         /*!< [2..2] Upper and lower threshold IIR filter enable Post-Processing-Channel
                                                     2                                                                         */
      __IOM uint32_t FUL_PP_CH3_EN : 1;         /*!< [3..3] Upper and lower threshold IIR filter enable Post-Processing-Channel
                                                     3                                                                         */
      __IOM uint32_t FUL_PP_CH4_EN : 1;         /*!< [4..4] Upper and lower threshold IIR filter enable Post-Processing-Channel
                                                     4                                                                         */
      __IOM uint32_t FUL_PP_CH5_EN : 1;         /*!< [5..5] Upper and lower threshold IIR filter enable Post-Processing-Channel
                                                     5                                                                         */
      __IOM uint32_t FUL_PP_CH6_EN : 1;         /*!< [6..6] Upper and lower threshold IIR filter enable Post-Processing-Channel
                                                     6                                                                         */
      __IOM uint32_t FUL_PP_CH7_EN : 1;         /*!< [7..7] Upper and lower threshold IIR filter enable Post-Processing-Channel
                                                     7                                                                         */
    } bit;
  } FILT_UPLO_CTRL;
  __IM  uint32_t  RESERVED1[2];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000BC) ADC1 Status Register                                       */
    
    struct {
      __IOM uint32_t DAC_IN     : 3;            /*!< [2..0] Programs the 2-bit DAC for functional test                         */
      __IM  uint32_t            : 13;
      __IOM uint32_t SOC_JITTER : 2;            /*!< [17..16] Programs Soc Clock Jitter                                        */
      __IM  uint32_t            : 13;
      __IOM uint32_t SD_FEEDB_ON : 1;           /*!< [31..31] Sigma Delta Feedback Loop                                        */
    } bit;
  } STATUS;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C4) Lower Comparator Trigger Level Differential Channel
                                                                    1                                                          */
    
