Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t DCH1_LOW   : 8;            /*!< [7..0] Differential Channel 1 lower trigger level                         */
    } bit;
  } DCHTH1_4_LOWER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C8) Upper Comparator Trigger Level Post-Processing-Channel
                                                                    0-3                                                        */
    
    struct {
      __IOM uint32_t PP_CH0_UP  : 8;            /*!< [7..0] Post-Processing-Channel 0 upper trigger level                      */
      __IOM uint32_t PP_CH1_UP  : 8;            /*!< [15..8] Post-Processing-Channel 1 upper trigger level                     */
      __IOM uint32_t PP_CH2_UP  : 8;            /*!< [23..16] Post-Processing-Channel 2 upper trigger level                    */
      __IOM uint32_t PP_CH3_UP  : 8;            /*!< [31..24] Post-Processing-Channel 3 upper trigger level                    */
    } bit;
  } TH0_3_UPPER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000CC) Upper Comparator Trigger Level Post-Processing-Channel
                                                                    4-7                                                        */
    
    struct {
      __IOM uint32_t PP_CH4_UP  : 8;            /*!< [7..0] Post-Processing-Channel 4 upper trigger level                      */
      __IOM uint32_t PP_CH5_UP  : 8;            /*!< [15..8] Post-Processing-Channel 5 upper trigger level                     */
      __IOM uint32_t PP_CH6_UP  : 8;            /*!< [23..16] Post-Processing-Channel 6upper trigger level                     */
      __IOM uint32_t PP_CH7_UP  : 8;            /*!< [31..24] Post-Processing-Channel 7 upper trigger level                    */
    } bit;
  } TH4_7_UPPER;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D4) Upper Comparator Trigger Level Differential Channel
                                                                    1                                                          */
    
    struct {
      __IOM uint32_t DCH1_UP    : 8;            /*!< [7..0] Differential Channel 1 upper trigger level                         */
    } bit;
  } DCHTH1_4_UPPER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D8) Lower Counter Trigger Level Post-Processing-Channel
                                                                    0-3                                                        */
    
    struct {
      __IOM uint32_t CNT_LO_PP0 : 2;            /*!< [1..0] Lower timer trigger threshold Post-Processing-Channel
                                                     0                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_PP0 : 2;           /*!< [4..3] Post-Processing-Channel 0 lower hysteresis                         */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_LO_PP1 : 2;            /*!< [9..8] Lower timer trigger threshold Post-Processing-Channel
                                                     1                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_PP1 : 2;           /*!< [12..11] Post-Processing-Channel 1 lower hysteresis                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_LO_PP2 : 2;            /*!< [17..16] Lower timer trigger threshold Post-Processing-Channel
                                                     2                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_PP2 : 2;           /*!< [20..19] Post-Processing-Channel 2 lower hysteresis                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_LO_PP3 : 2;            /*!< [25..24] Lower timer trigger threshold Post-Processing-Channel
                                                     3                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_PP3 : 2;           /*!< [28..27] Post-Processing-Channel 3 lower hysteresis                       */
    } bit;
  } CNT0_3_LOWER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000DC) Lower Counter Trigger Level Post-Processing-Channel
                                                                    4-7                                                        */
    
    struct {
      __IOM uint32_t CNT_LO_PP4 : 2;            /*!< [1..0] Lower timer trigger threshold Post-Processing-Channel
                                                     4                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_PP4 : 2;           /*!< [4..3] Post-Processing-Channel 4 lower hysteresis                         */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_LO_PP5 : 2;            /*!< [9..8] Lower timer trigger threshold Post-Processing-Channel
                                                     5                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_PP5 : 2;           /*!< [12..11] Post-Processing-Channel 5 lower hysteresis                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_LO_PP6 : 2;            /*!< [17..16] Lower timer trigger threshold Post-Processing-Channel
                                                     6                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_PP6 : 2;           /*!< [20..19] Channel 6 lower hysteresis                                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_LO_PP7 : 2;            /*!< [25..24] Lower timer trigger threshold Post-Processing-Channel
                                                     7                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_PP7 : 2;           /*!< [28..27] Post-Processing-Channel 7 lower hysteresis                       */
    } bit;
  } CNT4_7_LOWER;
  __IM  uint32_t  RESERVED4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E4) Lower Counter Trigger Level DifferentialChannel
                                                                    1                                                          */
    
