Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t CNT_LO_DCH1 : 2;           /*!< [1..0] Lower timer trigger threshold Post-Processing-Channel
                                                     4                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_DCH1 : 2;          /*!< [4..3] Post-Processing-Channel 4 lower hysteresis                         */
    } bit;
  } DCHCNT1_4_LOWER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E8) Upper Counter Trigger Level Post-Processing-Channel
                                                                    0-3                                                        */
    
    struct {
      __IOM uint32_t CNT_UP_PP0 : 2;            /*!< [1..0] Upper timer trigger threshold Post-Processing-Channel
                                                     0                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_PP0 : 2;           /*!< [4..3] Post-Processing-Channel 0 upper hysteresis                         */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_UP_PP1 : 2;            /*!< [9..8] Upper timer trigger threshold Post-Processing-Channel
                                                     1                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_PP1 : 2;           /*!< [12..11] Post-Processing-Channel 1 upper hysteresis                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_UP_PP2 : 2;            /*!< [17..16] Upper timer trigger threshold Post-Processing-Channel
                                                     2                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_PP2 : 2;           /*!< [20..19] Post-Processing-Channel 2 upper hysteresis                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_UP_PP3 : 2;            /*!< [25..24] Upper timer trigger threshold Post-Processing-Channel
                                                     3                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_PP3 : 2;           /*!< [28..27] Post-Processing-Channel 3 upper hysteresis                       */
    } bit;
  } CNT0_3_UPPER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000EC) Upper Counter Trigger Level Post-Processing-Channel
                                                                    4-7                                                        */
    
    struct {
      __IOM uint32_t CNT_UP_PP4 : 2;            /*!< [1..0] Upper timer trigger threshold Post-Processing-Channel
                                                     4                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_PP4 : 2;           /*!< [4..3] Post-Processing-Channel 4 upper hysteresis                         */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_UP_PP5 : 2;            /*!< [9..8] Upper timer trigger threshold Post-Processing-Channel
                                                     5                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_PP5 : 2;           /*!< [12..11] Post-Processing-Channel 5 upper hysteresis                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_UP_PP6 : 2;            /*!< [17..16] Upper timer trigger threshold Post-Processing-Channel
                                                     6                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_PP6 : 2;           /*!< [20..19] Post-Processing-Channel 6 upper hysteresis                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_UP_PP7 : 2;            /*!< [25..24] Upper timer trigger threshold Post-Processing-Channel
                                                     7                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_PP7 : 2;           /*!< [28..27] Post-Processing-Channel 7 upper hysteresis                       */
    } bit;
  } CNT4_7_UPPER;
  __IM  uint32_t  RESERVED5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F4) Upper Counter Trigger Level DifferentialChannel
                                                                    1                                                          */
    
    struct {
      __IOM uint32_t CNT_UP_DCH1 : 2;           /*!< [1..0] Upper timer trigger threshold Post-Processing-Channel
                                                     4                                                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_DCH1 : 2;          /*!< [4..3] Post-Processing-Channel 4 upper hysteresis                         */
    } bit;
  } DCHCNT1_4_UPPER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F8) Overvoltage Measurement Mode of Post-Processing-Channel
                                                                    0-7                                                        */
    
    struct {
      __IOM uint32_t MMODE_0    : 2;            /*!< [1..0] Measurement mode Post-Processing-Channel 0                         */
      __IOM uint32_t MMODE_1    : 2;            /*!< [3..2] Measurement mode Post-Processing-Channel 1                         */
      __IOM uint32_t MMODE_2    : 2;            /*!< [5..4] Measurement mode Post-Processing-Channel 2                         */
      __IOM uint32_t MMODE_3    : 2;            /*!< [7..6] Measurement mode Post-Processing-Channel 3                         */
      __IOM uint32_t MMODE_4    : 2;            /*!< [9..8] Measurement mode Post-Processing-Channel 4                         */
      __IOM uint32_t MMODE_5    : 2;            /*!< [11..10] Measurement mode Post-Processing-Channel 5                       */
      __IOM uint32_t MMODE_6    : 2;            /*!< [13..12] Measurement mode Post-Processing-Channel 6                       */
      __IOM uint32_t MMODE_7    : 2;            /*!< [15..14] Measurement mode Post-Processing-Channel 7                       */
      __IM  uint32_t            : 8;
      __IOM uint32_t MMODE_D1   : 2;            /*!< [25..24] Measurement mode Differential Channel 1                          */
    } bit;
  } MMODE0_7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000FC) Measurement Unit 1 - Differential Unit Input
                                                                    Selection Register                                         */
    
