Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t DU1_EN     : 1;            /*!< [0..0] Differential Unit 1 enable                                         */
      __IM  uint32_t            : 3;
      __IM  uint32_t DU1RES_NEG : 1;            /*!< [4..4] Differential Unit 1 result negative                                */
    } bit;
  } DUIN_SEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000100) ADC1 Interrupt Status 2 Register                           */
    
    struct {
      __IOM uint32_t PP_CH0_LO_IS : 1;          /*!< [0..0] ADC1 Post-Processing-Channel 0 Lower Threshold Interrupt
                                                     Status                                                                    */
      __IOM uint32_t VS_LO_IS   : 1;            /*!< [1..1] ADC1 Post-Processing-Channel 1 Lower Threshold Interrupt
                                                     Status                                                                    */
      __IOM uint32_t PP_CH2_LO_IS : 1;          /*!< [2..2] ADC1 Post-Processing-Channel 2 Lower Threshold Interrupt
                                                     Status                                                                    */
      __IOM uint32_t PP_CH3_LO_IS : 1;          /*!< [3..3] ADC1 Post-Processing-Channel 3 Lower Threshold Interrupt
                                                     Status                                                                    */
      __IOM uint32_t PP_CH4_LO_IS : 1;          /*!< [4..4] ADC1 Post-Processing-Channel 4 Lower Threshold Interrupt
                                                     Status                                                                    */
      __IOM uint32_t PP_CH5_LO_IS : 1;          /*!< [5..5] ADC1 Post-Processing-Channel 5 Lower Threshold Interrupt
                                                     Status                                                                    */
      __IOM uint32_t PP_CH6_LO_IS : 1;          /*!< [6..6] ADC1 Post-Processing-Channel 6 Lower Threshold Interrupt
                                                     Status                                                                    */
      __IOM uint32_t PP_CH7_LO_IS : 1;          /*!< [7..7] ADC1 Post-Processing-Channel 7 Lower Threshold Interrupt
                                                     Status                                                                    */
      __IM  uint32_t            : 8;
      __IOM uint32_t PP_CH0_UP_IS : 1;          /*!< [16..16] ADC1 Post-Processing-Channel 0 Upper Threshold Interrupt
                                                     Status                                                                    */
      __IOM uint32_t VS_UP_IS   : 1;            /*!< [17..17] ADC1 Post-Processing-Channel 1 Upper Threshold Interrupt
                                                     Status                                                                    */
      __IOM uint32_t PP_CH2_UP_IS : 1;          /*!< [18..18] ADC1 Post-Processing-Channel 2 Upper Threshold Interrupt
                                                     Status                                                                    */
      __IOM uint32_t PP_CH3_UP_IS : 1;          /*!< [19..19] ADC1 Post-Processing-Channel 3 Upper Threshold Interrupt
                                                     Status                                                                    */
      __IOM uint32_t PP_CH4_UP_IS : 1;          /*!< [20..20] ADC1 Post-Processing-Channel 4 Upper Threshold Interrupt
                                                     Status                                                                    */
      __IOM uint32_t PP_CH5_UP_IS : 1;          /*!< [21..21] ADC1 Post-Processing-Channel 5 Upper Threshold Interrupt
                                                     Status                                                                    */
      __IOM uint32_t PP_CH6_UP_IS : 1;          /*!< [22..22] ADC1 Post-Processing-Channel 6 Upper Threshold Interrupt
                                                     Status                                                                    */
      __IOM uint32_t PP_CH7_UP_IS : 1;          /*!< [23..23] ADC1 Post-Processing-Channel 7 Upper Threshold Interrupt
                                                     Status                                                                    */
    } bit;
  } IRQS_2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000104) ADC1 Status 2 Register                                     */
    
    struct {
      __IM  uint32_t PP_CH0_LO_STS : 1;         /*!< [0..0] ADC1 Post-Processing-Channel 0 Lower Threshold Status              */
      __IM  uint32_t VS_LO_STS  : 1;            /*!< [1..1] ADC1 Post-Processing-Channel 1 Lower Threshold Status              */
      __IM  uint32_t PP_CH2_LO_STS : 1;         /*!< [2..2] ADC1 Post-Processing-Channel 2 Lower Threshold Status              */
      __IM  uint32_t PP_CH3_LO_STS : 1;         /*!< [3..3] ADC1 Post-Processing-Channel 3 Lower Threshold Status              */
      __IM  uint32_t PP_CH4_LO_STS : 1;         /*!< [4..4] ADC1 Post-Processing-Channel 4 Lower Threshold Status              */
      __IM  uint32_t PP_CH5_LO_STS : 1;         /*!< [5..5] ADC1 Post-Processing-Channel 5 Lower Threshold Status              */
      __IM  uint32_t PP_CH6_LO_STS : 1;         /*!< [6..6] ADC1 Post-Processing-Channel 6 Lower Threshold Status              */
      __IM  uint32_t PP_CH7_LO_STS : 1;         /*!< [7..7] ADC1 Post-Processing-Channel 7 Lower Threshold Status              */
      __IM  uint32_t            : 8;
      __IM  uint32_t PP_CH0_UP_STS : 1;         /*!< [16..16] ADC1 Post-Processing-Channel 0 Upper Threshold Status            */
      __IM  uint32_t VS_UP_STS  : 1;            /*!< [17..17] ADC1 Post-Processing-Channel 1 Upper Threshold Status            */
      __IM  uint32_t PP_CH2_UP_STS : 1;         /*!< [18..18] ADC1 Post-Processing-Channel 2 Upper Threshold Status            */
      __IM  uint32_t PP_CH3_UP_STS : 1;         /*!< [19..19] ADC1 Post-Processing-Channel 3 Upper Threshold Status            */
      __IM  uint32_t PP_CH4_UP_STS : 1;         /*!< [20..20] ADC1 Post-Processing-Channel 4 Upper Threshold Status            */
      __IM  uint32_t PP_CH5_UP_STS : 1;         /*!< [21..21] ADC1 Post-Processing-Channel 5 Upper Threshold Status            */
      __IM  uint32_t PP_CH6_UP_STS : 1;         /*!< [22..22] ADC1 Post-Processing-Channel 6 Upper Threshold Status            */
      __IM  uint32_t PP_CH7_UP_STS : 1;         /*!< [23..23] ADC1 Post-Processing-Channel 7 Upper Threshold Status            */
    } bit;
  } STS_2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000108) ADC1 Interrupt Status Clear 2 Register                     */
    
