Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __OM  uint32_t PP_CH0_LO_ISC : 1;         /*!< [0..0] ADC1 Post-Processing-Channel 0 Lower Threshold Interrupt
                                                     Status Clear                                                              */
      __OM  uint32_t VS_LO_ISC  : 1;            /*!< [1..1] ADC1 Post-Processing-Channel 1 Lower Threshold Interrupt
                                                     Status Clear                                                              */
      __OM  uint32_t PP_CH2_LO_ISC : 1;         /*!< [2..2] ADC1 Post-Processing-Channel 2 Lower Threshold Interrupt
                                                     Status Clear                                                              */
      __OM  uint32_t PP_CH3_LO_ISC : 1;         /*!< [3..3] ADC1 Post-Processing-Channel 3 Lower Threshold Interrupt
                                                     Status Clear                                                              */
      __OM  uint32_t PP_CH4_LO_ISC : 1;         /*!< [4..4] ADC1 Post-Processing-Channel 4 Lower Threshold Interrupt
                                                     Status Clear                                                              */
      __OM  uint32_t PP_CH5_LO_ISC : 1;         /*!< [5..5] ADC1 Post-Processing-Channel 5 Lower Threshold Interrupt
                                                     Status Clear                                                              */
      __OM  uint32_t PP_CH6_LO_ISC : 1;         /*!< [6..6] ADC1 Post-Processing-Channel 6 Lower Threshold Interrupt
                                                     Status Clear                                                              */
      __OM  uint32_t PP_CH7_LO_ISC : 1;         /*!< [7..7] ADC1 Post-Processing-Channel 7 Lower Threshold Interrupt
                                                     Status Clear                                                              */
      __IM  uint32_t            : 8;
      __OM  uint32_t PP_CH0_UP_ISC : 1;         /*!< [16..16] ADC1 Post-Processing-Channel 0 Upper Threshold Interrupt
                                                     Status Clear                                                              */
      __OM  uint32_t VS_UP_ISC  : 1;            /*!< [17..17] ADC1 Post-Processing-Channel 1 Upper Threshold Interrupt
                                                     Status Clear                                                              */
      __OM  uint32_t PP_CH2_UP_ISC : 1;         /*!< [18..18] ADC1 Post-Processing-Channel 2 Upper Threshold Interrupt
                                                     Status Clear                                                              */
      __OM  uint32_t PP_CH3_UP_ISC : 1;         /*!< [19..19] ADC1 Post-Processing-Channel 3 Upper Threshold Interrupt
                                                     Status Clear                                                              */
      __OM  uint32_t PP_CH4_UP_ISC : 1;         /*!< [20..20] ADC1 Post-Processing-Channel 4 Upper Threshold Interrupt
                                                     Status Clear                                                              */
      __OM  uint32_t PP_CH5_UP_ISC : 1;         /*!< [21..21] ADC1 Post-Processing-Channel 5 Upper Threshold Interrupt
                                                     Status Clear                                                              */
      __OM  uint32_t PP_CH6_UP_ISC : 1;         /*!< [22..22] ADC1 Post-Processing-Channel 6 Upper Threshold Interrupt
                                                     Status Clear                                                              */
      __OM  uint32_t PP_CH7_UP_ISC : 1;         /*!< [23..23] ADC1 Post-Processing-Channel 7 Upper Threshold Interrupt
                                                     Status Clear                                                              */
    } bit;
  } IRQCLR_2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000010C) ADC1 Interrupt Enable 2 Register                           */
    
    struct {
      __IOM uint32_t PP_CH0_LO_IEN : 1;         /*!< [0..0] ADC1 Post-Processing-Channel 0 Lower Threshold Interrupt
                                                     Enable                                                                    */
      __IOM uint32_t VS_LO_IEN  : 1;            /*!< [1..1] ADC1 Post-Processing-Channel 1 Lower Threshold Interrupt
                                                     Enable                                                                    */
      __IOM uint32_t PP_CH2_LO_IEN : 1;         /*!< [2..2] ADC1 Post-Processing-Channel 2 Lower Threshold Interrupt
                                                     Enable                                                                    */
      __IOM uint32_t PP_CH3_LO_IEN : 1;         /*!< [3..3] ADC1 Post-Processing-Channel 3 Lower Threshold Interrupt
                                                     Enable                                                                    */
      __IOM uint32_t PP_CH4_LO_IEN : 1;         /*!< [4..4] ADC1 Post-Processing-Channel 4 Lower Threshold Interrupt
                                                     Enable                                                                    */
      __IOM uint32_t PP_CH5_LO_IEN : 1;         /*!< [5..5] ADC1 Post-Processing-Channel 5 Lower Threshold Interrupt
                                                     Enable                                                                    */
      __IOM uint32_t PP_CH6_LO_IEN : 1;         /*!< [6..6] ADC1 Post-Processing-Channel 6 Lower Threshold Interrupt
                                                     Enable                                                                    */
      __IOM uint32_t PP_CH7_LO_IEN : 1;         /*!< [7..7] ADC1 Post-Processing-Channel 7 Lower Threshold Interrupt
                                                     Enable                                                                    */
      __IM  uint32_t            : 8;
      __IOM uint32_t PP_CH0_UP_IEN : 1;         /*!< [16..16] ADC1 Post-Processing-Channel 0 Upper Threshold Interrupt
                                                     Enable                                                                    */
      __IOM uint32_t VS_UP_IEN  : 1;            /*!< [17..17] ADC1 Post-Processing-Channel 1 Upper Threshold Interrupt
                                                     Enable                                                                    */
      __IOM uint32_t PP_CH2_UP_IEN : 1;         /*!< [18..18] ADC1 Post-Processing-Channel 2 Upper Threshold Interrupt
                                                     Enable                                                                    */
      __IOM uint32_t PP_CH3_UP_IEN : 1;         /*!< [19..19] ADC1 Post-Processing-Channel 3 Upper Threshold Interrupt
                                                     Enable                                                                    */
      __IOM uint32_t PP_CH4_UP_IEN : 1;         /*!< [20..20] ADC1 Post-Processing-Channel 4 Upper Threshold Interrupt
                                                     Enable                                                                    */
      __IOM uint32_t PP_CH5_UP_IEN : 1;         /*!< [21..21] ADC1 Post-Processing-Channel 5 Upper Threshold Interrupt
                                                     Enable                                                                    */
      __IOM uint32_t PP_CH6_UP_IEN : 1;         /*!< [22..22] ADC1 Post-Processing-Channel 6 Upper Threshold Interrupt
                                                     Enable                                                                    */
      __IOM uint32_t PP_CH7_UP_IEN : 1;         /*!< [23..23] ADC1 Post-Processing-Channel 7 Upper Threshold Interrupt
                                                     Enable                                                                    */
    } bit;
  } IRQEN_2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000110) ADC1 or Filter Output Channel 12                           */
    
