Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IM  uint32_t FILT_OUT_CH12 : 12;        /*!< [11..0] ADC or filter output value channel 12                             */
      __IM  uint32_t            : 4;
      __IOM uint32_t WFR12      : 1;            /*!< [16..16] Wait for Read Mode                                               */
      __IM  uint32_t VF12       : 1;            /*!< [17..17] Valid Flag                                                       */
      __IM  uint32_t OF12       : 1;            /*!< [18..18] Overrun Flag                                                     */
    } bit;
  } FILT_OUT12;
  __IM  uint32_t  RESERVED6;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000118) Post-Processing Mapping Channel 0-3                        */
    
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t RESET_PP_MAP0 : 1;         /*!< [6..6] Post-Processing Reset for Mapped Post-Processing-Channel
                                                     0                                                                         */
      __IOM uint32_t EN_PP_MAP0 : 1;            /*!< [7..7] Mapping Enable for Post-Processing-Channel 0                       */
      __IM  uint32_t            : 6;
      __IOM uint32_t RESET_PP_MAP1 : 1;         /*!< [14..14] Post-Processing Reset for Mapped Post-Processing-Channel
                                                     1                                                                         */
      __IOM uint32_t EN_PP_MAP1 : 1;            /*!< [15..15] Mapping Enable for Post-Processing-Channel 1                     */
      __IOM uint32_t PP_MAP2    : 4;            /*!< [19..16] Mapping of Entry Channel to Post-Processing-Channel
                                                     2                                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t RESET_PP_MAP2 : 1;         /*!< [22..22] Post-Processing Reset for Mapped Post-Processing-Channel
                                                     2                                                                         */
      __IOM uint32_t EN_PP_MAP2 : 1;            /*!< [23..23] Mapping Enable for Post-Processing-Channel 2                     */
      __IOM uint32_t PP_MAP3    : 4;            /*!< [27..24] Mapping of Entry Channel to Post-Processing-Channel
                                                     3                                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t RESET_PP_MAP3 : 1;         /*!< [30..30] Post-Processing Reset for Mapped Post-Processing-Channel
                                                     3                                                                         */
      __IOM uint32_t EN_PP_MAP3 : 1;            /*!< [31..31] Mapping Enable for Post-Processing-Channel 3                     */
    } bit;
  } PP_MAP0_3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000011C) Post-Processing Mapping Channel 4-7                        */
    
    struct {
      __IOM uint32_t PP_MAP4    : 4;            /*!< [3..0] Mapping of Entry Channel to Post-Processing-Channel 4              */
      __IM  uint32_t            : 2;
      __IOM uint32_t RESET_PP_MAP4 : 1;         /*!< [6..6] Post-Processing Reset for Mapped Post-Processing-Channel
                                                     4                                                                         */
      __IOM uint32_t EN_PP_MAP4 : 1;            /*!< [7..7] Mapping Enable for Post-Processing-Channel 4                       */
      __IOM uint32_t PP_MAP5    : 4;            /*!< [11..8] Mapping of Entry Channel to Post-Processing-Channel
                                                     5                                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t RESET_PP_MAP5 : 1;         /*!< [14..14] Post-Processing Reset for Mapped Post-Processing-Channel
                                                     5                                                                         */
      __IOM uint32_t EN_PP_MAP5 : 1;            /*!< [15..15] Mapping Enable for Post-Processing-Channel 5                     */
      __IOM uint32_t PP_MAP6    : 4;            /*!< [19..16] Mapping of Entry Channel to Post-Processing-Channel
                                                     6                                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t RESET_PP_MAP6 : 1;         /*!< [22..22] Post-Processing Reset for Mapped Post-Processing-Channel
                                                     6                                                                         */
      __IOM uint32_t EN_PP_MAP6 : 1;            /*!< [23..23] Mapping Enable for Post-Processing-Channel 6                     */
      __IOM uint32_t PP_MAP7    : 4;            /*!< [27..24] Mapping of Entry Channel to Post-Processing-Channel
                                                     7                                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t RESET_PP_MAP7 : 1;         /*!< [30..30] Post-Processing Reset for Mapped Post-Processing-Channel
                                                     7                                                                         */
      __IOM uint32_t EN_PP_MAP7 : 1;            /*!< [31..31] Mapping Enable for Post-Processing-Channel 7                     */
    } bit;
  } PP_MAP4_7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000120) ADC1 or Filter Output of EIM                               */
    
    struct {
      __IM  uint32_t FILT_OUT_EIM : 12;         /*!< [11..0] ADC or filter output value for last EIM measurement               */
      __IM  uint32_t            : 4;
      __IOM uint32_t WFR_EIM    : 1;            /*!< [16..16] Wait for Read Mode                                               */
      __IM  uint32_t VF_EIM     : 1;            /*!< [17..17] Valid Flag                                                       */
      __IM  uint32_t OF_EIM     : 1;            /*!< [18..18] Overrun Flag                                                     */
    } bit;
  } FILT_OUTEIM;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000124) ADC1 Status 1Register                                      */
    
