Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IM  uint32_t            : 24;
      __IOM uint32_t DU1LO_STS  : 1;            /*!< [24..24] ADC1 Differential Unit 1 (DU1) lower Channel Status              */
      __IOM uint32_t DU1UP_STS  : 1;            /*!< [25..25] ADC1 Differential Unit 1 (DU1) upper Channel Status              */
    } bit;
  } STS_1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000128) ADC1 Status Clear 1 Register                               */
    
    struct {
      __IM  uint32_t            : 24;
      __OM  uint32_t DU1LO_SC   : 1;            /*!< [24..24] ADC1 Differential Unit 1 (DU1) lower Channel Status
                                                     Clear                                                                     */
      __OM  uint32_t DU1UP_SC   : 1;            /*!< [25..25] ADC1 Differential Unit 1 (DU1) upper Channel Status
                                                     Clear                                                                     */
    } bit;
  } STSCLR_1;
  __IM  uint32_t  RESERVED7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000130) Measurement Unit 1 Channel Enable Bits for Cycle
                                                                    12-13                                                      */
    
    struct {
      __IOM uint32_t SQ12       : 14;           /*!< [13..0] Sequence 12 channel enable                                        */
      __IM  uint32_t            : 2;
      __IOM uint32_t SQ13       : 14;           /*!< [29..16] Sequence 13 channel enable                                       */
    } bit;
  } SQ12_13;
  __IM  uint32_t  RESERVED8;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000138) Calibration for Channel 12 and 13                          */
    
    struct {
      __IOM uint32_t CALOFFS_CH12 : 5;          /*!< [4..0] Offset Calibration for channel 12                                  */
      __IM  uint32_t            : 3;
      __IOM uint32_t CALGAIN_CH12 : 8;          /*!< [15..8] Gain Calibration for channel 12                                   */
      __IOM uint32_t CALOFFS_CH13 : 5;          /*!< [20..16] Offset Calibration for channel 13                                */
      __IM  uint32_t            : 3;
      __IOM uint32_t CALGAIN_CH13 : 8;          /*!< [31..24] Gain Calibration for channel 13                                  */
    } bit;
  } CAL_CH12_13;
  __IM  uint32_t  RESERVED9;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000140) ADC1 or Filter Output Channel 13                           */
    
    struct {
      __IM  uint32_t FILT_OUT_CH13 : 12;        /*!< [11..0] ADC or filter output value channel 13                             */
      __IM  uint32_t            : 4;
      __IOM uint32_t WFR13      : 1;            /*!< [16..16] Wait for Read Mode                                               */
      __IM  uint32_t VF13       : 1;            /*!< [17..17] Valid Flag                                                       */
      __IM  uint32_t OF13       : 1;            /*!< [18..18] Overrun Flag                                                     */
    } bit;
  } FILT_OUT13;
} ADC1_Type;                                    /*!< Size = 324 (0x144)                                                        */



/* =========================================================================================================================== */
/* ================                                           ADC2                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief ADC2 (ADC2)
  */

typedef struct {                                /*!< (@ 0x4801C000) ADC2 Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) ADC2 Control and Status Register                           */
    
    struct {
      __IOM uint32_t PD_N       : 1;            /*!< [0..0] ADC2 Power Down Signal                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t SOS        : 1;            /*!< [2..2] ADC2 Start of Sampling/Conversion (software mode)                  */
      __IM  uint32_t EOC        : 1;            /*!< [3..3] ADC2 End of Conversion in software mode                            */
      __IM  uint32_t            : 4;
      __IOM uint32_t IN_MUX_SEL : 4;            /*!< [11..8] Channel for software mode                                         */
    } bit;
  } CTRL_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Sequencer Feedback Register                                */
    
    struct {
      __IM  uint32_t SQ_FB      : 4;            /*!< [3..0] Current Sequence that caused software mode                         */
      __IM  uint32_t            : 4;
      __IM  uint32_t SQ_STOP    : 1;            /*!< [8..8] ADC2 Sequencer Stop Signal for DPP                                 */
      __IM  uint32_t EIM_ACTIVE : 1;            /*!< [9..9] ADC2 EIM active                                                    */
      __IM  uint32_t            : 1;
      __IM  uint32_t SQx        : 4;            /*!< [14..11] Current active ADC2 Sequence (in normal mode)                    */
      __IM  uint32_t            : 1;
      __IM  uint32_t CHx        : 4;            /*!< [19..16] Current active ADC2 Channel (in normal mode)                     */
    } bit;
  } SQ_FB;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Channel Settings Bits for Exceptional Interrupt
                                                                    Measurement                                                */
    
    struct {
      __IOM uint32_t CHx_SEL    : 4;            /*!< [3..0] Channel set for exceptional interrupt measurement (EIM)            */
      __IM  uint32_t            : 4;
      __IOM uint32_t REP        : 3;            /*!< [10..8] Repeat count for exceptional interrupt measurement (EIM)          */
      __IOM uint32_t EN         : 1;            /*!< [11..11] Exceptional interrupt measurement (EIM) Trigger Event
                                                     enable                                                                    */
      __IOM uint32_t SEL        : 1;            /*!< [12..12] Exceptional interrupt measurement (EIM) Trigger select           */
    } bit;
  } CHx_EIM;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Maximum Time for Software Mode                             */
    
