Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t MAX_TIME   : 8;            /*!< [7..0] Maximum Time in Software Mode                                      */
    } bit;
  } MAX_TIME;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Measurement Unit Control Register 1                        */
    
    struct {
      __IOM uint32_t CALIB_EN_8_0 : 9;          /*!< [8..0] Calibration Enable for Channels 8 to 0                             */
    } bit;
  } CTRL1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Measurement Unit Control Register 2                        */
    
    struct {
      __IOM uint32_t MCM_PD_N   : 1;            /*!< [0..0] Power Down Signal for MCM                                          */
      __IM  uint32_t            : 6;
      __IM  uint32_t MCM_RDY    : 1;            /*!< [7..7] Ready Signal for MCM after Power On or Reset                       */
      __IOM uint32_t SAMPLE_TIME_int : 4;       /*!< [11..8] Sample time of ADC2                                               */
    } bit;
  } CTRL2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Measurement Unit Control Register 4                        */
    
    struct {
      __IOM uint32_t FILT_OUT_SEL_8_0 : 9;      /*!< [8..0] Output Filter Selection for Channels 0 to 8                        */
    } bit;
  } CTRL4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Measurement Channel Enable Bits for Sequence
                                                                    0-1                                                        */
    
    struct {
      __IOM uint32_t SQ0        : 9;            /*!< [8..0] Sequence 0 channel enable                                          */
      __IM  uint32_t            : 7;
      __IOM uint32_t SQ1        : 9;            /*!< [24..16] Sequence 1 channel enable                                        */
    } bit;
  } SQ0_1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Measurement Channel Enable Bits for Sequence
                                                                    4 - 5                                                      */
    
    struct {
      __IOM uint32_t SQ4        : 9;            /*!< [8..0] Sequence 4 channel enable                                          */
      __IM  uint32_t            : 7;
      __IOM uint32_t SQ5        : 9;            /*!< [24..16] Sequence 5 channel enable                                        */
    } bit;
  } SQ4_5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Measurement Channel Enable Bits for Sequence
                                                                    2-3                                                        */
    
    struct {
      __IOM uint32_t SQ2        : 9;            /*!< [8..0] Sequence 2 channel enable                                          */
      __IM  uint32_t            : 7;
      __IOM uint32_t SQ3        : 9;            /*!< [24..16] Sequence 3 channel enable                                        */
    } bit;
  } SQ2_3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) Measurement Channel Enable Bits for Sequence
                                                                    6 - 7                                                      */
    
    struct {
      __IOM uint32_t SQ6        : 9;            /*!< [8..0] Sequence 6 channel enable                                          */
      __IM  uint32_t            : 7;
      __IOM uint32_t SQ7        : 9;            /*!< [24..16] Sequence 7 channel enable                                        */
    } bit;
  } SQ6_7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Measurement Channel Enable Bits for Sequence
                                                                    8                                                          */
    
    struct {
      __IOM uint32_t SQ8        : 9;            /*!< [8..0] Sequence 8 channel enable                                          */
    } bit;
  } SQ8_9;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) Calibration for Channel 0 and 1                            */
    
    struct {
      __IOM uint32_t OFFS_CH0   : 5;            /*!< [4..0] Offset Calibration for channel 0                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t GAIN_CH0   : 8;            /*!< [15..8] Gain Calibration for channel 0                                    */
      __IOM uint32_t OFFS_CH1   : 5;            /*!< [20..16] Offset Calibration for channel 1                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t GAIN_CH1   : 8;            /*!< [31..24] Gain Calibration for channel 1                                   */
    } bit;
  } CAL_CH0_1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) Calibration for Channel 2 and 3                            */
    
    struct {
      __IOM uint32_t OFFS_CH2   : 5;            /*!< [4..0] Offset Calibration for channel 2                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t GAIN_CH2   : 8;            /*!< [15..8] Gain Calibration for channel 2                                    */
      __IOM uint32_t OFFS_CH3   : 5;            /*!< [20..16] Offset Calibration for channel 3                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t GAIN_CH3   : 8;            /*!< [31..24] Gain Calibration for channel 3                                   */
    } bit;
  } CAL_CH2_3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) Calibration for Channel 4 and 5                            */
    
    struct {
      __IOM uint32_t OFFS_CH4   : 5;            /*!< [4..0] Offset Calibration for channel 4                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t GAIN_CH4   : 8;            /*!< [15..8] Gain Calibration for channel 4                                    */
      __IOM uint32_t OFFS_CH5   : 5;            /*!< [20..16] Offset Calibration for channel 5                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t GAIN_CH5   : 8;            /*!< [31..24] Gain Calibration for channel 5                                   */
    } bit;
  } CAL_CH4_5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Calibration for Channel 6 and 7                            */
    
