Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t OFFS_CH6   : 5;            /*!< [4..0] Offset Calibration for channel 6                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t GAIN_CH6   : 8;            /*!< [15..8] Gain Calibration for channel 6                                    */
      __IOM uint32_t OFFS_CH7   : 5;            /*!< [20..16] Offset Calibration for channel 7                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t GAIN_CH7   : 8;            /*!< [31..24] Gain Calibration for channel 7                                   */
    } bit;
  } CAL_CH6_7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000044) Calibration for Channel 8                                  */
    
    struct {
      __IOM uint32_t OFFS_CH8   : 5;            /*!< [4..0] Offset Calibration for channel 8                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t GAIN_CH8   : 8;            /*!< [15..8] Gain Calibration for channel 8                                    */
    } bit;
  } CAL_CH8_9;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000048) Filter Coefficients ADC Channel 0-8                        */
    
    struct {
      __IOM uint32_t A_CH0      : 2;            /*!< [1..0] Filter Coefficient A for ADC channel 0                             */
      __IOM uint32_t A_CH1      : 2;            /*!< [3..2] Filter Coefficient A for ADC channel 1                             */
      __IOM uint32_t A_CH2      : 2;            /*!< [5..4] Filter Coefficient A for ADC channel 2                             */
      __IOM uint32_t A_CH3      : 2;            /*!< [7..6] Filter Coefficient A for ADC channel 3                             */
      __IOM uint32_t A_CH4      : 2;            /*!< [9..8] Filter Coefficient A for ADC channel 4                             */
      __IOM uint32_t A_CH5      : 2;            /*!< [11..10] Filter Coefficient A for ADC channel 5                           */
      __IOM uint32_t A_CH6      : 2;            /*!< [13..12] Filter Coefficient A for ADC channel 6                           */
      __IOM uint32_t A_CH7      : 2;            /*!< [15..14] Filter Coefficient A for ADC channel 7                           */
      __IOM uint32_t A_CH8      : 2;            /*!< [17..16] Filter Coefficient A for ADC channel 8                           */
    } bit;
  } FILTCOEFF0_8;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) ADC or Filter Output Channel 0                             */
    
    struct {
      __IM  uint32_t OUT_CH0    : 10;           /*!< [9..0] ADC or filter output value channel 0                               */
    } bit;
  } FILT_OUT0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000054) ADC or Filter Output Channel 1                             */
    
    struct {
      __IM  uint32_t OUT_CH1    : 10;           /*!< [9..0] ADC or filter output value channel 1                               */
    } bit;
  } FILT_OUT1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000058) ADC or Filter Output Channel 2                             */
    
    struct {
      __IM  uint32_t OUT_CH2    : 10;           /*!< [9..0] ADC or filter output value channel 2                               */
    } bit;
  } FILT_OUT2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000005C) ADC or Filter Output Channel 3                             */
    
    struct {
      __IM  uint32_t OUT_CH3    : 10;           /*!< [9..0] ADC or filter output value channel 3                               */
    } bit;
  } FILT_OUT3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) ADC or Filter Output Channel 4                             */
    
    struct {
      __IM  uint32_t OUT_CH4    : 10;           /*!< [9..0] ADC or filter output value channel 4                               */
    } bit;
  } FILT_OUT4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000064) ADC or Filter Output Channel 5                             */
    
    struct {
      __IM  uint32_t OUT_CH5    : 10;           /*!< [9..0] ADC or filter output value channel 5                               */
    } bit;
  } FILT_OUT5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000068) ADC or Filter Output Channel 6                             */
    
    struct {
      __IM  uint32_t OUT_CH6    : 10;           /*!< [9..0] ADC or filter output value channel 6                               */
    } bit;
  } FILT_OUT6;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000006C) ADC or Filter Output Channel 7                             */
    
    struct {
      __IM  uint32_t OUT_CH7    : 10;           /*!< [9..0] ADC or filter output value channel 7                               */
    } bit;
  } FILT_OUT7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) ADC or Filter Output Channel 8                             */
    
    struct {
      __IM  uint32_t OUT_CH8    : 10;           /*!< [9..0] ADC or filter output value channel 8                               */
    } bit;
  } FILT_OUT8;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000078) Upper and Lower Threshold Filter Enable                    */
    
    struct {
      __IOM uint32_t UPLOEN_Ch0 : 1;            /*!< [0..0] Upper and lower threshold IIR filter enable ch 0                   */
      __IOM uint32_t UPLOEN_Ch1 : 1;            /*!< [1..1] Upper and lower threshold IIR filter enable ch 1                   */
      __IOM uint32_t UPLOEN_Ch2 : 1;            /*!< [2..2] Upper and lower threshold IIR filter enable ch 2                   */
      __IOM uint32_t UPLOEN_Ch3 : 1;            /*!< [3..3] Upper and lower threshold IIR filter enable ch 3                   */
      __IOM uint32_t UPLOEN_Ch4 : 1;            /*!< [4..4] Upper and lower threshold IIR filter enable ch 4                   */
      __IOM uint32_t UPLOEN_Ch5 : 1;            /*!< [5..5] Upper and lower threshold IIR filter enable ch 5                   */
      __IOM uint32_t UPLOEN_Ch6 : 1;            /*!< [6..6] Upper and lower threshold IIR filter enable ch 6                   */
      __IOM uint32_t UPLOEN_Ch7 : 1;            /*!< [7..7] Upper and lower threshold IIR filter enable ch 7                   */
      __IOM uint32_t UPLOEN_Ch8 : 1;            /*!< [8..8] Upper and lower threshold IIR filter enable ch 8                   */
    } bit;
  } FILT_UPLO_CTRL;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) Lower Comparator Trigger Level Channel 0 -3                */
    
