Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t THLO_CH0   : 8;            /*!< [7..0] Channel 0 lower trigger level                                      */
      __IOM uint32_t THLO_CH1   : 8;            /*!< [15..8] Channel 1 lower trigger level                                     */
      __IOM uint32_t THLO_CH2   : 8;            /*!< [23..16] Channel 2 lower trigger level                                    */
      __IOM uint32_t THLO_CH3   : 8;            /*!< [31..24] Channel 3 lower trigger level                                    */
    } bit;
  } TH0_3_LOWER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000084) Lower Comparator Trigger Level Channel 4 to 7              */
    
    struct {
      __IOM uint32_t THLO_CH4   : 8;            /*!< [7..0] Channel 4 lower trigger level                                      */
      __IOM uint32_t THLO_CH5   : 8;            /*!< [15..8] Channel 5 lower trigger level                                     */
      __IOM uint32_t THLO_CH6   : 8;            /*!< [23..16] Channel 6 lower trigger level                                    */
      __IOM uint32_t THLO_CH7   : 8;            /*!< [31..24] Channel 7 lower trigger level                                    */
    } bit;
  } TH4_7_LOWER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000088) Lower Comparator Trigger Level Channel 8                   */
    
    struct {
      __IOM uint32_t THLO_CH8   : 8;            /*!< [7..0] Channel 8 lower trigger level                                      */
    } bit;
  } TH8_11_LOWER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000008C) Upper Comparator Trigger Level Channel 0-3                 */
    
    struct {
      __IOM uint32_t THUP_CH0   : 8;            /*!< [7..0] Channel 0 upper trigger level                                      */
      __IOM uint32_t THUP_CH1   : 8;            /*!< [15..8] Channel 1 upper trigger level                                     */
      __IOM uint32_t THUP_CH2   : 8;            /*!< [23..16] Channel 2 upper trigger level                                    */
      __IOM uint32_t THUP_CH3   : 8;            /*!< [31..24] Channel 3 upper trigger level                                    */
    } bit;
  } TH0_3_UPPER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) Upper Comparator Trigger Level Channel 4 -7                */
    
    struct {
      __IOM uint32_t THUP_CH4   : 8;            /*!< [7..0] Channel 4 upper trigger level                                      */
      __IOM uint32_t THUP_CH5   : 8;            /*!< [15..8] Channel 5 upper trigger level                                     */
      __IOM uint32_t THUP_CH6   : 8;            /*!< [23..16] Channel 6 upper trigger level                                    */
      __IOM uint32_t THUP_CH7   : 8;            /*!< [31..24] Channel 7 upper trigger level                                    */
    } bit;
  } TH4_7_UPPER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000094) Upper Comparator Trigger Level Channel 8                   */
    
    struct {
      __IOM uint32_t THUP_CH8   : 8;            /*!< [7..0] Channel 8 upper trigger level                                      */
    } bit;
  } TH8_11_UPPER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000098) Lower Counter Trigger Level Channel 0 - 3                  */
    
    struct {
      __IOM uint32_t CNT_LO_CH0 : 2;            /*!< [1..0] Lower timer trigger threshold channel 0                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_CH0 : 2;           /*!< [4..3] Channel 0 lower hysteresis                                         */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_LO_CH1 : 2;            /*!< [9..8] Lower timer trigger threshold channel 1                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_CH1 : 2;           /*!< [12..11] Channel 1 lower hysteresis                                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_LO_CH2 : 2;            /*!< [17..16] Lower timer trigger threshold channel 2                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_CH2 : 2;           /*!< [20..19] Channel 2 lower hysteresis                                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_LO_CH3 : 2;            /*!< [25..24] Lower timer trigger threshold channel 3                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_CH3 : 2;           /*!< [28..27] Channel 3 lower hysteresis                                       */
    } bit;
  } CNT0_3_LOWER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000009C) Lower Counter Trigger Level Channel 4 to 7                 */
    
    struct {
      __IOM uint32_t CNT_LO_CH4 : 2;            /*!< [1..0] Lower timer trigger threshold channel 4                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_CH4 : 2;           /*!< [4..3] Channel 4 lower hysteresis                                         */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_LO_CH5 : 2;            /*!< [9..8] Lower timer trigger threshold channel 5                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_CH5 : 2;           /*!< [12..11] Channel 5 lower hysteresis                                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_LO_CH6 : 2;            /*!< [17..16] Lower timer trigger threshold channel 6                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_CH6 : 2;           /*!< [20..19] Channel 6 lower hysteresis                                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_LO_CH7 : 2;            /*!< [25..24] Lower timer trigger threshold channel 7                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_CH7 : 2;           /*!< [28..27] Channel 7 lower hysteresis                                       */
    } bit;
  } CNT4_7_LOWER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) Lower Counter Trigger Level Channel 8                      */
    
