Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t CNT_LO_CH8 : 2;            /*!< [1..0] Lower timer trigger threshold channel 8                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_LO_CH8 : 2;           /*!< [4..3] Channel 8 lower hysteresis                                         */
    } bit;
  } CNT8_11_LOWER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A4) Upper Counter Trigger Level Channel 0 - 3                  */
    
    struct {
      __IOM uint32_t CNT_UP_CH0 : 2;            /*!< [1..0] Upper timer trigger threshold channel 0                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_CH0 : 2;           /*!< [4..3] Channel 0 upper hysteresis                                         */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_UP_CH1 : 2;            /*!< [9..8] Upper timer trigger threshold channel 1                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_CH1 : 2;           /*!< [12..11] Channel 1 upper hysteresis                                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_UP_CH2 : 2;            /*!< [17..16] Upper timer trigger threshold channel 2                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_CH2 : 2;           /*!< [20..19] Channel 2 upper hysteresis                                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_UP_CH3 : 2;            /*!< [25..24] Upper timer trigger threshold channel 3                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_CH3 : 2;           /*!< [28..27] Channel 3 upper hysteresis                                       */
    } bit;
  } CNT0_3_UPPER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A8) Upper Counter Trigger Level Channel 4 to 7                 */
    
    struct {
      __IOM uint32_t CNT_UP_CH4 : 2;            /*!< [1..0] Upper timer trigger threshold channel 4                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_CH4 : 2;           /*!< [4..3] Channel 4 upper hysteresis                                         */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_UP_CH5 : 2;            /*!< [9..8] Upper timer trigger threshold channel 5                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_CH5 : 2;           /*!< [12..11] Channel 5 upper hysteresis                                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_UP_CH6 : 2;            /*!< [17..16] Upper timer trigger threshold channel 6                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_CH6 : 2;           /*!< [20..19] Channel 6 upper hysteresis                                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t CNT_UP_CH7 : 2;            /*!< [25..24] Upper timer trigger threshold channel 7                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_CH7 : 2;           /*!< [28..27] Channel 7 upper hysteresis                                       */
    } bit;
  } CNT4_7_UPPER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000AC) Upper Counter Trigger Level Channel 8                      */
    
    struct {
      __IOM uint32_t CNT_UP_CH8 : 2;            /*!< [1..0] Upper timer trigger threshold channel 8                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t HYST_UP_CH8 : 2;           /*!< [4..3] Channel 8 upper hysteresis                                         */
    } bit;
  } CNT8_11_UPPER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B0) Measurement Mode of Ch 0-8                                 */
    
    struct {
      __IOM uint32_t MSEL_Ch0   : 2;            /*!< [1..0] Measurement mode ch 0                                              */
      __IOM uint32_t MSEL_Ch1   : 2;            /*!< [3..2] Measurement mode ch 1                                              */
      __IOM uint32_t MSEL_Ch2   : 2;            /*!< [5..4] Measurement mode ch 2                                              */
      __IOM uint32_t MSEL_Ch3   : 2;            /*!< [7..6] Measurement mode ch 3                                              */
      __IOM uint32_t MSEL_Ch4   : 2;            /*!< [9..8] Measurement mode ch 4                                              */
      __IOM uint32_t MSEL_Ch5   : 2;            /*!< [11..10] Measurement mode ch 5                                            */
      __IOM uint32_t MSEL_Ch6   : 2;            /*!< [13..12] Measurement mode ch 6                                            */
      __IOM uint32_t MSEL_Ch7   : 2;            /*!< [15..14] Measurement mode ch 7                                            */
      __IOM uint32_t MSEL_Ch8   : 2;            /*!< [17..16] Measurement mode ch 8                                            */
    } bit;
  } MMODE0_8;
  __IM  uint32_t  RESERVED4[2];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000BC) ADC2 HV Status Register                                    */
    
    struct {
      __IM  uint32_t            : 1;
      __IM  uint32_t READY      : 1;            /*!< [1..1] HVADC Ready bit                                                    */
    } bit;
  } STATUS;
} ADC2_Type;                                    /*!< Size = 192 (0xc0)                                                         */



/* =========================================================================================================================== */
/* ================                                           BDRV                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief BDRV (BDRV)
  */

typedef struct {                                /*!< (@ 0x40034000) BDRV Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) H-Bridge Driver Control 1                                  */
    
