Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t LS1_EN     : 1;            /*!< [0..0] Low Side Driver 1 Enable                                           */
      __IOM uint32_t LS1_PWM    : 1;            /*!< [1..1] Low Side Driver 1 PWM Enable                                       */
      __IOM uint32_t LS1_ON     : 1;            /*!< [2..2] Low Side Driver 1 On                                               */
      __IM  uint32_t            : 2;
      __IM  uint32_t LS1_SUPERR_STS : 1;        /*!< [5..5] Low Side Driver 1 Supply Error Status                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t LS1_OC_DIS : 1;            /*!< [7..7] Low Side Driver 1 Overcurrent Shutdown Select                      */
      __IOM uint32_t LS2_EN     : 1;            /*!< [8..8] Low Side Driver 2 Enable                                           */
      __IOM uint32_t LS2_PWM    : 1;            /*!< [9..9] Low Side Driver 2 PWM Enable                                       */
      __IOM uint32_t LS2_ON     : 1;            /*!< [10..10] Low Side Driver 2 On                                             */
      __IM  uint32_t            : 2;
      __IM  uint32_t LS2_SUPERR_STS : 1;        /*!< [13..13] Low Side Driver 2 Supply Error Status                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t LS2_OC_DIS : 1;            /*!< [15..15] Low Side Driver Overcurrent Shutdown Select                      */
      __IOM uint32_t HS1_EN     : 1;            /*!< [16..16] High Side Driver 1 Enable                                        */
      __IOM uint32_t HS1_PWM    : 1;            /*!< [17..17] High Side Driver 1 PWM Enable                                    */
      __IOM uint32_t HS1_ON     : 1;            /*!< [18..18] High Side Driver 1 On                                            */
      __IOM uint32_t HS1_DCS_EN : 1;            /*!< [19..19] High Side Driver 1 Diagnosis Current Source Enable               */
      __IM  uint32_t            : 1;
      __IM  uint32_t HS1_SUPERR_STS : 1;        /*!< [21..21] High Side Driver 1 Supply Error Status                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t HS1_OC_DIS : 1;            /*!< [23..23] High Side Driver Overcurrent Shutdown Select                     */
      __IOM uint32_t HS2_EN     : 1;            /*!< [24..24] High Side Driver 2 Enable                                        */
      __IOM uint32_t HS2_PWM    : 1;            /*!< [25..25] High Side Driver 2 PWM Enable                                    */
      __IOM uint32_t HS2_ON     : 1;            /*!< [26..26] High Side Driver 2 On                                            */
      __IOM uint32_t HS2_DCS_EN : 1;            /*!< [27..27] High Side Driver 2 Diagnosis Current Source Enable               */
      __IM  uint32_t            : 1;
      __IM  uint32_t HS2_SUPERR_STS : 1;        /*!< [29..29] High Side Driver 2 Supply Error Status                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t HS2_OC_DIS : 1;            /*!< [31..31] High Side Driver Overcurrent Shutdown Select                     */
    } bit;
  } CTRL1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) H-Bridge Driver Control 2                                  */
    
    struct {
      __IOM uint32_t HB1ONSEQCNF : 1;           /*!< [0..0] Half Bridge 1 On Sequencer Configuration                           */
      __IOM uint32_t HB2ONSEQCNF : 1;           /*!< [1..1] Half Bridge 2 On Sequencer Configuration                           */
      __IOM uint32_t HB1OFFSEQCNF : 1;          /*!< [2..2] Half Bridge 1 Off Sequencer Configuration                          */
      __IOM uint32_t HB2OFFSEQCNF : 1;          /*!< [3..3] Half Bridge 2 Off Sequencer Configuration                          */
      __IM  uint32_t            : 12;
      __IM  uint32_t DLY_DIAG_TIM : 10;         /*!< [25..16] Ext. power diag timer result register                            */
      __OM  uint32_t DLY_DIAG_SCLR : 1;         /*!< [26..26] Ext. power diag timer valid flag clear                           */
      __IM  uint32_t DLY_DIAG_STS : 1;          /*!< [27..27] Ext. power diag timer valid flag                                 */
      __IOM uint32_t DLY_DIAG_CHSEL : 3;        /*!< [30..28] Ext. power diag timer channel select                             */
      __IOM uint32_t DLY_DIAG_DIRSEL : 1;       /*!< [31..31] Ext. power diag timer on / off select                            */
    } bit;
  } CTRL2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) H-Bridge Driver Control 3                                  */
    
    struct {
      __IM  uint32_t            : 16;
      __IOM uint32_t DSMONVTH   : 3;            /*!< [18..16] Voltage Threshold for Drain-Source Monitoring of external
                                                     FETs                                                                      */
      __IM  uint32_t            : 5;
      __IOM uint32_t DRV_CCP_TIMSEL : 2;        /*!< [25..24] Minimum cross conduction protection time setting                 */
      __IM  uint32_t            : 2;
      __IOM uint32_t DRV_CCP_TMUL : 2;          /*!< [29..28] Multiplier bits for cross conduction time settings
                                                     in register DRV_CCP_TIMSEL                                                */
      __IOM uint32_t DRV_CCP_DIS : 1;           /*!< [30..30] Dynamic cross conduction protection Disable                      */
    } bit;
  } CTRL3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) PWM Source Selection Register                              */
    
    struct {
      __IOM uint32_t LS1_SRC_SEL : 2;           /*!< [1..0] LS1 PWM Source Selection                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t LS2_SRC_SEL : 2;           /*!< [4..3] LS2 PWM Source Selection                                           */
      __IM  uint32_t            : 11;
      __IOM uint32_t HS1_SRC_SEL : 2;           /*!< [17..16] HS1 PWM Source Selection                                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t HS2_SRC_SEL : 2;           /*!< [20..19] HS2 PWM Source Selection                                         */
    } bit;
  } PWMSRCSEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Slewrate Sequencer Mapping Register                        */
    
