Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t HB1_SEQMAP : 1;            /*!< [0..0] Half Bridge 1 Sequencer Mapping                                    */
      __IM  uint32_t            : 1;
      __IOM uint32_t HB2_SEQMAP : 1;            /*!< [2..2] Half Bridge 2 Sequencer Mapping                                    */
    } bit;
  } SEQMAP;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Trimming of Driver                                         */
    
    struct {
      __IOM uint32_t LS_HS_BT_TFILT_SEL : 2;    /*!< [1..0] Blanking Time for Drain-Source Monitoring of Low / High
                                                     Side Drivers                                                              */
      __IM  uint32_t            : 6;
      __IOM uint32_t LSDRV_DS_TFILT_SEL : 2;    /*!< [9..8] Filter Time for Drain-Source Monitoring of Low Side Drivers        */
      __IOM uint32_t LS1DRV_FDISCHG_DIS : 1;    /*!< [10..10] Low Side 1 Predriver fast discharge disable                      */
      __IOM uint32_t LS2DRV_FDISCHG_DIS : 1;    /*!< [11..11] Low Side 2 Predriver fast discharge disable                      */
      __IM  uint32_t            : 2;
      __IOM uint32_t LS1DRV_OCSDN_DIS : 1;      /*!< [14..14] Low Side 1 Predriver in overcurrent situation disable            */
      __IOM uint32_t LS2DRV_OCSDN_DIS : 1;      /*!< [15..15] Low Side 2 Predriver in overcurrent situation disable            */
      __IM  uint32_t            : 2;
      __IOM uint32_t HSDRV_DS_TFILT_SEL : 2;    /*!< [19..18] Filter Time for Drain-Source Monitoring of High Side
                                                     Drivers                                                                   */
      __IOM uint32_t HS1DRV_FDISCHG_DIS : 1;    /*!< [20..20] High Side 1 Predriver fast discharge disable                     */
      __IOM uint32_t HS2DRV_FDISCHG_DIS : 1;    /*!< [21..21] High Side 2 Predriver fast discharge disable                     */
      __IM  uint32_t            : 2;
      __IOM uint32_t HS1DRV_OCSDN_DIS : 1;      /*!< [24..24] High Side 1 Predriver in overcurrent situation disable           */
      __IOM uint32_t HS2DRV_OCSDN_DIS : 1;      /*!< [25..25] High Side 2 Predriver in overcurrent situation disable           */
      __IM  uint32_t            : 2;
      __IOM uint32_t CPLOW_TFILT_SEL : 2;       /*!< [29..28] Filter Time for Charge Pump Voltage Low Diagnosis                */
    } bit;
  } TRIM_DRVx;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Charge Pump Control and Status Register                    */
    
    struct {
      __IOM uint32_t CP_EN      : 1;            /*!< [0..0] Charge Pump Enable                                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t CP_RDY_EN  : 1;            /*!< [2..2] Bridge Driver on Charge Pump Ready Enable                          */
      __IM  uint32_t            : 5;
      __IOM uint32_t VCP_LOWTH2 : 3;            /*!< [10..8] Charge Pump Output Voltage Lower Threshold Detection
                                                     Level                                                                     */
      __IM  uint32_t            : 5;
      __IOM uint32_t DRVx_VCPLO_DIS : 1;        /*!< [16..16] Driver On Charge Pump Low Voltage Disable                        */
      __IOM uint32_t DRVx_VCPLO_SDEN : 1;       /*!< [17..17] Driver Charge Pump Low Voltage Shut-Down                         */
      __IOM uint32_t DRVx_VCPUP_DIS : 1;        /*!< [18..18] Driver On Charge Pump Upper Voltage Disable                      */
      __IM  uint32_t            : 1;
      __IOM uint32_t DRVx_VSDLO_DIS : 1;        /*!< [20..20] Driver On VSD Lower Voltage Disable                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t DRVx_VSDUP_DIS : 1;        /*!< [22..22] Driver On VSD Upper Voltage Disable                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t CPLOPWRM_EN : 1;           /*!< [24..24] Charge Pump Low Power Mode Enable                                */
      __IOM uint32_t VCP9V_SET  : 1;            /*!< [25..25] Charge Pump 9 V Output Voltage Set                               */
      __IOM uint32_t VTHVCP_TRIM : 2;           /*!< [27..26] Charge Pump Output Voltage Trimming                              */
      __IOM uint32_t VCP14_15V_SEL : 1;         /*!< [28..28] Charge Pump 15V/14V Output Voltage Sel                           */
      __IOM uint32_t CP_STAGE_SEL : 2;          /*!< [30..29] Charge Pump Output Voltage Trimming                              */
    } bit;
  } CP_CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Charge Pump Clock Control Register                         */
    
    struct {
      __IOM uint32_t DITH_LOWER : 5;            /*!< [4..0] CP_CLK lower frequency boundary during dithering                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t DITH_UPPER : 5;            /*!< [12..8] CP_CLK upper frequency boundary during dithering                  */
      __IOM uint32_t F_CP       : 2;            /*!< [14..13] MSB of CP_CLK divider                                            */
      __IOM uint32_t CPCLK_EN   : 1;            /*!< [15..15] Charge Pump Clock Enable                                         */
      __IOM uint32_t CPCLKDIS_SET : 1;          /*!< [16..16] Charge Pump Clock Set If Disabled                                */
    } bit;
  } CP_CLK_CTRL;
  __IM  uint32_t  RESERVED2[2];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Gate Current Clamping Value in ON State                    */
    
    struct {
      __IOM uint32_t HB1_ICLMPON : 6;           /*!< [5..0] Half Bridge 1-current clamping value for ON state                  */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB2_ICLMPON : 6;           /*!< [13..8] Half Bridge 2-current clamping value for ON state                 */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB1AF_ICLMPON : 6;         /*!< [21..16] Half Bridge 1-active freewheeling-current clamping
                                                     value for ON state                                                        */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB2AF_ICLMPON : 6;         /*!< [29..24] Half Bridge 2-active freewheeling-current clamping
                                                     value for ON state                                                        */
    } bit;
  } IGATECLMPONC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) Gate Current Clamping Value in OFF State                   */
    
