Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t HB1_ICLMPOFF : 6;          /*!< [5..0] Half Bridge 1-current clamping value for OFF state                 */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB2_ICLMPOFF : 6;          /*!< [13..8] Half Bridge 2-current clamping value for OFF state                */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB1AF_ICLMPOFF : 6;        /*!< [21..16] Half Bridge 1-active freewheeling-current clamping
                                                     value for OFF state                                                       */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB2AF_ICLMPOFF : 6;        /*!< [29..24] Half Bridge 2-active freewheeling-current clamping
                                                     value for OFF state                                                       */
    } bit;
  } IGATECLMPOFFC;
  __IM  uint32_t  RESERVED3[2];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Charge Pump Status Register                                */
    
    struct {
      __IOM uint32_t VCP_OTW_IS : 1;            /*!< [0..0] Charge Pump Overtemperature Warning Interrupt Status               */
      __IM  uint32_t            : 3;
      __IOM uint32_t VCP_OTSD_IS : 1;           /*!< [4..4] Charge Pump Overtemperature Shutdown Interrupt Status              */
      __IM  uint32_t            : 3;
      __IOM uint32_t VCP_LOTH2_IS : 1;          /*!< [8..8] Charge Pump Low Interrupt Status                                   */
      __IOM uint32_t VCP_LOTH1_IS : 1;          /*!< [9..9] Charge Pump MU Low Interrupt Status                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t VCP_UPTH_IS : 1;           /*!< [11..11] Charge Pump MU High Interrupt Status                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t VSD_LOTH_IS : 1;           /*!< [13..13] Driver Supply MU Low Interrupt Status                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t VSD_UPTH_IS : 1;           /*!< [15..15] Driver Supply MU High Interrupt Status                           */
      __IOM uint32_t VCP_OTW_STS : 1;           /*!< [16..16] Charge Pump Overtemperature Warning Status                       */
      __IM  uint32_t            : 3;
      __IOM uint32_t VCP_OTSD_STS : 1;          /*!< [20..20] Charge Pump Overtemperature Shutdown Status                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t VCP_LOTH2_STS : 1;         /*!< [24..24] Charge Pump Low Status                                           */
      __IOM uint32_t VCP_LOTH1_STS : 1;         /*!< [25..25] Charge Pump MU Low Status                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t VCP_UPTH_STS : 1;          /*!< [27..27] Charge Pump MU High Status                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t VSD_LOTH_STS : 1;          /*!< [29..29] Driver Supply MU Low Status                                      */
      __IM  uint32_t            : 1;
      __IOM uint32_t VSD_UPTH_STS : 1;          /*!< [31..31] Driver Supply MU High Status                                     */
    } bit;
  } CP_IRQS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000044) Charge Pump Interrupt Status Clear Register                */
    
    struct {
      __OM  uint32_t VCP_OTW_ISC : 1;           /*!< [0..0] Charge Pump Over-temperature Warning Interrupt Status
                                                     Clear                                                                     */
      __IM  uint32_t            : 3;
      __OM  uint32_t VCP_OTSD_ISC : 1;          /*!< [4..4] Charge Pump Over-temperature Shutdown Interrupt Status
                                                     Clear                                                                     */
      __IM  uint32_t            : 3;
      __OM  uint32_t VCP_LOTH2_ISC : 1;         /*!< [8..8] Charge Pump Low Interrupt Status Clear                             */
      __OM  uint32_t VCP_LOTH1_ISC : 1;         /*!< [9..9] Charge Pump MU Low Interrupt Status Clear                          */
      __IM  uint32_t            : 1;
      __OM  uint32_t VCP_UPTH_ISC : 1;          /*!< [11..11] Charge Pump MU High Interrupt Status Clear                       */
      __IM  uint32_t            : 1;
      __OM  uint32_t VSD_LOTH_ISC : 1;          /*!< [13..13] Driver Supply MU Low Interrupt Status Clear                      */
      __IM  uint32_t            : 1;
      __OM  uint32_t VSD_UPTH_ISC : 1;          /*!< [15..15] Driver Supply MU High Interrupt Status Clear                     */
      __OM  uint32_t VCP_OTW_SC : 1;            /*!< [16..16] Charge Pump Over-temperature Warning Status Clear                */
      __IM  uint32_t            : 3;
      __OM  uint32_t VCP_OTSD_SC : 1;           /*!< [20..20] Charge Pump Over-temperature Shutdown Status Clear               */
      __IM  uint32_t            : 3;
      __OM  uint32_t VCP_LOTH2_SC : 1;          /*!< [24..24] Charge Pump Low Status Clear                                     */
      __OM  uint32_t VCP_LOTH1_SC : 1;          /*!< [25..25] Charge Pump MU Low Status Clear                                  */
      __IM  uint32_t            : 1;
      __OM  uint32_t VCP_UPTH_SC : 1;           /*!< [27..27] Charge Pump MU High Status Clear                                 */
      __IM  uint32_t            : 1;
      __OM  uint32_t VSD_LOTH_SC : 1;           /*!< [29..29] Driver Supply MU Low Status Clear                                */
      __IM  uint32_t            : 1;
      __OM  uint32_t VSD_UPTH_SC : 1;           /*!< [31..31] Driver Supply MU High Status Clear                               */
    } bit;
  } CP_IRQCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000048) Charge Pump Interrupt Enable Register                      */
    
