Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t VCP_OTW_IEN : 1;           /*!< [0..0] Charge Pump Over-temperature Warning Interrupt Enable              */
      __IM  uint32_t            : 3;
      __IOM uint32_t VCP_OTSD_IEN : 1;          /*!< [4..4] Charge Pump Over-temperature Shutdown Interrupt Enable             */
      __IM  uint32_t            : 3;
      __IOM uint32_t VCP_LOTH2_IEN : 1;         /*!< [8..8] Charge Pump Low Interrupt Enable                                   */
      __IOM uint32_t VCP_LOTH1_IEN : 1;         /*!< [9..9] Charge Pump MU Low Interrupt Enable                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t VCP_UPTH_IEN : 1;          /*!< [11..11] Charge Pump MU High Interrupt Enable                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t VSD_LOTH_IEN : 1;          /*!< [13..13] Driver Supply MU Low Interrupt Enable                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t VSD_UPTH_IEN : 1;          /*!< [15..15] Driver Supply MU High Interrupt Enable                           */
    } bit;
  } CP_IRQEN;
  __IM  uint32_t  RESERVED4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Turn-off Slewrate Sequencer Half Bridge 1 Time
                                                                    Control                                                    */
    
    struct {
      __IOM uint32_t HB1_T1OFF  : 8;            /*!< [7..0] Half Bridge 1-slew rate sequencer off-phase 1 time setting         */
      __IOM uint32_t HB1_T2OFF  : 6;            /*!< [13..8] Half Bridge 1-slew rate sequencer off-phase 2 time setting        */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB1_T3OFF  : 6;            /*!< [21..16] Half Bridge 1-slew rate sequencer off-phase 3 time
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB1_T4OFF  : 8;            /*!< [31..24] Half Bridge 1-slew rate sequencer off-phase 4 time
                                                     setting                                                                   */
    } bit;
  } OFFSEQHB1TC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000054) Turn-off Slewrate Sequencer Half Bridge 1 Current
                                                                    Control                                                    */
    
    struct {
      __IOM uint32_t HB1_I1OFF  : 6;            /*!< [5..0] Half Bridge 1-slew rate sequencer off-phase 1 current
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB1_I2OFF  : 6;            /*!< [13..8] Half Bridge 1-slew rate sequencer-off phase 2 current
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB1_I3OFF  : 6;            /*!< [21..16] Half Bridge 1-slew rate sequencer off-phase 3 current
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB1_I4OFF  : 6;            /*!< [29..24] Half Bridge 1-slew rate sequencer off-phase 4 current
                                                     setting                                                                   */
    } bit;
  } OFFSEQHB1IC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000058) Turn-on Slewrate Sequencer Half Bridge 1 Time
                                                                    Control                                                    */
    
    struct {
      __IOM uint32_t HB1_T1ON   : 8;            /*!< [7..0] Half Bridge 1-slew rate sequencer on-phase 1 time setting          */
      __IOM uint32_t HB1_T2ON   : 6;            /*!< [13..8] Half Bridge 1-slew rate sequencer on-phase 2 time setting         */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB1_T3ON   : 6;            /*!< [21..16] Half Bridge 1-slew rate sequencer on-phase 3 time setting        */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB1_T4ON   : 8;            /*!< [31..24] Half Bridge 1-slew rate sequencer on-phase 4 time setting        */
    } bit;
  } ONSEQHB1TC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000005C) Turn-on Slewrate Sequencer Half Bridge 1 Current
                                                                    Control                                                    */
    
    struct {
      __IOM uint32_t HB1_I1ON   : 6;            /*!< [5..0] Half Bridge 1-slew rate sequencer on-phase 1 current
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB1_I2ON   : 6;            /*!< [13..8] Half Bridge 1-slew rate sequencer on-phase 2 current
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB1_I3ON   : 6;            /*!< [21..16] Half Bridge 1-slew rate sequencer on-phase 3 current
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB1_I4ON   : 6;            /*!< [29..24] Half Bridge 1-slew rate sequencer on-phase 4 current
                                                     setting                                                                   */
    } bit;
  } ONSEQHB1IC;
  __IM  uint32_t  RESERVED5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000064) Slewrate Sequencer-Active Freewheeling-Half Bridge
                                                                    1 Current Control                                          */
    
