Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t HB1AF_IOFF : 6;            /*!< [5..0] Half Bridge 1-active freewheeling-slew rate sequencer
                                                     off-phase current setting                                                 */
      __IM  uint32_t            : 10;
      __IOM uint32_t HB1AF_ION  : 6;            /*!< [21..16] Half Bridge 1-active freewheeling-slew rate sequencer
                                                     on-phase current setting                                                  */
    } bit;
  } SEQAFHB1IC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000068) Slewrate Sequencer-Active Freewheeling- Half
                                                                    Bridge 1 Clamping Current Delay                            */
    
    struct {
      __IOM uint32_t HB1AF_TDICLMPOFF : 8;      /*!< [7..0] Clamping current delay during active freewheeling for
                                                     switch off                                                                */
      __IOM uint32_t HB1AF_TDICLMPON : 8;       /*!< [15..8] Clamping current delay during active freewheeling for
                                                     switch on                                                                 */
    } bit;
  } SEQAFHB1CD;
  __IM  uint32_t  RESERVED6;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) Turn-off Slewrate Sequencer Half Bridge 2 Time
                                                                    Control                                                    */
    
    struct {
      __IOM uint32_t HB2_T1OFF  : 8;            /*!< [7..0] Half Bridge 2-slew rate sequencer off-phase 1 time setting         */
      __IOM uint32_t HB2_T2OFF  : 6;            /*!< [13..8] Half Bridge 2-slew rate sequencer off-phase 2 time setting        */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB2_T3OFF  : 6;            /*!< [21..16] Half Bridge 2-slew rate sequencer off-phase 3 time
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB2_T4OFF  : 8;            /*!< [31..24] Half Bridge 2-slew rate sequencer off-phase 4 time
                                                     setting                                                                   */
    } bit;
  } OFFSEQHB2TC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000074) Turn-off Slewrate Sequencer Half Bridge 2 Current
                                                                    Control                                                    */
    
    struct {
      __IOM uint32_t HB2_I1OFF  : 6;            /*!< [5..0] Half Bridge 2-slew rate sequencer off-phase 1 current
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB2_I2OFF  : 6;            /*!< [13..8] Half Bridge 2-slew rate sequencer off-phase 2 current
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB2_I3OFF  : 6;            /*!< [21..16] Half Bridge 2-slew rate sequencer off-phase 3 current
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB2_I4OFF  : 6;            /*!< [29..24] Half Bridge 2-slew rate sequencer off-phase 4 current
                                                     setting                                                                   */
    } bit;
  } OFFSEQHB2IC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000078) Turn-on Slewrate Sequencer Half Bridge 2 Time
                                                                    Control                                                    */
    
    struct {
      __IOM uint32_t HB2_T1ON   : 8;            /*!< [7..0] Half Bridge 2-slew rate sequencer on-phase 1 time setting          */
      __IOM uint32_t HB2_T2ON   : 6;            /*!< [13..8] Half Bridge 2-slew rate sequencer on-phase 2 time setting         */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB2_T3ON   : 6;            /*!< [21..16] Half Bridge 2-slew rate sequencer on-phase 3 time setting        */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB2_T4ON   : 8;            /*!< [31..24] Half Bridge 2-slew rate sequencer on-phase 4 time setting        */
    } bit;
  } ONSEQHB2TC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000007C) Turn-on Slewrate Sequencer Half Bridge 2 Current
                                                                    Control                                                    */
    
    struct {
      __IOM uint32_t HB2_I1ON   : 6;            /*!< [5..0] Half Bridge 2-slew rate sequencer on-phase 1 current
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB2_I2ON   : 6;            /*!< [13..8] Half Bridge 2-slew rate sequencer on-phase 2 current
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB2_I3ON   : 6;            /*!< [21..16] Half Bridge 2-slew rate sequencer on-phase 3 current
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB2_I4ON   : 6;            /*!< [29..24] Half Bridge 2-slew rate sequencer on-phase 4 current
                                                     setting                                                                   */
    } bit;
  } ONSEQHB2IC;
  __IM  uint32_t  RESERVED7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000084) Slewrate Sequencer-Active Freewheeling- Half
                                                                    Bridge 2 Current Control                                   */
    
