Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t HB2AF_IOFF : 6;            /*!< [5..0] Half Bridge 2-active freewheeling-slew rate sequencer
                                                     off-phase current setting                                                 */
      __IM  uint32_t            : 10;
      __IOM uint32_t HB2AF_ION  : 6;            /*!< [21..16] Half Bridge 2-active freewheeling-slew rate sequencer
                                                     on-phase current setting                                                  */
    } bit;
  } SEQAFHB2IC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000088) Slewrate Sequencer-Active Freewheeling- Half
                                                                    Bridge 2 Clamping Current Delay                            */
    
    struct {
      __IOM uint32_t HB2AF_TDICLMPOFF : 8;      /*!< [7..0] Clamping current delay during active freewheeling for
                                                     switch off                                                                */
      __IOM uint32_t HB2AF_TDICLMPON : 8;       /*!< [15..8] Clamping current delay during active freewheeling for
                                                     switch on                                                                 */
    } bit;
  } SEQAFHB2CD;
  __IM  uint32_t  RESERVED8;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) Adaptive Slewrate Sequencer Control Register               */
    
    struct {
      __IOM uint32_t HB1ASMONEN : 1;            /*!< [0..0] Half Bridge 1 Adaptive Sequencer Mode for Switch On Enable         */
      __IOM uint32_t HB1ASMOFFEN : 1;           /*!< [1..1] Half Bridge 1 Adaptive Sequencer Mode for Switch Off
                                                     Enable                                                                    */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB1OPTONACT : 1;           /*!< [4..4] Half Bridge 1 Optimizer for Switch On Active Bit                   */
      __IOM uint32_t HB1OPTOFFACT : 1;          /*!< [5..5] Half Bridge 1 Optimizer for Switch Off Active Bit                  */
      __IOM uint32_t HB1ONHYSTEN : 1;           /*!< [6..6] Half Bridge 1 Optimizer Hysteresis for Switch On Enable
                                                     Bit                                                                       */
      __IOM uint32_t HB1OFFHYSTEN : 1;          /*!< [7..7] Half Bridge 1 Optimizer Hysteresis for Switch Off Enable
                                                     Bit                                                                       */
      __IM  uint32_t            : 8;
      __IOM uint32_t HB2ASMONEN : 1;            /*!< [16..16] Half Bridge 2 Adaptive Sequencer Mode for Switch On
                                                     Enable                                                                    */
      __IOM uint32_t HB2ASMOFFEN : 1;           /*!< [17..17] Half Bridge 2 Adaptive Sequencer Mode for Switch Off
                                                     Enable                                                                    */
      __IM  uint32_t            : 2;
      __IOM uint32_t HB2OPTONACT : 1;           /*!< [20..20] Half Bridge 2 Optimizer for Switch On Active Bit                 */
      __IOM uint32_t HB2OPTOFFACT : 1;          /*!< [21..21] Half Bridge 2 Optimizer for Switch Off Active Bit                */
      __IOM uint32_t HB2ONHYSTEN : 1;           /*!< [22..22] Half Bridge 2 Optimizer Hysteresis for Switch On Enable
                                                     Bit                                                                       */
      __IOM uint32_t HB2OFFHYSTEN : 1;          /*!< [23..23] Half Bridge 2 Optimizer Hysteresis for Switch Off Enable
                                                     Bit                                                                       */
    } bit;
  } ASEQC;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000094) Adaptive Slewrate Sequencer Status Register                */
    
    struct {
      __IM  uint32_t HB1T1OFFMAX : 1;           /*!< [0..0] Half Bridge 1-T1 Off Max Value reached                             */
      __IM  uint32_t HB1I1OFFMAX : 1;           /*!< [1..1] Half Bridge 1-I1 Off Max Value reached                             */
      __IM  uint32_t HB1T1OFFMIN : 1;           /*!< [2..2] Half Bridge 1-T1 Off Min Value reached                             */
      __IM  uint32_t HB1I1OFFMIN : 1;           /*!< [3..3] Half Bridge 1-I1 Off Min Value reached                             */
      __IM  uint32_t HB1T12ONMAX : 1;           /*!< [4..4] Half Bridge 1-T12 On Max Value reached                             */
      __IM  uint32_t HB1I1ONMAX : 1;            /*!< [5..5] Half Bridge 1-I1 On Max Value reached                              */
      __IM  uint32_t HB1T12ONMIN : 1;           /*!< [6..6] Half Bridge 1-T12 On Min Value reached                             */
      __IM  uint32_t HB1I1ONMIN : 1;            /*!< [7..7] Half Bridge 1-I1 On Min Value reached                              */
      __IM  uint32_t            : 6;
      __IM  uint32_t HB1OFFMF   : 1;            /*!< [14..14] Half Bridge 1-Off Adaptive Mode Measurement Failure              */
      __IM  uint32_t HB1ONMF    : 1;            /*!< [15..15] Half Bridge 1-On Adaptive Mode Measurement Failure               */
      __IM  uint32_t HB2T1OFFMAX : 1;           /*!< [16..16] Half Bridge 2-T1 Off Max Value reached                           */
      __IM  uint32_t HB2I1OFFMAX : 1;           /*!< [17..17] Half Bridge 2-I1 Off Max Value reached                           */
      __IM  uint32_t HB2T1OFFMIN : 1;           /*!< [18..18] Half Bridge 2-T1 Off Min Value reached                           */
      __IM  uint32_t HB2I1OFFMIN : 1;           /*!< [19..19] Half Bridge 2-I1 Off Min Value reached                           */
      __IM  uint32_t HB2T12ONMAX : 1;           /*!< [20..20] Half Bridge 2-T12 On Max Value reached                           */
      __IM  uint32_t HB2I1ONMAX : 1;            /*!< [21..21] Half Bridge 2-I1 On Max Value reached                            */
      __IM  uint32_t HB2T12ONMIN : 1;           /*!< [22..22] Half Bridge 2-T12 On Min Value reached                           */
      __IM  uint32_t HB2I1ONMIN : 1;            /*!< [23..23] Half Bridge 2-I1 On Min Value reached                            */
      __IM  uint32_t            : 6;
      __IM  uint32_t HB2OFFMF   : 1;            /*!< [30..30] Half Bridge 2- Off Adaptive Mode Measurement Failure             */
      __IM  uint32_t HB2ONMF    : 1;            /*!< [31..31] Half Bridge 2- On Adaptive Mode Measurement Failure              */
    } bit;
  } ASEQSTS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000098) Turn ON Adaptive Slewrate Sequencer Minimum Time
                                                                    Setting                                                    */
    
