Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t T12ONMIN   : 8;            /*!< [7..0] Slew rate sequencer on-phase 12 min. time setting                  */
    } bit;
  } ONASEQTMIN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000009C) Turn OFF Adaptive Slewrate Sequencer Minimum
                                                                    Time Setting                                               */
    
    struct {
      __IOM uint32_t T1OFFMIN   : 8;            /*!< [7..0] Slew rate sequencer off-phase 1 min. time setting                  */
      __IOM uint32_t HB1T1OFFADDDLY : 4;        /*!< [11..8] HB1 adaptive sequencer T1OFF additional delay setting.            */
      __IOM uint32_t HB2T1OFFADDDLY : 4;        /*!< [15..12] HB2 adaptive sequencer T1OFF additional delay setting.           */
    } bit;
  } OFFASEQTMIN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) Adaptive Slewrate Sequencer On Phase Minimum
                                                                    Current Setting                                            */
    
    struct {
      __IOM uint32_t I1ONMIN    : 6;            /*!< [5..0] Slew rate sequencer on-phase 1 min. current setting                */
    } bit;
  } ASEQIONMIN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A4) Adaptive Slewrate Sequencer Off Phase Minimum
                                                                    Current Setting                                            */
    
    struct {
      __IOM uint32_t I1OFFMIN   : 6;            /*!< [5..0] Slew rate sequencer off-phase 1 min. current setting               */
    } bit;
  } ASEQIOFFMIN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A8) Adaptive Slewrate On Sequencer Maximum Time Setting        */
    
    struct {
      __IOM uint32_t T12ONMAX   : 8;            /*!< [7..0] Slew rate sequencer on-phase 12 max. time setting                  */
    } bit;
  } ONASEQTMAX;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000AC) Adaptive Slewrate Off Sequencer Maximum Time
                                                                    Setting                                                    */
    
    struct {
      __IOM uint32_t T1OFFMAX   : 8;            /*!< [7..0] Slew rate sequencer off-phase 1 max. time setting                  */
    } bit;
  } OFFASEQTMAX;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B0) Adaptive Slewrate Sequencer On Phase Maximum
                                                                    Current Setting                                            */
    
    struct {
      __IOM uint32_t I1ONMAX    : 6;            /*!< [5..0] Slew rate sequencer on-phase 1 max. current setting                */
    } bit;
  } ASEQIONMAX;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B4) Adaptive Slewrate Sequencer Off Phase Maximum
                                                                    Current Setting                                            */
    
    struct {
      __IOM uint32_t I1OFFMAX   : 6;            /*!< [5..0] Slew rate sequencer off-phase 1 max. current setting               */
    } bit;
  } ASEQIOFFMAX;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B8) Half Bridge 1 Adaptive Sequencer On Values                 */
    
    struct {
      __IM  uint32_t HB1_T12ONCNT : 8;          /*!< [7..0] Half Bridge 1-Turn on slew rate-time value measured from
                                                     beginning of phase 1 to end of phase 2.                                   */
      __IM  uint32_t HB1_I1ONVAL : 6;           /*!< [13..8] Half Bridge 1-slew rate sequencer on-phase 1 current
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IM  uint32_t HB1_T3ONCNT : 6;           /*!< [21..16] Half Bridge 1-Turn on slew rate-time value measured
                                                     from beginning of phase 3 to end of phase 3.                              */
      __IM  uint32_t HB1_T3MERR : 1;            /*!< [22..22] Half Bridge 1-T3 Measurement Error.                              */
      __IM  uint32_t            : 7;
      __IOM uint32_t HB1_ONVALVF : 1;           /*!< [30..30] Half Bridge 1-Turn on slew rate values - Valid Flag.             */
      __OM  uint32_t HB1_ONVALVF_CLR : 1;       /*!< [31..31] Half Bridge 1-Turn on slew rate values Valid Flag -
                                                     Clear.                                                                    */
    } bit;
  } HB1ASEQONVAL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000BC) Half Bridge 1 Adaptive Sequencer Off Values                */
    
    struct {
      __IM  uint32_t HB1_T1OFFCNT : 8;          /*!< [7..0] Half Bridge 1-Turn off slew rate-time value measured
                                                     from beginning of phase 1 to end of phase 1.                              */
      __IM  uint32_t HB1_I1OFFVAL : 6;          /*!< [13..8] Half Bridge 1-slew rate sequencer off-phase 1 current
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IM  uint32_t HB1_T2OFFCNT : 6;          /*!< [21..16] Half Bridge 1-Turn off slew rate-time value measured
                                                     from beginning of phase 2 to end of phase 2.                              */
      __IM  uint32_t HB1_T2MERR : 1;            /*!< [22..22] Half Bridge 1-T2 Measurement Error.                              */
      __IM  uint32_t            : 7;
      __IOM uint32_t HB1_OFFVALVF : 1;          /*!< [30..30] Half Bridge 1-Turn off slew rate values - Valid Flag.            */
      __OM  uint32_t HB1_OFFVALVF_CLR : 1;      /*!< [31..31] Half Bridge 1-Turn off slew rate values Valid Flag
                                                     - Clear.                                                                  */
    } bit;
  } HB1ASEQOFFVAL;
  __IM  uint32_t  RESERVED9[4];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D0) Half Bridge 2 Adaptive Sequencer On Values                 */
    
