Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IM  uint32_t HB2_T12ONCNT : 8;          /*!< [7..0] Half Bridge 2-Turn on slew rate-time value measured from
                                                     beginning of phase 1 to end of phase 2.                                   */
      __IM  uint32_t HB2_I1ONVAL : 6;           /*!< [13..8] Half Bridge 2-slew rate sequencer on-phase 1 current
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IM  uint32_t HB2_T3ONCNT : 6;           /*!< [21..16] Half Bridge 2-Turn on slew rate-time value measured
                                                     from beginning of phase 3 to end of phase 3.                              */
      __IM  uint32_t HB2_T3MERR : 1;            /*!< [22..22] Half Bridge 2-T3 Measurement Error.                              */
      __IM  uint32_t            : 7;
      __IOM uint32_t HB2_ONVALVF : 1;           /*!< [30..30] Half Bridge 2-Turn on slew rate values - Valid Flag.             */
      __OM  uint32_t HB2_ONVALVF_CLR : 1;       /*!< [31..31] Half Bridge 2-Turn on slew rate values Valid Flag -
                                                     Clear.                                                                    */
    } bit;
  } HB2ASEQONVAL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D4) Half Bridge 2 Adaptive Sequencer Off Values                */
    
    struct {
      __IM  uint32_t HB2_T1OFFCNT : 8;          /*!< [7..0] Half Bridge 2-Turn off slew rate-time value measured
                                                     from beginning of phase 1 to end of phase 1.                              */
      __IM  uint32_t HB2_I1OFFVAL : 6;          /*!< [13..8] Half Bridge 2-slew rate sequencer off-phase 1 current
                                                     setting                                                                   */
      __IM  uint32_t            : 2;
      __IM  uint32_t HB2_T2OFFCNT : 6;          /*!< [21..16] Half Bridge 2-Turn off slew rate-time value measured
                                                     from beginning of phase 2 to end of phase 2.                              */
      __IM  uint32_t HB2_T2MERR : 1;            /*!< [22..22] Half Bridge 2-T2 Measurement Error.                              */
      __IM  uint32_t            : 7;
      __IOM uint32_t HB2_OFFVALVF : 1;          /*!< [30..30] Half Bridge 2-Turn off slew rate values - Valid Flag.            */
      __OM  uint32_t HB2_OFFVALVF_CLR : 1;      /*!< [31..31] Half Bridge 2-Turn off slew rate values Valid Flag
                                                     - Clear.                                                                  */
    } bit;
  } HB2ASEQOFFVAL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D8) Adaptive Slewrate Sequencer Error Counter Control
                                                                    Register                                                   */
    
    struct {
      __IOM uint32_t HB1T1OFFERRCNT : 2;        /*!< [1..0] Half Bridge 1-T1 Off Error Counter Setting                         */
      __IOM uint32_t HB1T12ONERRCNT : 2;        /*!< [3..2] Half Bridge 1-T12 On Error Counter Setting                         */
      __IOM uint32_t HB1MFERRCNT : 2;           /*!< [5..4] Half Bridge 1-Measurement Failure Error Counter Setting            */
      __IM  uint32_t            : 10;
      __IOM uint32_t HB2T1OFFERRCNT : 2;        /*!< [17..16] Half Bridge 2-T1 Off Error Counter Setting                       */
      __IOM uint32_t HB2T12ONERRCNT : 2;        /*!< [19..18] Half Bridge 2-T12 On Error Counter Setting                       */
      __IOM uint32_t HB2MFERRCNT : 2;           /*!< [21..20] Half Bridge 2-Measurement Failure Error Counter Setting          */
    } bit;
  } ASEQERRCNT;
  __IM  uint32_t  RESERVED10;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E0) Current Trimming of Driver                                 */
    
    struct {
      __IM  uint32_t            : 8;
      __IOM uint32_t COMPENS_HS : 3;            /*!< [10..8] Current Settings for High Side Charge Current Compensation        */
      __IM  uint32_t            : 5;
      __IOM uint32_t COMPENS_LS : 3;            /*!< [18..16] Gain Settings for Low Side Charge Current Compensation           */
    } bit;
  } DCTRIM_DRVx;
  __IM  uint32_t  RESERVED11[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F0) H-Bridge Driver Interrupt Status                           */
    
    struct {
      __IOM uint32_t HB1_ASEQ_IS : 1;           /*!< [0..0] Half Bridge 1 Adaptive Sequencer Interrupt Status                  */
      __IOM uint32_t HB2_ASEQ_IS : 1;           /*!< [1..1] Half Bridge 2 Adaptive Sequencer Interrupt Status                  */
      __IM  uint32_t            : 2;
      __IOM uint32_t LS1_DS_IS  : 1;            /*!< [4..4] Low Side Driver 1 Drain Source Monitoring Interrupt Status
                                                     in OFF-State                                                              */
      __IOM uint32_t LS1_DS_STS : 1;            /*!< [5..5] Low Side Driver 1 Drain Source Monitoring Status in OFF-State      */
      __IOM uint32_t LS1_OC_IS  : 1;            /*!< [6..6] External Low Side 1 FET Over-current Interrupt Status              */
      __IM  uint32_t            : 5;
      __IOM uint32_t LS2_DS_IS  : 1;            /*!< [12..12] Low Side Driver 2 Drain Source Monitoring Interrupt
                                                     Status in OFF-State                                                       */
      __IOM uint32_t LS2_DS_STS : 1;            /*!< [13..13] Low Side Driver 2 Drain Source Monitoring Status in
                                                     OFF-State                                                                 */
      __IOM uint32_t LS2_OC_IS  : 1;            /*!< [14..14] External Low Side 2 FET Over-current Interrupt Status            */
      __IM  uint32_t            : 5;
      __IOM uint32_t HS1_DS_IS  : 1;            /*!< [20..20] High Side Driver 1 Drain Source Monitoring Interrupt
                                                     Status in OFF-State                                                       */
      __IOM uint32_t HS1_DS_STS : 1;            /*!< [21..21] High Side Driver 1 Drain Source Monitoring Status in
                                                     OFF-State                                                                 */
      __IOM uint32_t HS1_OC_IS  : 1;            /*!< [22..22] External High Side 1 FET Over-current Interrupt Status           */
      __IM  uint32_t            : 5;
      __IOM uint32_t HS2_DS_IS  : 1;            /*!< [28..28] High Side Driver 2 Drain Source Monitoring Interrupt
                                                     Status in OFF-State                                                       */
      __IOM uint32_t HS2_DS_STS : 1;            /*!< [29..29] High Side Driver 2 Drain Source Monitoring Status in
                                                     OFF-State                                                                 */
      __IOM uint32_t HS2_OC_IS  : 1;            /*!< [30..30] External High Side 2 FET Over-current Interrupt Status           */
      __IOM uint32_t SEQ_ERR_IS : 1;            /*!< [31..31] Driver Sequence Error Interrupt Status                           */
    } bit;
  } IRQS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F4) H-Bridge Driver Interrupt Status Clear Register            */
    
