Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __OM  uint32_t HB1_ASEQ_ISC : 1;          /*!< [0..0] Half Bridge 1 Adaptive Sequencer Interrupt Status Clear            */
      __OM  uint32_t HB2_ASEQ_ISC : 1;          /*!< [1..1] Half Bridge 2 Adaptive Sequencer Interrupt Status Clear            */
      __IM  uint32_t            : 2;
      __OM  uint32_t LS1_DS_ISC : 1;            /*!< [4..4] Low Side Driver 1 Drain Source Monitoring Interrupt Status
                                                     Clear in OFF-State                                                        */
      __OM  uint32_t LS1_DS_SC  : 1;            /*!< [5..5] Low Side Driver 1 Drain Source Monitoring Status Clear
                                                     in OFF-State                                                              */
      __OM  uint32_t LS1_OC_ISC : 1;            /*!< [6..6] External Low Side 1 FET Over-current Status Clear                  */
      __IM  uint32_t            : 5;
      __OM  uint32_t LS2_DS_ISC : 1;            /*!< [12..12] Low Side Driver 2 Drain Source Monitoring Interrupt
                                                     Status Clear in OFF-State                                                 */
      __OM  uint32_t LS2_DS_SC  : 1;            /*!< [13..13] Low Side Driver 2 Drain Source Monitoring Status Clear
                                                     in OFF-State                                                              */
      __OM  uint32_t LS2_OC_ISC : 1;            /*!< [14..14] External Low Side 2 FET Over-current Status Clear                */
      __IM  uint32_t            : 5;
      __OM  uint32_t HS1_DS_ISC : 1;            /*!< [20..20] High Side Driver 1 Drain Source Monitoring Interrupt
                                                     Status Clear in OFF-State                                                 */
      __OM  uint32_t HS1_DS_SC  : 1;            /*!< [21..21] High Side Driver 1 Drain Source Monitoring Status Clear
                                                     in OFF-State                                                              */
      __OM  uint32_t HS1_OC_ISC : 1;            /*!< [22..22] External High Side 1 FET Over-current Status Clear               */
      __IM  uint32_t            : 5;
      __OM  uint32_t HS2_DS_ISC : 1;            /*!< [28..28] High Side Driver 2 Drain Source Monitoring Interrupt
                                                     Status Clear in OFF-State                                                 */
      __OM  uint32_t HS2_DS_SC  : 1;            /*!< [29..29] High Side Driver 2 Drain Source Monitoring Status Clear
                                                     in OFF-State                                                              */
      __OM  uint32_t HS2_OC_ISC : 1;            /*!< [30..30] External High Side 2 FET Over-current Status Clear               */
      __OM  uint32_t SEQ_ERR_ISC : 1;           /*!< [31..31] Driver Sequence Error Status Clear                               */
    } bit;
  } IRQCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F8) H-Bridge Driver Control                                    */
    
    struct {
      __IOM uint32_t HB1_ASEQ_IEN : 1;          /*!< [0..0] Half Bridge 1 Adaptive Sequencer Interrupt Enable                  */
      __IOM uint32_t HB2_ASEQ_IEN : 1;          /*!< [1..1] Half Bridge 2 Adaptive Sequencer Interrupt Enable                  */
      __IM  uint32_t            : 2;
      __IOM uint32_t LS1_DS_IEN : 1;            /*!< [4..4] Low Side Driver 1 Drain Source Monitoring Interrupt Enable
                                                     in OFF-State                                                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t LS1_OC_IEN : 1;            /*!< [6..6] External Low Side 1 FET Over-current Interrupt Enable              */
      __IM  uint32_t            : 5;
      __IOM uint32_t LS2_DS_IEN : 1;            /*!< [12..12] Low Side Driver 2 Drain Source Monitoring Interrupt
                                                     Enable in OFF-State                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t LS2_OC_IEN : 1;            /*!< [14..14] External Low Side 2 FET Over-current Interrupt Enable            */
      __IM  uint32_t            : 5;
      __IOM uint32_t HS1_DS_IEN : 1;            /*!< [20..20] High Side Driver 1 Drain Source Monitoring Interrupt
                                                     Enable in OFF-State                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t HS1_OC_IEN : 1;            /*!< [22..22] External High Side 1 FET Over-current Interrupt Enable           */
      __IM  uint32_t            : 5;
      __IOM uint32_t HS2_DS_IEN : 1;            /*!< [28..28] High Side Driver 2 Drain Source Monitoring Interrupt
                                                     Enable in OFF-State                                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t HS2_OC_IEN : 1;            /*!< [30..30] External High Side 2 FET Over-current Interrupt Enable           */
      __IOM uint32_t SEQ_ERR_IEN : 1;           /*!< [31..31] Driver Sequence Error Interrupt Enable                           */
    } bit;
  } IRQEN;
} BDRV_Type;                                    /*!< Size = 252 (0xfc)                                                         */



/* =========================================================================================================================== */
/* ================                                           CCU6                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief CCU6 (CCU6)
  */

typedef struct {                                /*!< (@ 0x4000C000) CCU6 Structure                                             */
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000000) Capture/Compare Register for Channel CC63                  */
    
