Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IM  uint16_t CCV        : 16;           /*!< [15..0] Channel CC63 Compare Value Low Byte                               */
    } bit;
  } CC63R;
  __IM  uint16_t  RESERVED;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000004) Timer Control Register 4                                   */
    
    struct {
      __OM  uint16_t T12RR      : 1;            /*!< [0..0] Timer T12 Run Reset                                                */
      __OM  uint16_t T12RS      : 1;            /*!< [1..1] Timer T12 Run Set                                                  */
      __OM  uint16_t T12RES     : 1;            /*!< [2..2] Timer T12 Reset                                                    */
      __OM  uint16_t DTRES      : 1;            /*!< [3..3] Dead-Time Counter Reset                                            */
      __IM  uint16_t            : 1;
      __OM  uint16_t T12CNT     : 1;            /*!< [5..5] Timer T12 Count Event                                              */
      __OM  uint16_t T12STR     : 1;            /*!< [6..6] Timer T12 Shadow Transfer Request                                  */
      __OM  uint16_t T12STD     : 1;            /*!< [7..7] Timer T12 Shadow Transfer Disable                                  */
      __OM  uint16_t T13RR      : 1;            /*!< [8..8] Timer T13 Run Reset                                                */
      __OM  uint16_t T13RS      : 1;            /*!< [9..9] Timer T13 Run Set                                                  */
      __OM  uint16_t T13RES     : 1;            /*!< [10..10] Timer T13 Reset                                                  */
      __IM  uint16_t            : 2;
      __OM  uint16_t T13CNT     : 1;            /*!< [13..13] Timer T13 Count Event                                            */
      __OM  uint16_t T13STR     : 1;            /*!< [14..14] Timer T13 Shadow Transfer Request                                */
      __OM  uint16_t T13STD     : 1;            /*!< [15..15] Timer T13 Shadow Transfer Disable                                */
    } bit;
  } TCTR4;
  __IM  uint16_t  RESERVED1;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000008) Multi-Channel Mode Output Shadow Register                  */
    
    struct {
      __IOM uint16_t MCMPS      : 6;            /*!< [5..0] Multi-Channel PWM Pattern Shadow                                   */
      __IM  uint16_t            : 1;
      __OM  uint16_t STRMCM     : 1;            /*!< [7..7] Shadow Transfer Request for MCMPS                                  */
      __IOM uint16_t EXPHS      : 3;            /*!< [10..8] Expected Hall Pattern Shadow                                      */
      __IOM uint16_t CURHS      : 3;            /*!< [13..11] Current Hall Pattern Shadow                                      */
      __IM  uint16_t            : 1;
      __OM  uint16_t STRHP      : 1;            /*!< [15..15] Shadow Transfer Request for the Hall Pattern                     */
    } bit;
  } MCMOUTS;
  __IM  uint16_t  RESERVED2;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000000C) Capture/Compare Interrupt Status Reset Register            */
    
    struct {
      __OM  uint16_t RCC60R     : 1;            /*!< [0..0] Reset Capture, Compare-Match Rising Edge Flag                      */
      __OM  uint16_t RCC60F     : 1;            /*!< [1..1] Reset Capture, Compare-Match Falling Edge Flag                     */
      __OM  uint16_t RCC61R     : 1;            /*!< [2..2] Reset Capture, Compare-Match Rising Edge Flag                      */
      __OM  uint16_t RCC61F     : 1;            /*!< [3..3] Reset Capture, Compare-Match Falling Edge Flag                     */
      __OM  uint16_t RCC62R     : 1;            /*!< [4..4] Reset Capture, Compare-Match Rising Edge Flag                      */
      __OM  uint16_t RCC62F     : 1;            /*!< [5..5] Reset Capture, Compare-Match Falling Edge Flag                     */
      __OM  uint16_t RT12OM     : 1;            /*!< [6..6] Reset Timer T12 One-Match Flag                                     */
      __OM  uint16_t RT12PM     : 1;            /*!< [7..7] Reset Timer T12 Period-Match Flag                                  */
      __OM  uint16_t RT13CM     : 1;            /*!< [8..8] Reset Timer T13 Compare-Match Flag                                 */
      __OM  uint16_t RT13PM     : 1;            /*!< [9..9] Reset Timer T13 Period-Match Flag                                  */
      __OM  uint16_t RTRPF      : 1;            /*!< [10..10] Reset Trap Flag                                                  */
      __IM  uint16_t            : 1;
      __OM  uint16_t RCHE       : 1;            /*!< [12..12] Reset Correct Hall Event Flag                                    */
      __OM  uint16_t RWHE       : 1;            /*!< [13..13] Reset Wrong Hall Event Flag                                      */
      __OM  uint16_t RIDLE      : 1;            /*!< [14..14] Reset IDLE Flag                                                  */
      __OM  uint16_t RSTR       : 1;            /*!< [15..15] Reset STR Flag                                                   */
    } bit;
  } ISR;
  __IM  uint16_t  RESERVED3;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000010) Compare State Modification Register                        */
    
    struct {
      __OM  uint16_t MCC60S     : 1;            /*!< [0..0] Capture/Compare Status Modification Bit 0 (Set)                    */
      __OM  uint16_t MCC61S     : 1;            /*!< [1..1] Capture/Compare Status Modification Bit 1 (Set)                    */
      __OM  uint16_t MCC62S     : 1;            /*!< [2..2] Capture/Compare Status Modification Bit 2 (Set)                    */
      __IM  uint16_t            : 3;
      __OM  uint16_t MCC63S     : 1;            /*!< [6..6] Capture/Compare Status Modification Bits (Set)                     */
      __IM  uint16_t            : 1;
      __OM  uint16_t MCC60R     : 1;            /*!< [8..8] Capture/Compare Status Modification Bit 0(Reset)                   */
      __OM  uint16_t MCC61R     : 1;            /*!< [9..9] Capture/Compare Status Modification Bit 1(Reset)                   */
      __OM  uint16_t MCC62R     : 1;            /*!< [10..10] Capture/Compare Status Modification Bit 2(Reset)                 */
      __IM  uint16_t            : 3;
      __OM  uint16_t MCC63R     : 1;            /*!< [14..14] Capture/Compare Status Modification Bits (Reset)                 */
    } bit;
  } CMPMODIF;
  __IM  uint16_t  RESERVED4;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000014) Capture/Compare Shadow Register for Channel CC60           */
    
