Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint16_t CCS        : 16;           /*!< [15..0] Shadow Register for Channel 0 Capture/Compare Value               */
    } bit;
  } CC60SR;
  __IM  uint16_t  RESERVED5;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000018) Capture/Compare Shadow Register for Channel CC61           */
    
    struct {
      __IOM uint16_t CCS        : 16;           /*!< [15..0] Shadow Register for Channel 1 Capture/Compare Value               */
    } bit;
  } CC61SR;
  __IM  uint16_t  RESERVED6;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000001C) Capture/Compare Shadow Register for Channel CC62           */
    
    struct {
      __IOM uint16_t CCS        : 16;           /*!< [15..0] Shadow Register for Channel 2 Capture/Compare Value               */
    } bit;
  } CC62SR;
  __IM  uint16_t  RESERVED7;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000020) Capture/Compare Shadow Register for Channel CC63           */
    
    struct {
      __IOM uint16_t CCS        : 16;           /*!< [15..0] Shadow Register for Channel CC63 Compare Value                    */
    } bit;
  } CC63SR;
  __IM  uint16_t  RESERVED8;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000024) Timer T12 Period Register                                  */
    
    struct {
      __IOM uint16_t T12PV      : 16;           /*!< [15..0] T12 Period Value                                                  */
    } bit;
  } T12PR;
  __IM  uint16_t  RESERVED9;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000028) Timer T13 Period Register                                  */
    
    struct {
      __IOM uint16_t T13PV      : 16;           /*!< [15..0] T13 Period Value                                                  */
    } bit;
  } T13PR;
  __IM  uint16_t  RESERVED10;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000002C) Dead-Time Control Register for Timer T12 Low               */
    
    struct {
      __IOM uint16_t DTM        : 8;            /*!< [7..0] Dead-Time                                                          */
      __IOM uint16_t DTE0       : 1;            /*!< [8..8] Dead-Time Enable Bit 0                                             */
      __IOM uint16_t DTE1       : 1;            /*!< [9..9] Dead-Time Enable Bit 1                                             */
      __IOM uint16_t DTE2       : 1;            /*!< [10..10] Dead-Time Enable Bit 2                                           */
      __IM  uint16_t            : 1;
      __IM  uint16_t DTR0       : 1;            /*!< [12..12] Dead-Time Run Indication Bit 0                                   */
      __IM  uint16_t DTR1       : 1;            /*!< [13..13] Dead-Time Run Indication Bit 1                                   */
      __IM  uint16_t DTR2       : 1;            /*!< [14..14] Dead-Time Run Indication Bit 2                                   */
    } bit;
  } T12DTC;
  __IM  uint16_t  RESERVED11;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000030) Timer Control Register 0                                   */
    
    struct {
      __IOM uint16_t T12CLK     : 3;            /*!< [2..0] Timer T12 Input Clock Select                                       */
      __IOM uint16_t T12PRE     : 1;            /*!< [3..3] Timer T12 Prescaler Bit                                            */
      __IM  uint16_t T12R       : 1;            /*!< [4..4] Timer T12 Run Bit                                                  */
      __IM  uint16_t STE12      : 1;            /*!< [5..5] Timer T12 Shadow Transfer Enable                                   */
      __IM  uint16_t CDIR       : 1;            /*!< [6..6] Count Direction of Timer T12                                       */
      __IOM uint16_t CTM        : 1;            /*!< [7..7] T12 Operating Mode                                                 */
      __IOM uint16_t T13CLK     : 3;            /*!< [10..8] Timer T13 Input Clock Select                                      */
      __IOM uint16_t T13PRE     : 1;            /*!< [11..11] Timer T13 Prescaler Bit                                          */
      __IM  uint16_t T13R       : 1;            /*!< [12..12] Timer T13 Run Bit                                                */
      __IM  uint16_t STE13      : 1;            /*!< [13..13] Timer T13 Shadow Transfer Enable                                 */
    } bit;
  } TCTR0;
  __IM  uint16_t  RESERVED12;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000034) Capture/Compare Register for Channel CC60                  */
    
    struct {
      __IM  uint16_t CCV        : 16;           /*!< [15..0] Channel 0 Capture/Compare Value                                   */
    } bit;
  } CC60R;
  __IM  uint16_t  RESERVED13;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000038) Capture/Compare Register for Channel CC61                  */
    
    struct {
      __IM  uint16_t CCV        : 16;           /*!< [15..0] Channel 1 Capture/Compare Value                                   */
    } bit;
  } CC61R;
  __IM  uint16_t  RESERVED14;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000003C) Capture/Compare Register for Channel CC62                  */
    
    struct {
      __IM  uint16_t CCV        : 16;           /*!< [15..0] Channel 2 Capture/Compare Value                                   */
    } bit;
  } CC62R;
  __IM  uint16_t  RESERVED15;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000040) T12 Capture/Compare Mode Select Register                   */
    
    struct {
      __IOM uint16_t MSEL60     : 4;            /*!< [3..0] Capture/Compare Mode Selection                                     */
      __IOM uint16_t MSEL61     : 4;            /*!< [7..4] Capture/Compare Mode Selection                                     */
      __IOM uint16_t MSEL62     : 4;            /*!< [11..8] Capture/Compare Mode Selection                                    */
      __IOM uint16_t HSYNC      : 3;            /*!< [14..12] Hall Synchronization                                             */
      __IOM uint16_t DBYP       : 1;            /*!< [15..15] Delay Bypass                                                     */
    } bit;
  } T12MSEL;
  __IM  uint16_t  RESERVED16;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000044) Capture/Compare Interrupt Enable Register                  */
    
