Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint16_t PSL        : 6;            /*!< [5..0] Compare Outputs Passive State Level                                */
      __IM  uint16_t            : 1;
      __IOM uint16_t PSL63      : 1;            /*!< [7..7] Passive State Level of Output COUT63                               */
    } bit;
  } PSLR;
  __IM  uint16_t  RESERVED20;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000054) Multi-Channel Mode Control Register                        */
    
    struct {
      __IOM uint16_t SWSEL      : 3;            /*!< [2..0] Switching Selection                                                */
      __IM  uint16_t            : 1;
      __IOM uint16_t SWSYN      : 2;            /*!< [5..4] Switching Synchronization                                          */
      __IM  uint16_t            : 2;
      __IOM uint16_t STE12U     : 1;            /*!< [8..8] Shadow Transfer Enable for T12 Upcounting                          */
      __IOM uint16_t STE12D     : 1;            /*!< [9..9] Shadow Transfer Enable for T12 Downcounting                        */
      __IOM uint16_t STE13U     : 1;            /*!< [10..10] Shadow Transfer Enable for T13 Upcounting                        */
    } bit;
  } MCMCTR;
  __IM  uint16_t  RESERVED21;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000058) Timer Control Register 2                                   */
    
    struct {
      __IOM uint16_t T12SSC     : 1;            /*!< [0..0] Timer T12 Single Shot Control                                      */
      __IOM uint16_t T13SSC     : 1;            /*!< [1..1] Timer T13 Single Shot Control                                      */
      __IOM uint16_t T13TEC     : 3;            /*!< [4..2] T13 Trigger Event Control                                          */
      __IOM uint16_t T13TED     : 2;            /*!< [6..5] Timer T13 Trigger Event Direction                                  */
      __IM  uint16_t            : 1;
      __IOM uint16_t T12RSEL    : 2;            /*!< [9..8] Timer T12 External Run Selection                                   */
      __IOM uint16_t T13RSEL    : 2;            /*!< [11..10] Timer T13 External Run Selection                                 */
    } bit;
  } TCTR2;
  __IM  uint16_t  RESERVED22;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000005C) Modulation Control Register                                */
    
    struct {
      __IOM uint16_t T12MODEN   : 6;            /*!< [5..0] T12 Modulation Enable                                              */
      __IM  uint16_t            : 1;
      __IOM uint16_t MCMEN      : 1;            /*!< [7..7] Multi-Channel Mode Enable                                          */
      __IOM uint16_t T13MODEN   : 6;            /*!< [13..8] T13 Modulation Enable                                             */
      __IM  uint16_t            : 1;
      __IOM uint16_t ECT13O     : 1;            /*!< [15..15] Enable Compare Timer T13 Output                                  */
    } bit;
  } MODCTR;
  __IM  uint16_t  RESERVED23;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000060) Trap Control Register                                      */
    
    struct {
      __IOM uint16_t TRPM10     : 2;            /*!< [1..0] Trap Mode Control Bits 1, 0                                        */
      __IOM uint16_t TRPM2      : 1;            /*!< [2..2] Trap Mode Control Bit 2                                            */
      __IM  uint16_t            : 5;
      __IOM uint16_t TRPEN      : 6;            /*!< [13..8] Trap Enable Control                                               */
      __IOM uint16_t TRPEN13    : 1;            /*!< [14..14] Trap Enable Control for Timer T13                                */
      __IOM uint16_t TRPPEN     : 1;            /*!< [15..15] Trap Pin Enable                                                  */
    } bit;
  } TRPCTR;
  __IM  uint16_t  RESERVED24;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000064) Multi-Channel Mode Output Register                         */
    
    struct {
      __IM  uint16_t MCMP       : 6;            /*!< [5..0] Multi-Channel PWM Pattern                                          */
      __IM  uint16_t R          : 1;            /*!< [6..6] Reminder Flag                                                      */
      __IM  uint16_t            : 1;
      __IM  uint16_t EXPH       : 3;            /*!< [10..8] Expected Hall Pattern                                             */
      __IM  uint16_t CURH       : 3;            /*!< [13..11] Current Hall Pattern                                             */
    } bit;
  } MCMOUT;
  __IM  uint16_t  RESERVED25;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000068) Capture/Compare Interrupt Status Register                  */
    
    struct {
      __IM  uint16_t ICC60R     : 1;            /*!< [0..0] Capture, Compare-Match Rising Edge Flag                            */
      __IM  uint16_t ICC60F     : 1;            /*!< [1..1] Capture, Compare-Match Falling Edge Flag                           */
      __IM  uint16_t ICC61R     : 1;            /*!< [2..2] Capture, Compare-Match Rising Edge Flag                            */
      __IM  uint16_t ICC61F     : 1;            /*!< [3..3] Capture, Compare-Match Falling Edge Flag                           */
      __IM  uint16_t ICC62R     : 1;            /*!< [4..4] Capture, Compare-Match Rising Edge Flag                            */
      __IM  uint16_t ICC62F     : 1;            /*!< [5..5] Capture, Compare-Match Falling Edge Flag                           */
      __IM  uint16_t T12OM      : 1;            /*!< [6..6] Timer T12 One-Match Flag                                           */
      __IM  uint16_t T12PM      : 1;            /*!< [7..7] Timer T12 Period-Match Flag                                        */
      __IM  uint16_t T13CM      : 1;            /*!< [8..8] Timer T13 Compare-Match Flag                                       */
      __IM  uint16_t T13PM      : 1;            /*!< [9..9] Timer T13 Period-Match Flag                                        */
      __IM  uint16_t TRPF       : 1;            /*!< [10..10] Trap Flag                                                        */
      __IM  uint16_t TRPS       : 1;            /*!< [11..11] Trap State                                                       */
      __IM  uint16_t CHE        : 1;            /*!< [12..12] Correct Hall Event                                               */
      __IM  uint16_t WHE        : 1;            /*!< [13..13] Wrong Hall Event                                                 */
      __IM  uint16_t IDLE       : 1;            /*!< [14..14] IDLE State                                                       */
      __IM  uint16_t STR        : 1;            /*!< [15..15] Multi-Channel Mode Shadow Transfer Request                       */
    } bit;
  } IS;
  __IM  uint16_t  RESERVED26;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000006C) Port Input Select Register 0                               */
    
