Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint16_t ISCC60     : 2;            /*!< [1..0] Input Select for CC60                                              */
      __IOM uint16_t ISCC61     : 2;            /*!< [3..2] Input Select for CC61                                              */
      __IOM uint16_t ISCC62     : 2;            /*!< [5..4] Input Select for CC62                                              */
      __IOM uint16_t ISTRP      : 2;            /*!< [7..6] Input Select for CTRAP                                             */
      __IOM uint16_t ISPOS0     : 2;            /*!< [9..8] Input Select for CCPOS0                                            */
      __IOM uint16_t ISPOS1     : 2;            /*!< [11..10] Input Select for CCPOS1                                          */
      __IOM uint16_t ISPOS2     : 2;            /*!< [13..12] Input Select for CCPOS2                                          */
      __IOM uint16_t IST12HR    : 2;            /*!< [15..14] Input Select for T12HR                                           */
    } bit;
  } PISEL0;
  __IM  uint16_t  RESERVED27[3];
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000074) Port Input Select Register 2                               */
    
    struct {
      __IOM uint16_t IST13HR    : 2;            /*!< [1..0] Input Select for T13HR                                             */
      __IOM uint16_t ISCNT12    : 2;            /*!< [3..2] Input Select for T12 Counting Input                                */
      __IOM uint16_t ISCNT13    : 2;            /*!< [5..4] Input Select for T13 Counting Input                                */
      __IOM uint16_t T12EXT     : 1;            /*!< [6..6] Extension for T12HR Inputs                                         */
      __IOM uint16_t T13EXT     : 1;            /*!< [7..7] Extension for T13HR Inputs                                         */
    } bit;
  } PISEL2;
  __IM  uint16_t  RESERVED28;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000078) Timer T12 Counter Register                                 */
    
    struct {
      __IOM uint16_t T12CV      : 16;           /*!< [15..0] Timer T12 Counter Value                                           */
    } bit;
  } T12;
  __IM  uint16_t  RESERVED29;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x0000007C) Timer T13 Counter Register                                 */
    
    struct {
      __IOM uint16_t T13CV      : 16;           /*!< [15..0] Timer T13 Counter Value                                           */
    } bit;
  } T13;
  __IM  uint16_t  RESERVED30;
  
  union {
    __IOM uint16_t reg;                         /*!< (@ 0x00000080) Compare State Register                                     */
    
    struct {
      __IM  uint16_t CC60ST     : 1;            /*!< [0..0] Capture/Compare State Bits                                         */
      __IM  uint16_t CC61ST     : 1;            /*!< [1..1] Capture/Compare State Bits                                         */
      __IM  uint16_t CC62ST     : 1;            /*!< [2..2] Capture/Compare State Bits                                         */
      __IM  uint16_t CCPOS0     : 1;            /*!< [3..3] Sampled Hall Pattern Bit 0                                         */
      __IM  uint16_t CCPOS1     : 1;            /*!< [4..4] Sampled Hall Pattern Bit 1                                         */
      __IM  uint16_t CCPOS2     : 1;            /*!< [5..5] Sampled Hall Pattern Bit 2                                         */
      __IM  uint16_t CC63ST     : 1;            /*!< [6..6] Capture/Compare State Bits                                         */
      __IM  uint16_t            : 1;
      __IOM uint16_t CC60PS     : 1;            /*!< [8..8] Passive State Select for Compare Outputs                           */
      __IOM uint16_t COUT60PS   : 1;            /*!< [9..9] Passive State Select for Compare Outputs                           */
      __IOM uint16_t CC61PS     : 1;            /*!< [10..10] Passive State Select for Compare Outputs                         */
      __IOM uint16_t COUT61PS   : 1;            /*!< [11..11] Passive State Select for Compare Outputs                         */
      __IOM uint16_t CC62PS     : 1;            /*!< [12..12] Passive State Select for Compare Outputs                         */
      __IOM uint16_t COUT62PS   : 1;            /*!< [13..13] Passive State Select for Compare Outputs                         */
      __IOM uint16_t COUT63PS   : 1;            /*!< [14..14] Passive State Select for Compare Outputs                         */
      __IOM uint16_t T13IM      : 1;            /*!< [15..15] T13 Inverted Modulation                                          */
    } bit;
  } CMPSTAT;
} CCU6_Type;                                    /*!< Size = 130 (0x82)                                                         */



/* =========================================================================================================================== */
/* ================                                            CPU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief CPU (CPU)
  */

typedef struct {                                /*!< (@ 0xE000E000) CPU Structure                                              */
  __IM  uint32_t  RESERVED[4];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) SysTick Control and Status Register                        */
    
    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< [0..0] Enable                                                             */
      __IOM uint32_t TICKINT    : 1;            /*!< [1..1] TICKINT                                                            */
      __IOM uint32_t CLKSOURCE  : 1;            /*!< [2..2] CLK Source                                                         */
      __IM  uint32_t            : 13;
      __IM  uint32_t COUNTFLAG  : 1;            /*!< [16..16] Count Flag                                                       */
    } bit;
  } SYSTICK_CSR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) SysTick Reload Value Register                              */
    
