Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_GPT1   : 2;            /*!< [7..6] Priority for GPT1                                                  */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_GPT2   : 2;            /*!< [15..14] Priority for GPT2                                                */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_ADC2   : 2;            /*!< [23..22] Priority for MU, ADC2                                            */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_ADC1   : 2;            /*!< [31..30] Priority for ADC1                                                */
    } bit;
  } NVIC_IPR0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000404) Interrupt Priority                                         */
    
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_CCU6SR0 : 2;           /*!< [7..6] Priority for CCU6 SR0                                              */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_CCU6SR1 : 2;           /*!< [15..14] Priority for CCU6 SR1                                            */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_CCU6SR2 : 2;           /*!< [23..22] Priority for CCU6 SR2                                            */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_CCU6SR3 : 2;           /*!< [31..30] Priority for CCU6 SR3                                            */
    } bit;
  } NVIC_IPR1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000408) Interrupt Priority                                         */
    
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_SSC1   : 2;            /*!< [7..6] Priority for SSC1                                                  */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_SSC2   : 2;            /*!< [15..14] Priority for SSC2                                                */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_UART1  : 2;            /*!< [23..22] Priority for UART1                                               */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_UART2  : 2;            /*!< [31..30] Priority for UART2                                               */
    } bit;
  } NVIC_IPR2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000040C) Interrupt Priority                                         */
    
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_EXINT0 : 2;            /*!< [7..6] Priority for External Int 0                                        */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_EXINT1 : 2;            /*!< [15..14] Priority for External Int 1                                      */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_WAKEUP : 2;            /*!< [23..22] Priority for WAKEUP                                              */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_MATHDIV : 2;           /*!< [31..30] Priority for Math Divider                                        */
    } bit;
  } NVIC_IPR3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000410) Interrupt Priority                                         */
    
    struct {
      __IM  uint32_t            : 14;
      __IOM uint32_t PRI_CP     : 2;            /*!< [15..14] Priority for Charge Pump                                         */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_BDRV   : 2;            /*!< [23..22] Priority for Bridge Driver                                       */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_HS     : 2;            /*!< [31..30] Priority for High-Side Switch                                    */
    } bit;
  } NVIC_IPR4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000414) Interrupt Priority                                         */
    
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_OPA    : 2;            /*!< [7..6] Priority for Current Sense Amplifier                               */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_DU     : 2;            /*!< [15..14] Priority for Differential Unit                                   */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_MON    : 2;            /*!< [23..22] Priority for MON                                                 */
      __IM  uint32_t            : 6;
      __IOM uint32_t PRI_PORT2  : 2;            /*!< [31..30] Priority for PORT2                                               */
    } bit;
  } NVIC_IPR5;
  __IM  uint32_t  RESERVED6[570];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000D00) CPU ID Base Register                                       */
    
    struct {
      __IM  uint32_t REVISION   : 4;            /*!< [3..0] Revision Number                                                    */
      __IM  uint32_t PARTNO     : 12;           /*!< [15..4] Part Number                                                       */
      __IM  uint32_t CONSTANT   : 4;            /*!< [19..16] Constant                                                         */
      __IM  uint32_t VARIANT    : 4;            /*!< [23..20] Variant Number                                                   */
      __IM  uint32_t IMPLEMENTER : 8;           /*!< [31..24] Implementer Code                                                 */
    } bit;
  } CPUID;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000D04) Interrupt Control and State Register                       */
    
    struct {
      __IM  uint32_t VECTACTIVE : 6;            /*!< [5..0] VECTACTIVE                                                         */
      __IM  uint32_t            : 6;
      __IM  uint32_t VECTPENDING : 6;           /*!< [17..12] VECTPENDING                                                      */
      __IM  uint32_t            : 4;
      __IM  uint32_t ISRPENDING : 1;            /*!< [22..22] Interrupt Pending Flag                                           */
      __IM  uint32_t            : 2;
      __OM  uint32_t PENDSTCLR  : 1;            /*!< [25..25] SysTick Exception Clear Pending                                  */
      __IOM uint32_t PENDSTSET  : 1;            /*!< [26..26] SysTick Exception Set Pending                                    */
      __OM  uint32_t PENDSVCLR  : 1;            /*!< [27..27] PENDSV Clear Pending                                             */
      __IOM uint32_t PENDSVSET  : 1;            /*!< [28..28] PENDSV Set Pending                                               */
      __IM  uint32_t            : 2;
      __IOM uint32_t NMIPENDSET : 1;            /*!< [31..31] NMI Set Pending                                                  */
    } bit;
  } ICSR;
  __IM  uint32_t  RESERVED7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000D0C) Application Interrupt/Reset Control Register               */
    
