Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t CAPREL     : 16;           /*!< [15..0] Current reload value or Captured value                            */
    } bit;
  } CAPREL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Timer T2 Count Register                                    */
    
    struct {
      __IOM uint32_t T2         : 16;           /*!< [15..0] Timer T2 Current Value                                            */
    } bit;
  } T2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Timer T3 Count Register                                    */
    
    struct {
      __IOM uint32_t T3         : 16;           /*!< [15..0] Timer T3 Current Value                                            */
    } bit;
  } T3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Timer T4 Count Register                                    */
    
    struct {
      __IOM uint32_t T4         : 16;           /*!< [15..0] Timer T4 Current Value                                            */
    } bit;
  } T4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) Timer 5 Count Register                                     */
    
    struct {
      __IOM uint32_t T5         : 16;           /*!< [15..0] Timer T5 Current Value                                            */
    } bit;
  } T5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Timer 6 Count Register                                     */
    
    struct {
      __IOM uint32_t T6         : 16;           /*!< [15..0] Timer T6 Current Value                                            */
    } bit;
  } T6;
} GPT12E_Type;                                  /*!< Size = 52 (0x34)                                                          */



/* =========================================================================================================================== */
/* ================                                            HS                                             ================ */
/* =========================================================================================================================== */


/**
  * @brief HS (HS)
  */

typedef struct {                                /*!< (@ 0x40024000) HS Structure                                               */
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) High Side Driver Control                                   */
    
    struct {
      __IOM uint32_t HS1_EN     : 1;            /*!< [0..0] High Side 1 Enable                                                 */
      __IOM uint32_t HS1_PWM    : 1;            /*!< [1..1] High Side 1 PWM Enable                                             */
      __IOM uint32_t HS1_ON     : 1;            /*!< [2..2] High Side 1 On                                                     */
      __IOM uint32_t HS1_OL_EN  : 1;            /*!< [3..3] High Side 1 Open Load Detection Enable                             */
      __IM  uint32_t            : 4;
      __IOM uint32_t HS1_SR_CTRL_SEL : 2;       /*!< [9..8] High Side 1 Slew Rate Control select                               */
      __IM  uint32_t            : 2;
      __IOM uint32_t HS1_OC_SEL : 2;            /*!< [13..12] High Side 1 Overcurrent Threshold Selection                      */
    } bit;
  } CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) High Side Driver Interrupt Status                          */
    
    struct {
      __IM  uint32_t            : 5;
      __IOM uint32_t HS1_OT_IS  : 1;            /*!< [5..5] High Side 1 Overtemperature Interrupt Status                       */
      __IOM uint32_t HS1_OL_IS  : 1;            /*!< [6..6] High Side 1 Open Load Interrupt Status                             */
      __IOM uint32_t HS1_OC_IS  : 1;            /*!< [7..7] High Side 1 Overcurrent Interrupt Status                           */
      __IM  uint32_t            : 5;
      __IOM uint32_t HS1_OT_STS : 1;            /*!< [13..13] High Side 1 Overtemperature Status                               */
      __IOM uint32_t HS1_OL_STS : 1;            /*!< [14..14] High Side 1 Open Load Status                                     */
    } bit;
  } IRQS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) High Side Driver Interrupt Status Clear Register           */
    
    struct {
      __IM  uint32_t            : 5;
      __OM  uint32_t HS1_OT_ISC : 1;            /*!< [5..5] High Side 1 Overtemperature Interrupt Status Clear                 */
      __OM  uint32_t HS1_OL_ISC : 1;            /*!< [6..6] High Side 1 Open Load Interrupt Status Clear                       */
      __OM  uint32_t HS1_OC_ISC : 1;            /*!< [7..7] High Side 1 Overcurrent Interrupt Status Clear                     */
      __IM  uint32_t            : 5;
      __OM  uint32_t HS1_OT_SC  : 1;            /*!< [13..13] High Side 1 Overtemperature Status Clear                         */
      __OM  uint32_t HS1_OL_SC  : 1;            /*!< [14..14] High Side 1 Open Load Status Clear                               */
    } bit;
  } IRQCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) High Side Driver Interrupt Enable Register                 */
    
    struct {
      __IM  uint32_t            : 5;
      __IOM uint32_t HS1_OT_IEN : 1;            /*!< [5..5] High Side 1 Overtemperature Interrupt Enable                       */
      __IOM uint32_t HS1_OL_IEN : 1;            /*!< [6..6] High Side 1 Open Load Interrupt Enable                             */
      __IOM uint32_t HS1_OC_IEN : 1;            /*!< [7..7] High Side 1 Overcurrent Interrupt Enable                           */
    } bit;
  } IRQEN;
  __IM  uint32_t  RESERVED1[2];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) High Side Driver 1 TRIM                                    */
    
