Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t HS1_OL_BTFILT_SEL : 2;     /*!< [1..0] Blanking Time Filter Select for HS1 open Load detection            */
      __IM  uint32_t            : 6;
      __IOM uint32_t HS1_OC_OT_BTFILT_SEL : 2;  /*!< [9..8] Blanking Time Filter Select for HS1 overcurrent / overtemperature
                                                     detection                                                                 */
    } bit;
  } TRIM;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) High Side PWM Source Selection Register                    */
    
    struct {
      __IM  uint32_t            : 3;
      __IOM uint32_t HS1_SRC_SEL : 3;           /*!< [5..3] HS1 PWM Source Selection                                           */
    } bit;
  } PWMSRCSEL;
} HS_Type;                                      /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                            LIN                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief LIN (LIN)
  */

typedef struct {                                /*!< (@ 0x4801E000) LIN Structure                                              */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) LIN Transceiver Control                                    */
    
    struct {
      __IOM uint32_t EN         : 1;            /*!< [0..0] LIN Transceiver enable                                             */
      __IOM uint32_t MODE       : 2;            /*!< [2..1] LIN transceiver power mode control                                 */
      __IM  uint32_t            : 1;
      __IM  uint32_t MODE_FB    : 3;            /*!< [6..4] Feedback Signals for LIN Transmitter Mode Settings                 */
      __IM  uint32_t            : 2;
      __IOM uint32_t TXD        : 1;            /*!< [9..9] LIN Transmitter switch on (only used when LIN_HV_MODE
                                                     is set)                                                                   */
      __IM  uint32_t RXD        : 1;            /*!< [10..10] Output Signal of Receiver                                        */
      __IOM uint32_t SM         : 2;            /*!< [12..11] LIN Transmitter Slope mode control                               */
      __IM  uint32_t FB_SM1     : 1;            /*!< [13..13] Feedback Signal 1 for Slope Mode Setting                         */
      __IM  uint32_t FB_SM2     : 1;            /*!< [14..14] Feedback Signal 2 for Slope Mode Setting                         */
      __IM  uint32_t FB_SM3     : 1;            /*!< [15..15] Feedback Signal 3 for Slope Mode Setting                         */
      __IM  uint32_t            : 5;
      __IOM uint32_t HV_MODE    : 1;            /*!< [21..21] LIN Transceiver High Voltage Input - Output Mode                 */
    } bit;
  } CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) LIN Transceiver Interrupt Status                           */
    
    struct {
      __IM  uint32_t            : 3;
      __IM  uint32_t M_SM_ERR_IS : 1;           /*!< [3..3] LIN Transceiver Mode Error - Slope Mode Error Interrupt
                                                     Status                                                                    */
      __IM  uint32_t OT_IS      : 1;            /*!< [4..4] LIN Receiver Overtemperature Interrupt Status                      */
      __IM  uint32_t OC_IS      : 1;            /*!< [5..5] LIN Receiver Overcurrent Interrupt Status                          */
      __IM  uint32_t TXD_TMOUT_IS : 1;          /*!< [6..6] LIN TXD time-out Interrupt Status                                  */
      __IM  uint32_t            : 1;
      __IM  uint32_t M_SM_ERR_STS : 1;          /*!< [8..8] LIN Transceiver Mode Error - Slope Mode Error Status               */
      __IM  uint32_t OT_STS     : 1;            /*!< [9..9] LIN Receiver Overtemperature Status                                */
      __IM  uint32_t            : 1;
      __IM  uint32_t TXD_TMOUT_STS : 1;         /*!< [11..11] LIN TXD time-out Status                                          */
    } bit;
  } IRQS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) LIN Transceiver Interrupt Status Register Clear            */
    
    struct {
      __IM  uint32_t            : 3;
      __OM  uint32_t M_SM_ERR_ISC : 1;          /*!< [3..3] LIN Transceiver Mode Error - Slope Mode Error Interrupt
                                                     Status Clear                                                              */
      __OM  uint32_t OT_ISC     : 1;            /*!< [4..4] LIN Receiver Overtemperature Interrupt Status / Status
                                                     Clear                                                                     */
      __OM  uint32_t OC_ISC     : 1;            /*!< [5..5] LIN Receiver Overcurrent Interrupt Status Clear                    */
      __OM  uint32_t TXD_TMOUT_ISC : 1;         /*!< [6..6] LIN TXD time-out Interrupt Status Clear                            */
      __IM  uint32_t            : 1;
      __OM  uint32_t M_SM_ERR_SC : 1;           /*!< [8..8] LIN Transceiver Mode Error - Slope Mode Error Status
                                                     Clear                                                                     */
      __OM  uint32_t OT_SC      : 1;            /*!< [9..9] LIN Receiver Overtemperature Status Clear                          */
      __IM  uint32_t            : 1;
      __OM  uint32_t TXD_TMOUT_SC : 1;          /*!< [11..11] LIN TXD time-out Status Clear                                    */
    } bit;
  } IRQCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) LIN Transceiver Interrupt Enable Register                  */
    
