Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IM  uint32_t            : 3;
      __IOM uint32_t M_SM_ERR_IEN : 1;          /*!< [3..3] LIN Transceiver Mode - Slope Mode Error interrupt enable           */
      __IOM uint32_t OT_IEN     : 1;            /*!< [4..4] LIN Transceiver Overtemperature interrupt enable                   */
      __IOM uint32_t OC_IEN     : 1;            /*!< [5..5] LIN Transceiver Overcurrent interrupt enable                       */
      __IOM uint32_t TXD_TMOUT_IEN : 1;         /*!< [6..6] LIN Transceiver TxD-Timeout interrupt enable                       */
    } bit;
  } IRQEN;
} LIN_Type;                                     /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                           MATH                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief MATH (MATH)
  */

typedef struct {                                /*!< (@ 0x48013000) MATH Structure                                             */
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Global Control Register                                    */
    
    struct {
      __IOM uint32_t DVDRC      : 2;            /*!< [1..0] Dividend Register Result Chaining                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t DVSRC      : 2;            /*!< [4..3] Divisor Register Result Chaining                                   */
      __IM  uint32_t            : 11;
      __IOM uint32_t SUSCFG     : 2;            /*!< [17..16] Suspend Mode Configuration                                       */
      __IM  uint32_t            : 13;
      __IOM uint32_t MATH_EN    : 1;            /*!< [31..31] Enable Math Module                                               */
    } bit;
  } GLBCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Module Identification Register                             */
    
    struct {
      __IM  uint32_t MOD_REV    : 8;            /*!< [7..0] Module Revision Number                                             */
      __IM  uint32_t MOD_TYPE   : 8;            /*!< [15..8] Module Type                                                       */
      __IM  uint32_t MOD_NUMBER : 16;           /*!< [31..16] Module Number Value                                              */
    } bit;
  } MATH_ID;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Event Interupt Enable Register                             */
    
    struct {
      __IOM uint32_t DIVEOCIEN  : 1;            /*!< [0..0] Divider End of Calculation Interrupt Enable                        */
      __IOM uint32_t DIVERRIEN  : 1;            /*!< [1..1] Divider Error Interrupt Enable                                     */
    } bit;
  } EVIER;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Event Flag Register                                        */
    
    struct {
      __IM  uint32_t DIVEOC     : 1;            /*!< [0..0] Divider End of Calculation Event Flag                              */
      __IM  uint32_t DIVERR     : 1;            /*!< [1..1] Divider Error Event Flag                                           */
    } bit;
  } EVFR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Event Flag Set Register                                    */
    
    struct {
      __OM  uint32_t DIVEOCS    : 1;            /*!< [0..0] Divider End of Calculation Event Flag Set                          */
      __OM  uint32_t DIVERRS    : 1;            /*!< [1..1] Divider Error Event Flag Set                                       */
    } bit;
  } EVSFR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Event Flag Clear Register                                  */
    
    struct {
      __OM  uint32_t DIVEOCC    : 1;            /*!< [0..0] Divider End of Calculation Event Flag Clear                        */
      __OM  uint32_t DIVERRC    : 1;            /*!< [1..1] Divider Error Event Flag Clear                                     */
    } bit;
  } EVFCR;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Dividend Register                                          */
    
    struct {
      __IOM uint32_t VAL        : 32;           /*!< [31..0] Dividend Value                                                    */
    } bit;
  } DVD;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Divisor Register                                           */
    
    struct {
      __IOM uint32_t VAL        : 32;           /*!< [31..0] Divisor Value                                                     */
    } bit;
  } DVS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Quotient Register                                          */
    
    struct {
      __IM  uint32_t VAL        : 32;           /*!< [31..0] Quotient Value                                                    */
    } bit;
  } QUOT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) Remainder Register                                         */
    
    struct {
      __IM  uint32_t VAL        : 32;           /*!< [31..0] Remainder Value                                                   */
    } bit;
  } RMD;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Divider Status Register                                    */
    
    struct {
      __IM  uint32_t BSY        : 1;            /*!< [0..0] Busy Indication                                                    */
    } bit;
  } DIVST;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) Divider Control Register                                   */
    
