Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t ST         : 1;            /*!< [0..0] Start Bit                                                          */
      __IOM uint32_t STMODE     : 1;            /*!< [1..1] Start Mode                                                         */
      __IOM uint32_t USIGN      : 1;            /*!< [2..2] Unsigned Division Enable                                           */
      __IOM uint32_t DIVMODE    : 2;            /*!< [4..3] Division Mode                                                      */
      __IM  uint32_t            : 3;
      __IOM uint32_t QSCNT      : 5;            /*!< [12..8] Quotient Shift Count                                              */
      __IM  uint32_t            : 2;
      __IOM uint32_t QSDIR      : 1;            /*!< [15..15] Quotient Shift Direction                                         */
      __IOM uint32_t DVDSLC     : 5;            /*!< [20..16] Dividend Shift Left Count                                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t DVSSRC     : 5;            /*!< [28..24] Divisor Shift Right Count                                        */
    } bit;
  } DIVCON;
} MATH_Type;                                    /*!< Size = 56 (0x38)                                                          */



/* =========================================================================================================================== */
/* ================                                            MF                                             ================ */
/* =========================================================================================================================== */


/**
  * @brief MF (MF)
  */

typedef struct {                                /*!< (@ 0x48018000) MF Structure                                               */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Current Sense Amplifier Control Register                   */
    
    struct {
      __IOM uint32_t CSA_EN     : 1;            /*!< [0..0] CSA Enable                                                         */
      __IOM uint32_t CSA_GAIN   : 2;            /*!< [2..1] Operational Amplifier Gain Setting                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t CSA_MI_EN  : 1;            /*!< [4..4] Enable Module Isolation Testmode                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t CSA_VZERO  : 1;            /*!< [8..8] Current Sense Output Selection                                     */
    } bit;
  } CSA_CTRL;
  __IM  uint32_t  RESERVED[4];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Reference 1 Status Register                                */
    
    struct {
      __IM  uint32_t            : 4;
      __IM  uint32_t VREF1V2_LOTHWARN_STS : 1;  /*!< [4..4] Status for Undervoltage Threshold Measurement of internal
                                                     VAREF                                                                     */
      __IM  uint32_t VREF1V2_UPTHWARN_STS : 1;  /*!< [5..5] Status for Overvoltage Threshold Measurement of internal
                                                     VAREF                                                                     */
    } bit;
  } REF1_STS;
} MF_Type;                                      /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                            PMU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief PMU (PMU)
  */

typedef struct {                                /*!< (@ 0x50004000) PMU Structure                                              */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Main wake status register                                  */
    
    struct {
      __IM  uint32_t LIN_WAKE   : 1;            /*!< [0..0] Wake-up via LIN- Message                                           */
      __IM  uint32_t MON        : 1;            /*!< [1..1] Wake-up via MON which is a logical OR combination of
                                                     all Wake_STS_MON bits                                                     */
      __IM  uint32_t GPIO0      : 1;            /*!< [2..2] Wake-up via GPIO0 which is a logical OR combination of
                                                     all Wake_STS_GPIO0 bits                                                   */
      __IM  uint32_t GPIO1      : 1;            /*!< [3..3] Wake-up via GPIO1 which is a logical OR combination of
                                                     all Wake_STS_GPIO1 bits                                                   */
      __IM  uint32_t CYC_WAKE   : 1;            /*!< [4..4] Wake-up caused by Cyclic Wake                                      */
      __IM  uint32_t FAIL       : 1;            /*!< [5..5] Wake-up after any Fail, which is a logical OR combination
                                                     of PMU_OT, VDDEXT_OT, VDDEXT_UV                                           */
      __IM  uint32_t GPIO2      : 1;            /*!< [6..6] Wake-up via GPIO2 which is a logical OR combination of
                                                     all Wake_STS_GPIO2 bits                                                   */
      __IM  uint32_t            : 1;
      __IM  uint32_t MON1_WAKE_STS : 1;         /*!< [8..8] Status of MON1                                                     */
      __IM  uint32_t MON2_WAKE_STS : 1;         /*!< [9..9] Status of MON2                                                     */
      __IM  uint32_t MON3_WAKE_STS : 1;         /*!< [10..10] Status of MON3                                                   */
      __IM  uint32_t MON4_WAKE_STS : 1;         /*!< [11..11] Status of MON4                                                   */
      __IM  uint32_t MON5_WAKE_STS : 1;         /*!< [12..12] Status of MON5                                                   */
      __IM  uint32_t            : 3;
      __IM  uint32_t PMU_OT     : 1;            /*!< [16..16] Wake PMU Overtemperature                                         */
      __IM  uint32_t VDDEXT_OT  : 1;            /*!< [17..17] Wake VDDEXT Overtemperature                                      */
      __IM  uint32_t VDDEXT_UV  : 1;            /*!< [18..18] Wake VDDEXT Undervoltage                                         */
    } bit;
  } WAKE_STATUS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) GPIO Port wake status register                             */
    
