Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IM  uint32_t GPIO0_STS_0 : 1;           /*!< [0..0] Status of GPIO0_0                                                  */
      __IM  uint32_t GPIO0_STS_1 : 1;           /*!< [1..1] Status of GPIO0_1                                                  */
      __IM  uint32_t GPIO0_STS_2 : 1;           /*!< [2..2] Status of GPIO0_2                                                  */
      __IM  uint32_t GPIO0_STS_3 : 1;           /*!< [3..3] Status of GPIO0_3                                                  */
      __IM  uint32_t GPIO0_STS_4 : 1;           /*!< [4..4] Status of GPIO0_4                                                  */
      __IM  uint32_t GPIO0_STS_5 : 1;           /*!< [5..5] Status of GPIO0_5                                                  */
      __IM  uint32_t            : 2;
      __IM  uint32_t GPIO1_STS_0 : 1;           /*!< [8..8] Wake GPIO1_0                                                       */
      __IM  uint32_t GPIO1_STS_1 : 1;           /*!< [9..9] Wake GPIO1_1                                                       */
      __IM  uint32_t GPIO1_STS_2 : 1;           /*!< [10..10] Wake GPIO1_2                                                     */
      __IM  uint32_t            : 1;
      __IM  uint32_t GPIO1_STS_4 : 1;           /*!< [12..12] Wake GPIO1_4                                                     */
    } bit;
  } GPIO_WAKE_STATUS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Voltage Reg Status Register                                */
    
    struct {
      __IM  uint32_t PMU_1V5_OVERVOLT : 1;      /*!< [0..0] Overvoltage at VDDC regulator                                      */
      __IM  uint32_t PMU_1V5_OVERLOAD : 1;      /*!< [1..1] Overload at VDDC regulator                                         */
      __IOM uint32_t PMU_1V5_FAIL_EN : 1;       /*!< [2..2] Enabling of VDDC status information as interrupt source            */
      __IM  uint32_t PMU_OVERTEMP : 1;          /*!< [3..3] PMU Overtemperature                                                */
      __IM  uint32_t PMU_5V_OVERVOLT : 1;       /*!< [4..4] Overvoltage at VDDP regulator                                      */
      __IM  uint32_t PMU_5V_OVERLOAD : 1;       /*!< [5..5] Overload at VDDP regulator                                         */
      __IOM uint32_t PMU_5V_FAIL_EN : 1;        /*!< [6..6] Enabling of VDDP status information as interrupt source            */
      __IM  uint32_t            : 1;
      __OM  uint32_t PMU_1V5_OVERVOLT_SC : 1;   /*!< [8..8] Overvoltage at VDDC regulator Status clear                         */
      __OM  uint32_t PMU_1V5_OVERLOAD_SC : 1;   /*!< [9..9] Overload at VDDC regulator Status clear                            */
      __IM  uint32_t            : 1;
      __OM  uint32_t PMU_OVERTEMP_SC : 1;       /*!< [11..11] Overtemperature Status clear                                     */
      __OM  uint32_t PMU_5V_OVERVOLT_SC : 1;    /*!< [12..12] Overvoltage at VDDP regulator Status clear                       */
      __OM  uint32_t PMU_5V_OVERLOAD_SC : 1;    /*!< [13..13] Overload at VDDP regulator Status clear                          */
    } bit;
  } SUPPLY_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) VDDEXT Control                                             */
    
    struct {
      __IOM uint32_t VDDEXT_ENABLE : 1;         /*!< [0..0] VDDEXT Supply Enable                                               */
      __IOM uint32_t VDDEXT_CYC_EN : 1;         /*!< [1..1] VDDEXT Supply for Cyclic Sense Enable                              */
      __IOM uint32_t VDDEXT_FAIL_EN : 1;        /*!< [2..2] Enabling of VDDEXT Supply status information as interrupt
                                                     source                                                                    */
      __IM  uint32_t VDDEXT_OT_IS : 1;          /*!< [3..3] VDDEXT Supply OverTemperature Interrupt Status                     */
      __IM  uint32_t VDDEXT_UV_IS : 1;          /*!< [4..4] VDDEXT Supply Undervoltage Interrupt Status                        */
      __IM  uint32_t VDDEXT_OT_STS : 1;         /*!< [5..5] VDDEXT Supply Overtemperature Status                               */
      __IM  uint32_t VDDEXT_OT  : 1;            /*!< [6..6] VDDEXT Supply Overtemperature                                      */
      __IM  uint32_t VDDEXT_STABLE : 1;         /*!< [7..7] VDDEXT Supply Stable                                               */
      __IM  uint32_t            : 3;
      __OM  uint32_t VDDEXT_OT_ISC : 1;         /*!< [11..11] VDDEXT Supply Overtemperature Interrupt Status clear             */
      __OM  uint32_t VDDEXT_UV_ISC : 1;         /*!< [12..12] VDDEXT Supply Undervoltage Interrupt Status clear                */
      __OM  uint32_t VDDEXT_OT_SC : 1;          /*!< [13..13] VDDEXT Supply Overtemperature Status clear                       */
    } bit;
  } VDDEXT_CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Reset Status Register                                      */
    
    struct {
      __IOM uint32_t SYS_FAIL   : 1;            /*!< [0..0] Flag which indicates a reset caused by a System Fail
                                                     reported in the corresponding Fail Register                               */
      __IOM uint32_t PMU_WAKE   : 1;            /*!< [1..1] Flag which indicates a reset caused by Stop-Exit                   */
      __IOM uint32_t PMU_SleepEX : 1;           /*!< [2..2] Flag which indicates a reset caused by Sleep-Exit                  */
      __IOM uint32_t PMU_LPR    : 1;            /*!< [3..3] Low Priority Resets (see PMU_RST_STS2)                             */
      __IOM uint32_t PMU_ClkWDT : 1;            /*!< [4..4] Clock Watchdog (CLKWDT) Reset Flag                                 */
      __IOM uint32_t PMU_ExtWDT : 1;            /*!< [5..5] External Watchdog (WDT1) Reset Flag                                */
      __IOM uint32_t PMU_PIN    : 1;            /*!< [6..6] PIN-Reset Flag                                                     */
      __IOM uint32_t PMU_VS_POR : 1;            /*!< [7..7] Power-On Reset Flag                                                */
      __IOM uint32_t PMU_IntWDT : 1;            /*!< [8..8] Internal Watchdog Reset Flag                                       */
      __IOM uint32_t PMU_SOFT   : 1;            /*!< [9..9] Soft-Reset Flag                                                    */
      __IOM uint32_t LOCKUP     : 1;            /*!< [10..10] Lockup-Reset Flag                                                */
    } bit;
  } RESET_STS;
  __IM  uint32_t  RESERVED[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) PMU Sleep Behavior Register                                */
    
