Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t WAKE_W_RST : 1;            /*!< [0..0] Wake-up with reset execution                                       */
      __IOM uint32_t EN_0V9_N   : 1;            /*!< [1..1] Enables the reduction of the VDDC regulator output to
                                                     0.9 V during Stop-Mode                                                    */
      __IOM uint32_t CYC_WAKE_EN : 1;           /*!< [2..2] Enabling Cyclic Wake                                               */
      __IOM uint32_t CYC_SENSE_EN : 1;          /*!< [3..3] Enabling Cyclic Sense                                              */
      __IM  uint32_t            : 4;
      __IOM uint32_t CYC_SENSE_M03 : 4;         /*!< [11..8] Mantissa                                                          */
      __IOM uint32_t CYC_SENSE_E01 : 2;         /*!< [13..12] Exponent                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t CYC_WAKE_M03 : 4;          /*!< [19..16] Mantissa                                                         */
      __IOM uint32_t CYC_WAKE_E01 : 2;          /*!< [21..20] Exponent                                                         */
      __IM  uint32_t            : 2;
      __IOM uint32_t CYC_SENSE_S_DEL : 3;       /*!< [26..24] Sample Delay in Cyclic Sense                                     */
    } bit;
  } SLEEP;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) PMU Bridge Driver Control                                  */
    
    struct {
      __IOM uint32_t GL1_CYC_ON : 1;            /*!< [0..0] GL1 Cyclic On                                                      */
      __IOM uint32_t GL1_HOLD_ON : 1;           /*!< [1..1] GL1 Hold Mode On                                                   */
      __IOM uint32_t GL2_CYC_ON : 1;            /*!< [2..2] GL2 Cyclic On                                                      */
      __IOM uint32_t GL2_HOLD_ON : 1;           /*!< [3..3] GL2 Hold Mode On                                                   */
      __IOM uint32_t CNF_ON     : 2;            /*!< [5..4] CNF_ON Function                                                    */
      __IOM uint32_t CNF_OFF    : 2;            /*!< [7..6] CNF_OFF Function                                                   */
    } bit;
  } DRV_CTRL;
  __IM  uint32_t  RESERVED1[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) Settings Monitor                                           */
    
    struct {
      __IOM uint32_t MON1_EN    : 1;            /*!< [0..0] MON1 Enable                                                        */
      __IOM uint32_t MON1_FALL  : 1;            /*!< [1..1] MON1 Wake-up on Falling Edge Enable                                */
      __IOM uint32_t MON1_RISE  : 1;            /*!< [2..2] MON1 Wake-up on Rising Edge Enable                                 */
      __IOM uint32_t MON1_CYC   : 1;            /*!< [3..3] MON1 for Cycle Sense Enable                                        */
      __IOM uint32_t MON1_PD    : 1;            /*!< [4..4] Pull-Down Current Source for MON1 Input Enable                     */
      __IOM uint32_t MON1_PU    : 1;            /*!< [5..5] Pull-Up Current Source for MON1 Input Enable                       */
      __IOM uint32_t MON1_NSLEEP_SPARE : 1;     /*!< [6..6] MON1 Sleep Bit                                                     */
      __IM  uint32_t MON1_STS   : 1;            /*!< [7..7] MON1 Status Input                                                  */
      __IOM uint32_t MON2_EN    : 1;            /*!< [8..8] MON2 Enable                                                        */
      __IOM uint32_t MON2_FALL  : 1;            /*!< [9..9] MON2 Wake-up on Falling Edge Enable                                */
      __IOM uint32_t MON2_RISE  : 1;            /*!< [10..10] MON2 Wake-up on Rising Edge Enable                               */
      __IOM uint32_t MON2_CYC   : 1;            /*!< [11..11] MON2 for Cycle Sense Enable                                      */
      __IOM uint32_t MON2_PD    : 1;            /*!< [12..12] Pull-Down Current Source for MON2 Input Enable                   */
      __IOM uint32_t MON2_PU    : 1;            /*!< [13..13] Pull-Up Current Source for MON2 Input Enable                     */
      __IOM uint32_t MON2_NSLEEP_SPARE : 1;     /*!< [14..14] MON2 Sleep Bit                                                   */
      __IM  uint32_t MON2_STS   : 1;            /*!< [15..15] MON2 Status Input                                                */
      __IOM uint32_t MON3_EN    : 1;            /*!< [16..16] MON3 Enable                                                      */
      __IOM uint32_t MON3_FALL  : 1;            /*!< [17..17] MON3 Wake-up on Falling Edge Enable                              */
      __IOM uint32_t MON3_RISE  : 1;            /*!< [18..18] MON3 Wake-up on Rising Edge Enable                               */
      __IOM uint32_t MON3_CYC   : 1;            /*!< [19..19] MON3 for Cycle Sense Enable                                      */
      __IOM uint32_t MON3_PD    : 1;            /*!< [20..20] Pull-Down Current Source for MON3 Input Enable                   */
      __IOM uint32_t MON3_PU    : 1;            /*!< [21..21] Pull-Up Current Source for MON3 Input Enable                     */
      __IOM uint32_t MON3_NSLEEP_SPARE : 1;     /*!< [22..22] MON3 Sleep Bit                                                   */
      __IM  uint32_t MON3_STS   : 1;            /*!< [23..23] MON3 Status Input                                                */
      __IOM uint32_t MON4_EN    : 1;            /*!< [24..24] MON4 Enable                                                      */
      __IOM uint32_t MON4_FALL  : 1;            /*!< [25..25] MON4 Wake-up on Falling Edge Enable                              */
      __IOM uint32_t MON4_RISE  : 1;            /*!< [26..26] MON4 Wake-up on Rising Edge Enable                               */
      __IOM uint32_t MON4_CYC   : 1;            /*!< [27..27] MON4 for Cycle Sense Enable                                      */
      __IOM uint32_t MON4_PD    : 1;            /*!< [28..28] Pull-Down Current Source for MON4 Input Enable                   */
      __IOM uint32_t MON4_PU    : 1;            /*!< [29..29] Pull-Up Current Source for MON4 Input Enable                     */
      __IOM uint32_t MON4_NSLEEP_SPARE : 1;     /*!< [30..30] MON4 Sleep Bit                                                   */
      __IM  uint32_t MON4_STS   : 1;            /*!< [31..31] MON4 Status Input                                                */
    } bit;
  } MON_CNF1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) Settings Monitor                                           */
    
