Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t MON5_EN    : 1;            /*!< [0..0] MON5 Enable                                                        */
      __IOM uint32_t MON5_FALL  : 1;            /*!< [1..1] MON5 Wake-up on Falling Edge Enable                                */
      __IOM uint32_t MON5_RISE  : 1;            /*!< [2..2] MON5 Wake-up on Rising Edge Enable                                 */
      __IOM uint32_t MON5_CYC   : 1;            /*!< [3..3] MON5 for Cycle Sense Enable                                        */
      __IOM uint32_t MON5_PD    : 1;            /*!< [4..4] Pull-Down Current Source for MON5 Input Enable                     */
      __IOM uint32_t MON5_PU    : 1;            /*!< [5..5] Pull-Up Current Source for MON5 Input Enable                       */
      __IOM uint32_t MON5_NSLEEP_SPARE : 1;     /*!< [6..6] MON5 Sleep Bit                                                     */
      __IM  uint32_t MON5_STS   : 1;            /*!< [7..7] MON5 Status Input                                                  */
    } bit;
  } MON_CNF2;
  __IM  uint32_t  RESERVED2[5];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) LIN Wake Enable                                            */
    
    struct {
      __IM  uint32_t            : 7;
      __IOM uint32_t LIN_WAKE_EN : 1;           /*!< [7..7] Lin Wake enable                                                    */
    } bit;
  } LIN_WAKE_EN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000054) Overtemperature Control Register                           */
    
    struct {
      __IOM uint32_t PMU_OT_TH_CNF : 4;         /*!< [3..0] PMU Overtemperature threshold                                      */
      __IM  uint32_t            : 1;
      __IOM uint32_t PMU_OT_INT_EN : 1;         /*!< [5..5] PMU Overtemperature Interrupt Enable                               */
      __IOM uint32_t PMU_OT_WAKE_EN : 1;        /*!< [6..6] PMU Wake On Overtemperature Enable                                 */
      __IOM uint32_t PMU_OT_EN  : 1;            /*!< [7..7] PMU Overtemperature Detection Enable                               */
    } bit;
  } OT_CTRL;
  __IM  uint32_t  RESERVED3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000005C) Highside Control Register                                  */
    
    struct {
      __IM  uint32_t            : 2;
      __IOM uint32_t HS1_CYC_EN : 1;            /*!< [2..2] High-Side 1 switch enable for cyclic sense                         */
      __IM  uint32_t            : 7;
      __IOM uint32_t SPARE      : 1;            /*!< [10..10] Spare                                                            */
    } bit;
  } HIGHSIDE_CTRL;
  __IM  uint32_t  RESERVED4[3];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000006C) Reset Blind Time Register                                  */
    
    struct {
      __IOM uint32_t RST_TFB    : 2;            /*!< [1..0] Reset Pin Blind Time Selection Bits                                */
    } bit;
  } CNF_RST_TFB;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) WFS System Fail Register                                   */
    
    struct {
      __IM  uint32_t SUPP_SHORT : 1;            /*!< [0..0] Supply Short                                                       */
      __IM  uint32_t SUPP_TMOUT : 1;            /*!< [1..1] Supply Time Out                                                    */
      __IM  uint32_t PMU_1V5_OVL : 1;           /*!< [2..2] VDDC Overload Flag                                                 */
      __IM  uint32_t PMU_5V_OVL : 1;            /*!< [3..3] VDDP Overload Flag                                                 */
      __IM  uint32_t SYS_CLK_WDT : 1;           /*!< [4..4] System Clock (fsys)Watchdog Fail                                   */
      __IM  uint32_t SYS_OT     : 1;            /*!< [5..5] System Overtemperature Indication Flag                             */
      __IM  uint32_t WDT1_SEQ_FAIL : 1;         /*!< [6..6] External Watchdog (WDT1) Sequential Fail                           */
      __IM  uint32_t LP_CLKWD   : 1;            /*!< [7..7] LP_CLKWD                                                           */
      __IM  uint32_t PMU_OT_FAIL : 1;           /*!< [8..8] PMU Overtemperature Indication Flag                                */
    } bit;
  } WFS;
  __IM  uint32_t  RESERVED5[14];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000AC) PMU Wake-up Timing Register                                */
    
    struct {
      __IOM uint32_t CNF_LIN_FT : 1;            /*!< [0..0] Wake-up Filter time for LIN WAKE                                   */
      __IOM uint32_t CNF_MON_FT : 1;            /*!< [1..1] Wake-up Filter time for Monitoring Inputs                          */
      __IOM uint32_t CNF_GPIO_FT : 2;           /*!< [3..2] Wake-up Filter time for General Purpose IO                         */
    } bit;
  } CNF_WAKE_FILTER;
  __IM  uint32_t  RESERVED6;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B4) POR Reset Configuration Register                           */
    
    struct {
      __IOM uint32_t CNF_FILT   : 2;            /*!< [1..0] Configuration for reset filter                                     */
    } bit;
  } PORCFG;
  __IM  uint32_t  RESERVED7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000BC) Wake Configuration GPIO Port 0 Register                    */
    
    struct {
      __IOM uint32_t RI_0       : 1;            /*!< [0..0] Port 0_0 Wake-up on Rising Edge enable                             */
      __IOM uint32_t RI_1       : 1;            /*!< [1..1] Port 0_1 Wake-up on Rising Edge enable                             */
      __IOM uint32_t RI_2       : 1;            /*!< [2..2] Port 0_2 Wake-up on Rising Edge enable                             */
      __IOM uint32_t RI_3       : 1;            /*!< [3..3] Port 0_3 Wake-up on Rising Edge enable                             */
      __IOM uint32_t RI_4       : 1;            /*!< [4..4] Port 0_4 Wake-up on Rising Edge enable                             */
      __IOM uint32_t RI_5       : 1;            /*!< [5..5] Port 0_5 Wake-up on Rising Edge enable                             */
      __IM  uint32_t            : 2;
      __IOM uint32_t FA_0       : 1;            /*!< [8..8] Port 0_0 Wake-up on Falling Edge enable                            */
      __IOM uint32_t FA_1       : 1;            /*!< [9..9] Port 0_1 Wake-up on Falling Edge enable                            */
      __IOM uint32_t FA_2       : 1;            /*!< [10..10] Port 0_2 Wake-up on Falling Edge enable                          */
      __IOM uint32_t FA_3       : 1;            /*!< [11..11] Port 0_3 Wake-up on Falling Edge enable                          */
      __IOM uint32_t FA_4       : 1;            /*!< [12..12] Port 0_4 Wake-up on Falling Edge enable                          */
      __IOM uint32_t FA_5       : 1;            /*!< [13..13] Port 0_5 Wake-up on Falling Edge enable                          */
      __IM  uint32_t            : 2;
      __IOM uint32_t CYC_0      : 1;            /*!< [16..16] GPIO0_0 input for cycle sense enable                             */
      __IOM uint32_t CYC_1      : 1;            /*!< [17..17] GPIO0_1 input for cycle sense enable                             */
      __IOM uint32_t CYC_2      : 1;            /*!< [18..18] GPIO0_2 input for cycle sense enable                             */
      __IOM uint32_t CYC_3      : 1;            /*!< [19..19] GPIO0_3 input for cycle sense enable                             */
      __IOM uint32_t CYC_4      : 1;            /*!< [20..20] GPIO0_4 input for cycle sense enable                             */
      __IOM uint32_t CYC_5      : 1;            /*!< [21..21] GPIO0_5 input for cycle sense enable                             */
    } bit;
  } WAKE_CNF_GPIO0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C0) General Purpose User DATA0to3                              */
    
