Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t DATA0      : 8;            /*!< [7..0] DATA0 Storage Byte                                                 */
      __IOM uint32_t DATA1      : 8;            /*!< [15..8] DATA1 Storage Byte                                                */
      __IOM uint32_t DATA2      : 8;            /*!< [23..16] DATA2 Storage Byte                                               */
      __IOM uint32_t DATA3      : 8;            /*!< [31..24] DATA3 Storage Byte                                               */
    } bit;
  } GPUDATA0to3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C4) General Purpose User DATA4to7                              */
    
    struct {
      __IOM uint32_t DATA4      : 8;            /*!< [7..0] DATA4 Storage Byte                                                 */
      __IOM uint32_t DATA5      : 8;            /*!< [15..8] DATA5 Storage Byte                                                */
      __IOM uint32_t DATA6      : 8;            /*!< [23..16] DATA6 Storage Byte                                               */
      __IOM uint32_t DATA7      : 8;            /*!< [31..24] DATA7 Storage Byte                                               */
    } bit;
  } GPUDATA4to7;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C8) General Purpose User DATA8to11                             */
    
    struct {
      __IOM uint32_t DATA8      : 8;            /*!< [7..0] DATA8 Storage Byte                                                 */
      __IOM uint32_t DATA9      : 8;            /*!< [15..8] DATA9 Storage Byte                                                */
      __IOM uint32_t DATA10     : 8;            /*!< [23..16] DATA10 Storage Byte                                              */
      __IOM uint32_t DATA11     : 8;            /*!< [31..24] DATA11 Storage Byte                                              */
    } bit;
  } GPUDATA8to11;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000CC) Wake Configuration GPIO Port 1 Register                    */
    
    struct {
      __IOM uint32_t RI_0       : 1;            /*!< [0..0] Port 1_0 Wake-up on Rising Edge enable                             */
      __IOM uint32_t RI_1       : 1;            /*!< [1..1] Port 1_1 Wake-up on Rising Edge enable                             */
      __IOM uint32_t RI_2       : 1;            /*!< [2..2] Port 1_2 Wake-up on Rising Edge enable                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t RI_4       : 1;            /*!< [4..4] Port 1_4 Wake-up on Rising Edge enable                             */
      __IM  uint32_t            : 3;
      __IOM uint32_t FA_0       : 1;            /*!< [8..8] Port 1_0 Wake-up on Falling Edge enable                            */
      __IOM uint32_t FA_1       : 1;            /*!< [9..9] Port 1_1 Wake-up on Falling Edge enable                            */
      __IOM uint32_t FA_2       : 1;            /*!< [10..10] Port 1_2 Wake-up on Falling Edge enable                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t FA_4       : 1;            /*!< [12..12] Port 1_4 Wake-up on Falling Edge enable                          */
      __IM  uint32_t            : 3;
      __IOM uint32_t CYC_0      : 1;            /*!< [16..16] GPIO1_0 input for cycle sense enable                             */
      __IOM uint32_t CYC_1      : 1;            /*!< [17..17] GPIO1_1 input for cycle sense enable                             */
      __IOM uint32_t CYC_2      : 1;            /*!< [18..18] GPIO1_2 input for cycle sense enable                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t CYC_4      : 1;            /*!< [20..20] GPIO1_4 input for cycle sense enable                             */
    } bit;
  } WAKE_CNF_GPIO1;
} PMU_Type;                                     /*!< Size = 208 (0xd0)                                                         */



/* =========================================================================================================================== */
/* ================                                           PORT                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief PORT (PORT)
  */

typedef struct {                                /*!< (@ 0x48028000) PORT Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Port 0 Data Register                                       */
    
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] Port 0 Pin 0 Data Value                                            */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] Port 0 Pin 1 Data Value                                            */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] Port 0 Pin 2 Data Value                                            */
      __IOM uint32_t PP3        : 1;            /*!< [3..3] Port 0 Pin 3 Data Value                                            */
      __IOM uint32_t PP4        : 1;            /*!< [4..4] Port 0 Pin 4 Data Value                                            */
      __IOM uint32_t PP5        : 1;            /*!< [5..5] Port 0 Pin 5 Data Value                                            */
      __IM  uint32_t            : 10;
      __IM  uint32_t PP0_STS    : 1;            /*!< [16..16] Port 0 Pin 0 Data Value (read back of Port Data when
                                                     IO is configured as output)                                               */
      __IM  uint32_t PP1_STS    : 1;            /*!< [17..17] Port 0 Pin 1 Data Value (read back of Port Data when
                                                     IO is configured as output)                                               */
      __IM  uint32_t PP2_STS    : 1;            /*!< [18..18] Port 0 Pin 2 Data Value (read back of Port Data when
                                                     IO is configured as output)                                               */
      __IM  uint32_t PP3_STS    : 1;            /*!< [19..19] Port 0 Pin 3 Data Value (read back of Port Data when
                                                     IO is configured as output)                                               */
      __IM  uint32_t PP4_STS    : 1;            /*!< [20..20] Port 0 Pin 4 Data Value (read back of Port Data when
                                                     IO is configured as output)                                               */
      __IM  uint32_t PP5_STS    : 1;            /*!< [21..21] Port 0 Pin 5 Data Value (read back of Port Data when
                                                     IO is configured as output)                                               */
    } bit;
  } P0_DATA;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Port 0 Direction Register                                  */
    
