Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] Port 0 Pin 0 Direction Control                                     */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] Port 0 Pin 1 Direction Control                                     */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] Port 0 Pin 2 Direction Control                                     */
      __IOM uint32_t PP3        : 1;            /*!< [3..3] Port 0 Pin 3 Direction Control                                     */
      __IOM uint32_t PP4        : 1;            /*!< [4..4] Port 0 Pin 4 Direction Control                                     */
      __IOM uint32_t PP5        : 1;            /*!< [5..5] Port 0 Pin 5 Direction Control                                     */
      __IM  uint32_t            : 10;
      __IOM uint32_t PP0_INEN   : 1;            /*!< [16..16] Port 0 Pin 0 Input Schmitt Trigger enable (only valid
                                                     if IO is configured as output)                                            */
      __IOM uint32_t PP1_INEN   : 1;            /*!< [17..17] Port 0 Pin 1 Input Schmitt Trigger enable (only valid
                                                     if IO is configured as output)                                            */
      __IOM uint32_t PP2_INEN   : 1;            /*!< [18..18] Port 0 Pin 2 Input Schmitt Trigger enable (only valid
                                                     if IO is configured as output)                                            */
      __IOM uint32_t PP3_INEN   : 1;            /*!< [19..19] Port 0 Pin 3 Input Schmitt Trigger enable (only valid
                                                     if IO is configured as output)                                            */
      __IOM uint32_t PP4_INEN   : 1;            /*!< [20..20] Port 0 Pin 4 Input Schmitt Trigger enable (only valid
                                                     if IO is configured as output)                                            */
      __IOM uint32_t PP5_INEN   : 1;            /*!< [21..21] Port 0 Pin 5 Input Schmitt Trigger enable (only valid
                                                     if IO is configured as output)                                            */
    } bit;
  } P0_DIR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Port 0 Open Drain Control Register                         */
    
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] Port 0 Pin 0 Open Drain Mode                                       */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] Port 0 Pin 1 Open Drain Mode                                       */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] Port 0 Pin 2 Open Drain Mode                                       */
      __IOM uint32_t PP3        : 1;            /*!< [3..3] Port 0 Pin 3 Open Drain Mode                                       */
      __IOM uint32_t PP4        : 1;            /*!< [4..4] Port 0 Pin 4 Open Drain Mode                                       */
      __IOM uint32_t PP5        : 1;            /*!< [5..5] Port 0 Pin 5 Open Drain Mode                                       */
    } bit;
  } P0_OD;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Port 0 Pull-Up/Pull-Down Select Register                   */
    
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] Pull-Up/Pull-Down Select Port 0 Bit 0                              */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] Pull-Up/Pull-Down Select Port 0 Bit 1                              */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] Pull-Up/Pull-Down Select Port 0 Bit 2                              */
      __IOM uint32_t PP3        : 1;            /*!< [3..3] Pull-Up/Pull-Down Select Port 0 Bit 3                              */
      __IOM uint32_t PP4        : 1;            /*!< [4..4] Pull-Up/Pull-Down Select Port 0 Bit 4                              */
      __IOM uint32_t PP5        : 1;            /*!< [5..5] Pull-Up/Pull-Down Select Port 0 Bit 5                              */
    } bit;
  } P0_PUDSEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Port 0 Pull-Up/Pull-Down Enable Register                   */
    
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] Pull-Up/Pull-Down Enable at Port 0 Bit 0                           */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] Pull-Up/Pull-Down Enable at Port 0 Bit 1                           */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] Pull-Up/Pull-Down Enable at Port 0 Bit 2                           */
      __IOM uint32_t PP3        : 1;            /*!< [3..3] Pull-Up/Pull-Down Enable at Port 0 Bit 3                           */
      __IOM uint32_t PP4        : 1;            /*!< [4..4] Pull-Up/Pull-Down Enable at Port 0 Bit 4                           */
      __IOM uint32_t PP5        : 1;            /*!< [5..5] Pull-Up/Pull-Down Enable at Port 0 Bit 5                           */
    } bit;
  } P0_PUDEN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Port 0 Alternate Select Register 0                         */
    
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] See                                                                */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] See                                                                */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] See                                                                */
      __IOM uint32_t PP3        : 1;            /*!< [3..3] See                                                                */
      __IOM uint32_t PP4        : 1;            /*!< [4..4] See                                                                */
      __IOM uint32_t PP5        : 1;            /*!< [5..5] See                                                                */
    } bit;
  } P0_ALTSEL0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) Port 0 Alternate Select Register 1                         */
    
