Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] See                                                                */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] See                                                                */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] See                                                                */
      __IOM uint32_t PP3        : 1;            /*!< [3..3] See                                                                */
      __IOM uint32_t PP4        : 1;            /*!< [4..4] See                                                                */
      __IOM uint32_t PP5        : 1;            /*!< [5..5] See                                                                */
    } bit;
  } P0_ALTSEL1;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Port 1 Data Register                                       */
    
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] Port 1 Pin 0 Data Value                                            */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] Port 1 Pin 1 Data Value                                            */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] Port 1 Pin 2 Data Value                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t PP4        : 1;            /*!< [4..4] Port 1 Pin 4 Data Value                                            */
      __IM  uint32_t            : 11;
      __IM  uint32_t PP0_STS    : 1;            /*!< [16..16] Port 1 Pin 0 Data Value (read back of Port Data when
                                                     IO is configured as output)                                               */
      __IM  uint32_t PP1_STS    : 1;            /*!< [17..17] Port 1 Pin 1 Data Value (read back of Port Data when
                                                     IO is configured as output)                                               */
      __IM  uint32_t PP2_STS    : 1;            /*!< [18..18] Port 1 Pin 2 Data Value (read back of Port Data when
                                                     IO is configured as output)                                               */
      __IM  uint32_t            : 1;
      __IM  uint32_t PP4_STS    : 1;            /*!< [20..20] Port 1 Pin 4 Data Value (read back of Port Data when
                                                     IO is configured as output)                                               */
    } bit;
  } P1_DATA;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) Port 1 Direction Register                                  */
    
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] Port 1 Pin 0 Direction Control                                     */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] Port 1 Pin 1 Direction Control                                     */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] Port 1 Pin 2 Direction Control                                     */
      __IM  uint32_t            : 1;
      __IOM uint32_t PP4        : 1;            /*!< [4..4] Port 1 Pin 4 Direction Control                                     */
      __IM  uint32_t            : 11;
      __IOM uint32_t PP0_INEN   : 1;            /*!< [16..16] Port 1 Pin 0 Input Schmitt Trigger enable (only valid
                                                     if IO is configured as output)                                            */
      __IOM uint32_t PP1_INEN   : 1;            /*!< [17..17] Port 1 Pin 1 Input Schmitt Trigger enable (only valid
                                                     if IO is configured as output)                                            */
      __IOM uint32_t PP2_INEN   : 1;            /*!< [18..18] Port 1 Pin 2 Input Schmitt Trigger enable (only valid
                                                     if IO is configured as output)                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t PP4_INEN   : 1;            /*!< [20..20] Port 1 Pin 4 Input Schmitt Trigger enable (only valid
                                                     if IO is configured as output)                                            */
    } bit;
  } P1_DIR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) Port 1 Open Drain Control Register                         */
    
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] Port 1 Pin 0 Open Drain Mode                                       */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] Port 1 Pin 1 Open Drain Mode                                       */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] Port 1 Pin 2 Open Drain Mode                                       */
      __IM  uint32_t            : 1;
      __IOM uint32_t PP4        : 1;            /*!< [4..4] Port 1 Pin 4 Open Drain Mode                                       */
    } bit;
  } P1_OD;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) Port 1 Pull-Up/Pull-Down Select Register                   */
    
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] Pull-Up/Pull-Down Select Port 1 Bit 0                              */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] Pull-Up/Pull-Down Select Port 1 Bit 1                              */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] Pull-Up/Pull-Down Select Port 1 Bit 2                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t PP4        : 1;            /*!< [4..4] Pull-Up/Pull-Down Select Port 1 Bit 4                              */
    } bit;
  } P1_PUDSEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Port 1 Pull-Up/Pull-Down Enable Register                   */
    
