Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] Pull-Up/Pull-Down Enable at Port 1 Bit 0                           */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] Pull-Up/Pull-Down Enable at Port 1 Bit 1                           */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] Pull-Up/Pull-Down Enable at Port 1 Bit 2                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t PP4        : 1;            /*!< [4..4] Pull-Up/Pull-Down Enable at Port 1 Bit 4                           */
    } bit;
  } P1_PUDEN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) Port 1 Alternate Select Register 0                         */
    
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] See                                                                */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] See                                                                */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] See                                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t PP4        : 1;            /*!< [4..4] See                                                                */
    } bit;
  } P1_ALTSEL0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) Port 1 Alternate Select Register 1                         */
    
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] See                                                                */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] See                                                                */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] See                                                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t PP4        : 1;            /*!< [4..4] See                                                                */
    } bit;
  } P1_ALTSEL1;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Port 2 Data Register                                       */
    
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] Port 2 Pin 0 Data Value                                            */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] Port 2 Pin 1 Data Value                                            */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] Port 2 Pin 2 Data Value                                            */
      __IOM uint32_t PP3        : 1;            /*!< [3..3] Port 2 Pin 3 Data Value                                            */
      __IM  uint32_t            : 3;
      __IOM uint32_t PP7        : 1;            /*!< [7..7] Port 2 Pin 7 Data Value                                            */
    } bit;
  } P2_DATA;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000044) Port 2 Direction Register                                  */
    
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] Port 2 Pin 0 Driver Control                                        */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] Port 2 Pin 1 Driver Control                                        */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] Port 2 Pin 2 Driver Control                                        */
      __IOM uint32_t PP3        : 1;            /*!< [3..3] Port 2 Pin 3 Driver Control                                        */
      __IM  uint32_t            : 3;
      __IOM uint32_t PP7        : 1;            /*!< [7..7] Port 2 Pin 7 Driver Control                                        */
    } bit;
  } P2_DIR;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) Port 2 Pull-Up/Pull-Down Select Register                   */
    
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] Pull-Up/Pull-Down Select Port 2 Bit 0                              */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] Pull-Up/Pull-Down Select Port 2 Bit 1                              */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] Pull-Up/Pull-Down Select Port 2 Bit 2                              */
      __IOM uint32_t PP3        : 1;            /*!< [3..3] Pull-Up/Pull-Down Select Port 2 Bit 3                              */
      __IM  uint32_t            : 3;
      __IOM uint32_t PP7        : 1;            /*!< [7..7] Pull-Up/Pull-Down Select Port 2 Bit 7                              */
    } bit;
  } P2_PUDSEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Port 2 Pull-Up/Pull-Down Enable Register                   */
    
    struct {
      __IOM uint32_t PP0        : 1;            /*!< [0..0] Pull-Up/Pull-Down Enable at Port 2 Bit 0                           */
      __IOM uint32_t PP1        : 1;            /*!< [1..1] Pull-Up/Pull-Down Enable at Port 2 Bit 1                           */
      __IOM uint32_t PP2        : 1;            /*!< [2..2] Pull-Up/Pull-Down Enable at Port 2 Bit 2                           */
      __IOM uint32_t PP3        : 1;            /*!< [3..3] Pull-Up/Pull-Down Enable at Port 2 Bit 3                           */
      __IM  uint32_t            : 3;
      __IOM uint32_t PP7        : 1;            /*!< [7..7] Pull-Up/Pull-Down Enable at Port 2 Bit 7                           */
    } bit;
  } P2_PUDEN;
} PORT_Type;                                    /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                            SCU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SCU (SCU)
  */

typedef struct {                                /*!< (@ 0x50005000) SCU Structure                                              */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) NMI Status Clear Register                                  */
    
