Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __OM  uint32_t FNMIWDTC   : 1;            /*!< [0..0] Watchdog Timer NMI Flag                                            */
      __OM  uint32_t FNMIPLLC   : 1;            /*!< [1..1] PLL NMI Flag                                                       */
      __IM  uint32_t            : 2;
      __OM  uint32_t FNMIOWDC   : 1;            /*!< [4..4] Oscillator Watchdog NMI Flag                                       */
      __OM  uint32_t FNMIMAPC   : 1;            /*!< [5..5] NVM Map Error NMI Flag                                             */
    } bit;
  } NMISRCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Interrupt Request Register 0                               */
    
    struct {
      __IM  uint32_t EXINT0R    : 1;            /*!< [0..0] Interrupt Flag for External Interrupt 0x on rising edge            */
      __IM  uint32_t EXINT0F    : 1;            /*!< [1..1] Interrupt Flag for External Interrupt 0x on falling edge           */
      __IM  uint32_t EXINT1R    : 1;            /*!< [2..2] Interrupt Flag for External Interrupt 1x on rising edge            */
      __IM  uint32_t EXINT1F    : 1;            /*!< [3..3] Interrupt Flag for External Interrupt 1x on falling edge           */
      __IM  uint32_t EXINT2R    : 1;            /*!< [4..4] Interrupt Flag for External Interrupt 2x on rising edge            */
      __IM  uint32_t EXINT2F    : 1;            /*!< [5..5] Interrupt Flag for External Interrupt 2x on falling edge           */
    } bit;
  } IRCON0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Interrupt Request Register 1                               */
    
    struct {
      __IM  uint32_t MON1R      : 1;            /*!< [0..0] Interrupt Flag for MON1x on rising edge                            */
      __IM  uint32_t MON1F      : 1;            /*!< [1..1] Interrupt Flag for MON1x on falling edge                           */
      __IM  uint32_t MON2R      : 1;            /*!< [2..2] Interrupt Flag for MON2x on rising edge                            */
      __IM  uint32_t MON2F      : 1;            /*!< [3..3] Interrupt Flag for MON2x on falling edge                           */
      __IM  uint32_t MON3R      : 1;            /*!< [4..4] Interrupt Flag for MON3x on rising edge                            */
      __IM  uint32_t MON3F      : 1;            /*!< [5..5] Interrupt Flag for MON3x on falling edge                           */
      __IM  uint32_t MON4R      : 1;            /*!< [6..6] Interrupt Flag for MON4x on rising edge                            */
      __IM  uint32_t MON4F      : 1;            /*!< [7..7] Interrupt Flag for MON4x on falling edge                           */
    } bit;
  } IRCON1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Interrupt Request Register 2                               */
    
    struct {
      __IM  uint32_t EIR1       : 1;            /*!< [0..0] Error Interrupt Flag for SSC1                                      */
      __IM  uint32_t TIR1       : 1;            /*!< [1..1] Transmit Interrupt Flag for SSC1                                   */
      __IM  uint32_t RIR1       : 1;            /*!< [2..2] Receive Interrupt Flag for SSC1                                    */
    } bit;
  } IRCON2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Interrupt Request Register 3                               */
    
    struct {
      __IM  uint32_t EIR2       : 1;            /*!< [0..0] Error Interrupt Flag for SSC2                                      */
      __IM  uint32_t TIR2       : 1;            /*!< [1..1] Transmit Interrupt Flag for SSC2                                   */
      __IM  uint32_t RIR2       : 1;            /*!< [2..2] Receive Interrupt Flag for SSC2                                    */
    } bit;
  } IRCON3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Interrupt Request Register 4                               */
    
    struct {
      __IM  uint32_t CCU6SR0    : 1;            /*!< [0..0] Interrupt Flag 1 for CCU6                                          */
      __IM  uint32_t            : 3;
      __IM  uint32_t CCU6SR1    : 1;            /*!< [4..4] Interrupt Flag 1 for CCU6                                          */
      __IM  uint32_t            : 11;
      __IM  uint32_t CCU6SR2    : 1;            /*!< [16..16] Interrupt Flag 1 for CCU6                                        */
      __IM  uint32_t            : 3;
      __IM  uint32_t CCU6SR3    : 1;            /*!< [20..20] Interrupt Flag 1 for CCU6                                        */
    } bit;
  } IRCON4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) NMI Status Register                                        */
    
    struct {
      __IM  uint32_t FNMIWDT    : 1;            /*!< [0..0] Watchdog Timer NMI Flag                                            */
      __IM  uint32_t FNMIPLL    : 1;            /*!< [1..1] PLL NMI Flag                                                       */
      __IM  uint32_t            : 1;
      __IM  uint32_t FNMIOT     : 1;            /*!< [3..3] Overtemperature NMI Flag                                           */
      __IM  uint32_t FNMIOWD    : 1;            /*!< [4..4] Oscillator Watchdog NMI Flag                                       */
      __IM  uint32_t FNMIMAP    : 1;            /*!< [5..5] NVM Map Error NMI Flag                                             */
      __IM  uint32_t FNMIECC    : 1;            /*!< [6..6] ECC Error NMI Flag                                                 */
      __IM  uint32_t FNMISUP    : 1;            /*!< [7..7] Supply Prewarning NMI Flag                                         */
      __IM  uint32_t FNMISTOF   : 1;            /*!< [8..8] Stack Overflow NMI Flag                                            */
    } bit;
  } NMISR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Interrupt Enable Register 0                                */
    
