Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IM  uint32_t            : 31;
      __IOM uint32_t EA         : 1;            /*!< [31..31] Global Interrupt Mask                                            */
    } bit;
  } IEN0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) Vector Table Reallocation Register                         */
    
    struct {
      __IOM uint32_t VTOR_BYP   : 2;            /*!< [1..0] Vector Table Bypass Mode                                           */
    } bit;
  } VTOR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) NMI Control Register                                       */
    
    struct {
      __IOM uint32_t NMIWDT     : 1;            /*!< [0..0] Watchdog Timer NMI Enable                                          */
      __IOM uint32_t NMIPLL     : 1;            /*!< [1..1] PLL Loss of Lock NMI Enable                                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t NMIOT      : 1;            /*!< [3..3] NMI OT Enable                                                      */
      __IOM uint32_t NMIOWD     : 1;            /*!< [4..4] Oscillator Watchdog NMI Enable                                     */
      __IOM uint32_t NMIMAP     : 1;            /*!< [5..5] NVM Map Error NMI Enable                                           */
      __IOM uint32_t NMIECC     : 1;            /*!< [6..6] ECC Error NMI Enable                                               */
      __IOM uint32_t NMISUP     : 1;            /*!< [7..7] Supply Prewarning NMI Enable                                       */
      __IOM uint32_t NMISTOF    : 1;            /*!< [8..8] Stack Overflow NMI Enable                                          */
    } bit;
  } NMICON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) External Interrupt Control Register 0                      */
    
    struct {
      __IOM uint32_t EXINT0     : 2;            /*!< [1..0] External Interrupt 0 Trigger Select                                */
      __IOM uint32_t EXINT1     : 2;            /*!< [3..2] External Interrupt 1 Trigger Select                                */
      __IOM uint32_t EXINT2     : 2;            /*!< [5..4] External Interrupt 2 Trigger Select                                */
    } bit;
  } EXICON0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000002C) External Interrupt Control Register 1                      */
    
    struct {
      __IOM uint32_t MON1       : 2;            /*!< [1..0] MON1 Input Trigger Select                                          */
      __IOM uint32_t MON2       : 2;            /*!< [3..2] MON2 Input Trigger Select                                          */
      __IOM uint32_t MON3       : 2;            /*!< [5..4] MON3 Input Trigger Select                                          */
      __IOM uint32_t MON4       : 2;            /*!< [7..6] MON4 Input Trigger Select                                          */
    } bit;
  } EXICON1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Peripheral Interrupt Enable Register 1                     */
    
    struct {
      __IOM uint32_t EIREN1     : 1;            /*!< [0..0] SSC 1 Error Interrupt Enable                                       */
      __IOM uint32_t TIREN1     : 1;            /*!< [1..1] SSC 1 Transmit Interrupt Enable                                    */
      __IOM uint32_t RIREN1     : 1;            /*!< [2..2] SSC 1 Receive Interrupt Enable                                     */
      __IM  uint32_t            : 5;
      __IOM uint32_t EIREN2     : 1;            /*!< [8..8] SSC 2 Error Interrupt Enable                                       */
      __IOM uint32_t TIREN2     : 1;            /*!< [9..9] SSC 2 Transmit Interrupt Enable                                    */
      __IOM uint32_t RIREN2     : 1;            /*!< [10..10] SSC 2 Receive Interrupt Enable                                   */
    } bit;
  } MODIEN1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) Peripheral Interrupt Enable Register 2                     */
    
    struct {
      __IOM uint32_t RIEN1      : 1;            /*!< [0..0] UART 1 Receive Interrupt Enable                                    */
      __IOM uint32_t TIEN1      : 1;            /*!< [1..1] UART 1 Transmit Interrupt Enable                                   */
      __IM  uint32_t            : 3;
      __IOM uint32_t EXINT2_EN  : 1;            /*!< [5..5] External Interrupt 2 Enable                                        */
      __IOM uint32_t RIEN2      : 1;            /*!< [6..6] UART 2 Receive Interrupt Enable                                    */
      __IOM uint32_t TIEN2      : 1;            /*!< [7..7] UART 2 Transmit Interrupt Enable                                   */
    } bit;
  } MODIEN2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000038) Peripheral Interrupt Enable Register 3                     */
    
    struct {
      __IOM uint32_t IE0        : 1;            /*!< [0..0] External Interrupt Enable                                          */
    } bit;
  } MODIEN3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000003C) Peripheral Interrupt Enable Register 4                     */
    
    struct {
      __IOM uint32_t IE1        : 1;            /*!< [0..0] External Interrupt Enable                                          */
    } bit;
  } MODIEN4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000040) Power Mode Control Register 0                              */
    
    struct {
      __IOM uint32_t XTAL_ON    : 1;            /*!< [0..0] OSC_HP Operation in Power Down Mode                                */
      __IOM uint32_t SL         : 1;            /*!< [1..1] Sleep Mode Enable. Active High.                                    */
      __IOM uint32_t PD         : 1;            /*!< [2..2] Power Down Mode Enable. Active High.                               */
      __IOM uint32_t SD         : 1;            /*!< [3..3] Slow Down Mode Enable. Active High.                                */
    } bit;
  } PMCON0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000044) PLL Control Register                                       */
    
