Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IM  uint32_t LOCK       : 1;            /*!< [0..0] PLL Lock Status Flag                                               */
      __IOM uint32_t RESLD      : 1;            /*!< [1..1] Restart Lock Detection                                             */
      __IOM uint32_t OSCDISC    : 1;            /*!< [2..2] Oscillator Disconnect                                              */
      __IOM uint32_t VCOBYP     : 1;            /*!< [3..3] PLL VCO Bypass Mode Select                                         */
      __IM  uint32_t            : 4;
      __IOM uint32_t NDIV       : 8;            /*!< [15..8] PLL N-Divider                                                     */
      __IM  uint32_t            : 2;
      __OM  uint32_t UNPROT_OSCDISC : 1;        /*!< [18..18] Unprotect write access of OSC_DISC                               */
      __OM  uint32_t UNPROT_VCOBYP : 1;         /*!< [19..19] Unprotect write access of VCO_BYP                                */
    } bit;
  } PLL_CON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000048) Clock Control Register 1                                   */
    
    struct {
      __IOM uint32_t CLKREL     : 4;            /*!< [3..0] Slow Down Clock Divider for fCCLK Generation                       */
      __IOM uint32_t K2DIV      : 3;            /*!< [6..4] PLL K2-Divider                                                     */
      __IOM uint32_t K1DIV      : 1;            /*!< [7..7] PLL K1-Divider                                                     */
      __IOM uint32_t PDIV       : 6;            /*!< [13..8] PLL PDIV-Divider:                                                 */
    } bit;
  } CMCON1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000004C) Clock Control Register 2                                   */
    
    struct {
      __IOM uint32_t PBA0CLKREL : 1;            /*!< [0..0] PBA0 Clock Divider                                                 */
    } bit;
  } CMCON2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000050) Watchdog Timer Control Register                            */
    
    struct {
      __IOM uint32_t WDTIN      : 1;            /*!< [0..0] Watchdog Timer Input Frequency Selection                           */
      __IOM uint32_t WDTRS      : 1;            /*!< [1..1] WDT Refresh Start                                                  */
      __IOM uint32_t WDTEN      : 1;            /*!< [2..2] WDT Enable                                                         */
      __IM  uint32_t            : 1;
      __IM  uint32_t WDTPR      : 1;            /*!< [4..4] Watchdog Prewarning Mode Flag                                      */
      __IOM uint32_t WINBEN     : 1;            /*!< [5..5] Watchdog Window-Boundary Enable                                    */
    } bit;
  } WDTCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000054) Analog Peripheral Clock Control Register                   */
    
    struct {
      __IOM uint32_t APCLK_SET  : 1;            /*!< [0..0] Set and Overtake Flag for Clock Settings                           */
      __IM  uint32_t            : 7;
      __IOM uint32_t CLKWDT_IE  : 1;            /*!< [8..8] Clock Watchdog Interrupt Enable                                    */
    } bit;
  } APCLK_CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000058) Analog Peripheral Clock Register                           */
    
    struct {
      __IOM uint32_t APCLK1FAC  : 2;            /*!< [1..0] Analog Module Clock Factor                                         */
      __IM  uint32_t            : 6;
      __IOM uint32_t APCLK2FAC  : 5;            /*!< [12..8] Slow Down Clock Divider for TFILT_CLK Generation                  */
      __IM  uint32_t            : 11;
      __IOM uint32_t BGCLK_SEL  : 1;            /*!< [24..24] Bandgap Clock Selection                                          */
      __IOM uint32_t BGCLK_DIV  : 1;            /*!< [25..25] Bandgap Clock Divider                                            */
      __IM  uint32_t            : 2;
      __IOM uint32_t CPCLK_SEL  : 1;            /*!< [28..28] Charge Pump Clock Selection                                      */
      __IOM uint32_t CPCLK_DIV  : 1;            /*!< [29..29] Charge Pump Clock Divider                                        */
    } bit;
  } APCLK;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000005C) Analog Peripheral Clock Status Register                    */
    
    struct {
      __IM  uint32_t APCLK1STS  : 2;            /*!< [1..0] Analog Peripherals Clock Status                                    */
      __IM  uint32_t            : 2;
      __IM  uint32_t APCLK_ERR_STS : 1;         /*!< [4..4] APCLK Error Status                                                 */
      __IM  uint32_t            : 3;
      __IM  uint32_t APCLK2STS  : 2;            /*!< [9..8] Analog Peripherals Clock Status                                    */
      __IM  uint32_t            : 6;
      __IM  uint32_t APCLK3STS  : 1;            /*!< [16..16] Loss of Clock Status                                             */
      __IM  uint32_t            : 3;
      __IM  uint32_t BRDRV_CLK_ERR_STS : 1;     /*!< [20..20] BRDRV CLK Error Status                                           */
      __IM  uint32_t            : 3;
      __IM  uint32_t PLL_LOCK   : 1;            /*!< [24..24] PLL LOCK Status                                                  */
    } bit;
  } APCLK_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000060) Peripheral Management Control Register                     */
    
    struct {
      __IOM uint32_t ADC1_DIS   : 1;            /*!< [0..0] ADC1 Disable Request. Active high.                                 */
      __IOM uint32_t SSC1_DIS   : 1;            /*!< [1..1] SSC Disable Request. Active high.                                  */
      __IOM uint32_t CCU_DIS    : 1;            /*!< [2..2] CCU Disable Request. Active high.                                  */
      __IOM uint32_t T2_DIS     : 1;            /*!< [3..3] T2 Disable Request. Active high.                                   */
      __IOM uint32_t GPT12_DIS  : 1;            /*!< [4..4] General Purpose Timer 12 Disable Request. Active high.             */
      __IM  uint32_t            : 3;
      __IOM uint32_t SSC2_DIS   : 1;            /*!< [8..8] SSC Disable Request. Active high.                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t T21_DIS    : 1;            /*!< [10..10] T21 Disable Request. Active high.                                */
    } bit;
  } PMCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000064) Analog Peripheral Clock Status Clear Register              */
    
