Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __OM  uint32_t APCLK1SCLR : 1;            /*!< [0..0] Analog Peripherals Clock Status Clear                              */
      __IM  uint32_t            : 7;
      __OM  uint32_t APCLK2SCLR : 1;            /*!< [8..8] Analog Peripherals Clock Status Clear                              */
      __IM  uint32_t            : 7;
      __OM  uint32_t APCLK3SCLR : 1;            /*!< [16..16] Analog Peripherals Clock 3 Status Clear                          */
    } bit;
  } APCLK_SCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000068) Reset Control Register                                     */
    
    struct {
      __IOM uint32_t LOCKUP     : 1;            /*!< [0..0] Lockup Flag                                                        */
      __IM  uint32_t            : 6;
      __IOM uint32_t LOCKUP_EN  : 1;            /*!< [7..7] Lockup Reset Enable Flag                                           */
    } bit;
  } RSTCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000006C) ADC1 Peripheral Clock Register                             */
    
    struct {
      __IOM uint32_t ADC1_CLK_DIV : 4;          /*!< [3..0] ADC1 Clock divider                                                 */
      __IM  uint32_t            : 4;
      __IOM uint32_t DPP1_CLK_DIV : 2;          /*!< [9..8] ADC1 Post processing clock divider                                 */
    } bit;
  } ADC1_CLK;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000070) System Control Register 0                                  */
    
    struct {
      __IM  uint32_t            : 4;
      __IM  uint32_t NVMCLKFAC  : 2;            /*!< [5..4] NVM Access Clock Factor                                            */
      __IOM uint32_t SYSCLKSEL  : 2;            /*!< [7..6] System Clock Select                                                */
    } bit;
  } SYSCON0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000074) System Startup Status Register                             */
    
    struct {
      __IOM uint32_t PLL_LOCK_STS : 1;          /*!< [0..0] PLL LOCK STATUS                                                    */
      __IOM uint32_t MRAMINITSTS : 1;           /*!< [1..1] Map RAM Initialisation Status                                      */
      __IOM uint32_t PG100TP_CHKS_ERR : 1;      /*!< [2..2] 100 TP Page Checksum Error                                         */
    } bit;
  } SYS_STRTUP_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000078) Watchdog Timer Reload Register                             */
    
    struct {
      __IOM uint32_t WDTREL     : 8;            /*!< [7..0] Watchdog Timer Reload Value                                        */
    } bit;
  } WDTREL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000007C) Watchdog Window-Boundary Count                             */
    
    struct {
      __IOM uint32_t WDTWINB    : 8;            /*!< [7..0] Watchdog Window-Boundary Count Value                               */
    } bit;
  } WDTWINB;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000080) Watchdog Timer                                             */
    
    struct {
      __IM  uint32_t WDT        : 16;           /*!< [15..0] Watchdog Timer Current Value                                      */
    } bit;
  } WDT;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000088) Baud Rate Control Register 1                               */
    
    struct {
      __IOM uint32_t BR1_R      : 1;            /*!< [0..0] Baud Rate Generator Run Control Bit                                */
      __IOM uint32_t BR1_PRE    : 3;            /*!< [3..1] Prescaler Bit                                                      */
    } bit;
  } BCON1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000008C) Baud Rate Timer/Reload Register, Low Byte 1                */
    
    struct {
      __IOM uint32_t BG1_FD_SEL : 5;            /*!< [4..0] Fractional Divider Selection                                       */
    } bit;
  } BGL1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000090) Baud Rate Timer/Reload Register                            */
    
    struct {
      __IOM uint32_t BG1_BR_VALUE : 11;         /*!< [10..0] Baud Rate Reload Value                                            */
      __IM  uint32_t            : 5;
      __IM  uint32_t BG1_TIM_VALUE : 11;        /*!< [26..16] Baud Rate Timer Value                                            */
    } bit;
  } BG1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000094) LIN Status Register                                        */
    
    struct {
      __IOM uint32_t BRDIS      : 1;            /*!< [0..0] Baud Rate Detection Disable                                        */
      __IOM uint32_t BGSEL      : 2;            /*!< [2..1] Baud Rate Select for Detection                                     */
      __IM  uint32_t BRK        : 1;            /*!< [3..3] Break Field Flag                                                   */
      __IM  uint32_t EOFSYN     : 1;            /*!< [4..4] End of SYN Byte Interrupt Flag                                     */
      __IM  uint32_t ERRSYN     : 1;            /*!< [5..5] SYN Byte Error Interrupt Flag                                      */
      __IOM uint32_t SYNEN      : 1;            /*!< [6..6] End of SYN Byte and SYN Byte Error Interrupts Enable               */
    } bit;
  } LINST;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000098) Baud Rate Control Register 2                               */
    
    struct {
      __IOM uint32_t BR2_R      : 1;            /*!< [0..0] Baud Rate Generator Run Control Bit                                */
      __IOM uint32_t BR2_PRE    : 3;            /*!< [3..1] Prescaler Bit                                                      */
    } bit;
  } BCON2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000009C) Baud Rate Timer/Reload Register, Low Byte 2                */
    
