Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t BG2_FD_SEL : 5;            /*!< [4..0] Fractional Divider Selection                                       */
    } bit;
  } BGL2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A0) Baud Rate Timer/Reload Register                            */
    
    struct {
      __IOM uint32_t BG2_BR_VALUE : 11;         /*!< [10..0] Baud Rate Reload Value                                            */
      __IM  uint32_t            : 5;
      __IM  uint32_t BG2_TIM_VALUE : 11;        /*!< [26..16] Baud Rate Timer Value                                            */
    } bit;
  } BG2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A4) LIN Status Clear Register                                  */
    
    struct {
      __IM  uint32_t            : 3;
      __OM  uint32_t BRKC       : 1;            /*!< [3..3] Break Field Flag Clear                                             */
      __OM  uint32_t EOFSYNC    : 1;            /*!< [4..4] End of SYN Byte Interrupt Flag Clear                               */
      __OM  uint32_t ERRSYNC    : 1;            /*!< [5..5] SYN Byte Error Interrupt Flag                                      */
    } bit;
  } LINSCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000A8) Identity Register                                          */
    
    struct {
      __IM  uint32_t VERID      : 3;            /*!< [2..0] Version ID                                                         */
      __IM  uint32_t PRODID     : 5;            /*!< [7..3] Product ID                                                         */
    } bit;
  } ID;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000AC) Password Register                                          */
    
    struct {
      __IOM uint32_t PW_MODE    : 2;            /*!< [1..0] Bit-Protection Scheme Control Bit                                  */
      __IM  uint32_t PROTECT_S  : 1;            /*!< [2..2] Bit-Protection Signal Status Bit                                   */
      __IOM uint32_t PASS       : 5;            /*!< [7..3] Password Bits                                                      */
    } bit;
  } PASSWD;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B0) OSC Control Register                                       */
    
    struct {
      __IOM uint32_t OSCSS      : 2;            /*!< [1..0] Oscillator Source Select                                           */
      __IOM uint32_t OSCWDTRST  : 1;            /*!< [2..2] Oscillator Watchdog Reset                                          */
      __IM  uint32_t OSC2L      : 1;            /*!< [3..3] OSC-Too-Low Condition Flag                                         */
      __IOM uint32_t XPD        : 1;            /*!< [4..4] XTAL (OSC_HP) Power Down Control                                   */
    } bit;
  } OSC_CON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B4) Clock Output Control Register                              */
    
    struct {
      __IOM uint32_t COREL      : 4;            /*!< [3..0] Clock Output Divider                                               */
      __IOM uint32_t COUTS0     : 1;            /*!< [4..4] Clock Out Source Select Bit 0                                      */
      __IOM uint32_t TLEN       : 1;            /*!< [5..5] Toggle Latch Enable                                                */
      __IOM uint32_t COUTS1     : 1;            /*!< [6..6] Clock Out Source Select Bit 1                                      */
      __IOM uint32_t EN         : 1;            /*!< [7..7] CLKOUT Enable                                                      */
    } bit;
  } COCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000B8) Peripheral Input Select Register                           */
    
    struct {
      __IOM uint32_t EXINT0IS   : 2;            /*!< [1..0] External Interrupt 0 Input Select                                  */
      __IOM uint32_t EXINT1IS   : 2;            /*!< [3..2] External Interrupt 1 Input Select                                  */
      __IOM uint32_t EXINT2IS   : 2;            /*!< [5..4] External Interrupt 2 Input Select                                  */
      __IOM uint32_t URIOS1     : 1;            /*!< [6..6] UART1 Input/Output Select                                          */
      __IOM uint32_t U_TX_CONDIS : 1;           /*!< [7..7] UART1 TxD Connection Disable                                       */
      __IM  uint32_t            : 8;
      __IOM uint32_t SSC12_M_SCK_OUTSEL : 1;    /*!< [16..16] Output selection for SSC12_M_SCK                                 */
      __IOM uint32_t SSC12_M_MTSR_OUTSEL : 1;   /*!< [17..17] Output selection for SSC12_M_MTSR                                */
      __IOM uint32_t SSC12_S_MRST_OUTSEL : 1;   /*!< [18..18] Output selection for SSC12_S_MRST                                */
    } bit;
  } MODPISEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000BC) Peripheral Input Select Register 1                         */
    
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t T2EXCON    : 1;            /*!< [6..6] Timer 2 External Input Control                                     */
      __IOM uint32_t T21EXCON   : 1;            /*!< [7..7] Timer 21 External Input Control                                    */
    } bit;
  } MODPISEL1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C0) Peripheral Input Select Register 2                         */
    
    struct {
      __IOM uint32_t T2IS       : 2;            /*!< [1..0] Timer 2 Input Select                                               */
      __IOM uint32_t T21IS      : 2;            /*!< [3..2] Timer 21 Input Select                                              */
      __IOM uint32_t T2EXIS     : 2;            /*!< [5..4] Timer 2 External Input Select                                      */
      __IOM uint32_t T21EXIS    : 2;            /*!< [7..6] Timer 21 External Input Select                                     */
      __IOM uint32_t T2EXISCNF  : 2;            /*!< [9..8] Timer 2 External Input Select Configuration                        */
      __IOM uint32_t T21EXISCNF : 2;            /*!< [11..10] Timer 21 External Input Select Configuration                     */
    } bit;
  } MODPISEL2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C4) Peripheral Input Select Register 3                         */
    
