Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IM  uint32_t            : 6;
      __IOM uint32_t URIOS2     : 1;            /*!< [6..6] UART2 Input/Output Select                                          */
    } bit;
  } MODPISEL3;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000C8) Module Suspend Control Register                            */
    
    struct {
      __IOM uint32_t WDTSUSP    : 1;            /*!< [0..0] SCU Watchdog Timer Debug Suspend Bit                               */
      __IOM uint32_t T12SUSP    : 1;            /*!< [1..1] Timer 12 Debug Suspend Bit                                         */
      __IOM uint32_t T13SUSP    : 1;            /*!< [2..2] Timer 13 Debug Suspend Bit                                         */
      __IOM uint32_t T2_SUSP    : 1;            /*!< [3..3] Timer2 Debug Suspend Bit                                           */
      __IOM uint32_t GPT12_SUSP : 1;            /*!< [4..4] GPT12 Debug Suspend Bit                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t T21_SUSP   : 1;            /*!< [6..6] Timer21 Debug Suspend Bit                                          */
      __IOM uint32_t WDT1SUSP   : 1;            /*!< [7..7] Watchdog Timer 1 Debug Suspend Bit                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t MU_SUSP    : 1;            /*!< [9..9] Measurement Unit Debug Suspend Bit                                 */
      __IOM uint32_t ADC1_SUSP  : 1;            /*!< [10..10] ADC1 Unit Debug Suspend Bit                                      */
    } bit;
  } MODSUSP;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D0) GPT12 Peripheral Input Select Register                     */
    
    struct {
      __IOM uint32_t GPT12      : 4;            /*!< [3..0] GPT12 TIN3B / TIN4D Input Select                                   */
      __IOM uint32_t TRIG_CONF  : 1;            /*!< [4..4] CCU6 Trigger Configuration.                                        */
      __IOM uint32_t GPT12_SEL  : 1;            /*!< [5..5] CCU6 Trigger Configuration.                                        */
    } bit;
  } GPT12PISEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D4) Error Detection and Correction Control Register            */
    
    struct {
      __IOM uint32_t RIE        : 1;            /*!< [0..0] RAM Double Bit ECC Error Interrupt Enable                          */
      __IM  uint32_t            : 1;
      __IOM uint32_t NVMIE      : 1;            /*!< [2..2] NVM Double Bit ECC Error Interrupt Enable                          */
    } bit;
  } EDCCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000D8) Error Detection and Correction Status Register             */
    
    struct {
      __IM  uint32_t RDBE       : 1;            /*!< [0..0] RAM Double Bit Error                                               */
      __IM  uint32_t            : 1;
      __IM  uint32_t NVMDBE     : 1;            /*!< [2..2] NVM Double Bit Error                                               */
      __IM  uint32_t            : 1;
      __IM  uint32_t RSBE       : 1;            /*!< [4..4] RAM Single Bit Error                                               */
    } bit;
  } EDCSTAT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000DC) Memory Status Register                                     */
    
    struct {
      __IOM uint32_t SECTORINFO : 6;            /*!< [5..0] Sector Information                                                 */
      __IOM uint32_t SASTATUS   : 2;            /*!< [7..6] Service Algorithm Status                                           */
      __IM  uint32_t            : 8;
      __IOM uint32_t NVM_VAL_KEYS : 2;          /*!< [17..16] NVM valid keys                                                   */
      __IOM uint32_t NVM_DATA_MODE : 1;         /*!< [18..18] NVM Data Mode                                                    */
      __IM  uint32_t            : 1;
      __IOM uint32_t RAM_VAL_KEYS : 2;          /*!< [21..20] RAM valid keys                                                   */
      __IOM uint32_t RAM_TEST_MODE : 1;         /*!< [22..22] RAM Data Mode                                                    */
    } bit;
  } MEMSTAT;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E0) NVM Protection Status Register                             */
    
    struct {
      __IM  uint32_t EN_RD_CUS_BSL : 1;         /*!< [0..0] NVM Read Protection of Data in Customer BSL Region                 */
      __IM  uint32_t EN_PRG_CUS_BSL : 1;        /*!< [1..1] NVM Protection of Data in Customer BSL Region                      */
      __IM  uint32_t EN_RD_COD_LIN : 1;         /*!< [2..2] NVM Read Protection of Data in Linear Code Sectors                 */
      __IM  uint32_t EN_PRG_COD_LIN : 1;        /*!< [3..3] NVM Protection of Data in Linear Code Sectors                      */
      __IM  uint32_t EN_RD_DAT_LIN : 1;         /*!< [4..4] NVM Read Protection of Data in Linear Data Sectors                 */
      __IM  uint32_t EN_PRG_DAT_LIN : 1;        /*!< [5..5] NVM Protection of Data in Linear Data Sectors                      */
      __IM  uint32_t EN_RD_DAT_NL : 1;          /*!< [6..6] NVM Read Protection of Data in Non-Linear Data Sectors             */
      __IM  uint32_t EN_PRG_DAT_NL : 1;         /*!< [7..7] NVM Protection of Data in Non-Linear Data Sectors                  */
      __IM  uint32_t            : 8;
      __IM  uint32_t EN_RD_S0   : 1;            /*!< [16..16] NVM Read Protection for Sector 0                                 */
      __IM  uint32_t DIS_RDUS   : 1;            /*!< [17..17] Configuration of NVM Read Protection for Sector 1...n
                                                     with EN_RD_* = 0                                                          */
      __IM  uint32_t DIS_RDUS_S0 : 1;           /*!< [18..18] Configuration of NVM Read Protection for Sector 0 with
                                                     EN_RD_S0 = 0                                                              */
      __IM  uint32_t CUS_BSL_PW : 1;            /*!< [19..19] Status of CBSL Region Password / Protection                      */
      __IM  uint32_t COD_LIN_PW : 1;            /*!< [20..20] Status of Linear Region Password / Protection                    */
      __IM  uint32_t DAT_LIN_PW : 1;            /*!< [21..21] Status of Data linear Region Password / Protection               */
      __IM  uint32_t DAT_NL_PW  : 1;            /*!< [22..22] Status of Non-Linear Region Password / Protection                */
      __IM  uint32_t            : 1;
      __IM  uint32_t CUS_BSL_SIZE : 2;          /*!< [25..24] CBSL Region Size Definition                                      */
      __IM  uint32_t DAT_LIN_SIZE : 2;          /*!< [27..26] Data linear Region Size Definition                               */
    } bit;
  } NVM_PROT_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E4) Memory Access Status Register                              */
    
