Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IM  uint32_t NVM_PROT_ERR : 1;          /*!< [0..0] NVM Access Protection                                              */
      __IM  uint32_t NVM_ADDR_ERR : 1;          /*!< [1..1] NVM Address Protection                                             */
      __IM  uint32_t NVM_SFR_PROT_ERR : 1;      /*!< [2..2] NVM SFR Access Protection                                          */
      __IM  uint32_t NVM_SFR_ADDR_ERR : 1;      /*!< [3..3] NVM SFR Address Protection                                         */
      __IM  uint32_t ROM_PROT_ERR : 1;          /*!< [4..4] ROM Access Protection                                              */
    } bit;
  } MEM_ACC_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000E8) Port Output Control Register                               */
    
    struct {
      __IOM uint32_t P0_PDM0    : 3;            /*!< [2..0] P0.0 Port Driver Mode                                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t P0_PDM1    : 3;            /*!< [6..4] P0.1 Port Driver Mode                                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t P0_PDM2    : 3;            /*!< [10..8] P0.2 Port Driver Mode                                             */
      __IM  uint32_t            : 1;
      __IOM uint32_t P0_PDM3    : 3;            /*!< [14..12] P0.3 Port Driver Mode                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t P0_PDM4    : 3;            /*!< [18..16] P0.4 Port Driver Mode                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t P0_PDM5    : 3;            /*!< [22..20] P0.5 Port Driver Mode                                            */
      __IM  uint32_t            : 1;
      __IOM uint32_t P0_PDM6    : 3;            /*!< [26..24] P0.6 Port Driver Mode                                            */
    } bit;
  } P0_POCON0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000EC) Wakeup Interrupt Control Register                          */
    
    struct {
      __IOM uint32_t WAKEUPEN   : 1;            /*!< [0..0] Wakeup Interrupt Enable                                            */
    } bit;
  } WAKECON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F0) Interrupt Request Register 5                               */
    
    struct {
      __IM  uint32_t WAKEUP     : 1;            /*!< [0..0] Interrupt Flag for Wakeup                                          */
    } bit;
  } IRCON5;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F4) Temperature Compensation Control Register                  */
    
    struct {
      __IOM uint32_t TCC        : 2;            /*!< [1..0] Temperature Compensation Control                                   */
    } bit;
  } TCCR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000F8) Port Output Control Register                               */
    
    struct {
      __IOM uint32_t P1_PDM0    : 3;            /*!< [2..0] P1.0 Port Driver Mode                                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t P1_PDM1    : 3;            /*!< [6..4] P1.1 Port Driver Mode                                              */
      __IM  uint32_t            : 1;
      __IOM uint32_t P1_PDM2    : 3;            /*!< [10..8] P1.2 Port Driver Mode                                             */
      __IM  uint32_t            : 5;
      __IOM uint32_t P1_PDM4    : 3;            /*!< [18..16] P1.4 Port Driver Mode                                            */
    } bit;
  } P1_POCON0;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x000000FC) Peripheral Input Select Register 4                         */
    
    struct {
      __IOM uint32_t DU1TRIGGEN : 3;            /*!< [2..0] Differential Unit Trigger Enable                                   */
      __IM  uint32_t            : 5;
      __IOM uint32_t DU2TRIGGEN : 3;            /*!< [10..8] Differential Unit Trigger Enable                                  */
      __IM  uint32_t            : 5;
      __IOM uint32_t DU3TRIGGEN : 3;            /*!< [18..16] Differential Unit Trigger Enable                                 */
      __IM  uint32_t            : 5;
      __IOM uint32_t DU4TRIGGEN : 3;            /*!< [26..24] Differential Unit Trigger Enable                                 */
    } bit;
  } MODPISEL4;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000100) Peripheral Input Select Register                           */
    
    struct {
      __IOM uint32_t XTAL12EN   : 1;            /*!< [0..0] Pins XTAL1/2 Enable Bit                                            */
      __IOM uint32_t XTALHYSEN  : 1;            /*!< [1..1] XTAL Hysteresis Enable                                             */
      __IM  uint32_t            : 2;
      __IOM uint32_t XTALHYSCTRL : 2;           /*!< [5..4] XTAL Hysteresis Control                                            */
    } bit;
  } XTAL_CTRL;
  __IM  uint32_t  RESERVED2[2];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000010C) Error Detection and Correction Status Clear Register       */
    
    struct {
      __OM  uint32_t RDBEC      : 1;            /*!< [0..0] RAM Double Bit Error Clear                                         */
      __IM  uint32_t            : 1;
      __OM  uint32_t NVMDBEC    : 1;            /*!< [2..2] NVM Double Bit Error Clear                                         */
      __IM  uint32_t            : 1;
      __OM  uint32_t RSBEC      : 1;            /*!< [4..4] RAM Single Bit Error Clear                                         */
    } bit;
  } EDCSCLR;
  __IM  uint32_t  RESERVED3[7];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000012C) Stack Overflow Status Clear Register                       */
    
