Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __OM  uint32_t STOF_STSC  : 1;            /*!< [0..0] Clear Stack Overflow Status                                        */
    } bit;
  } STACK_OVFCLR;
  __IM  uint32_t  RESERVED4[5];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000144) Stack Overflow Control Register                            */
    
    struct {
      __IOM uint32_t STOF_EN    : 1;            /*!< [0..0] Stack Overflow Enable                                              */
    } bit;
  } STACK_OVF_CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000148) Stack Overflow Control Register                            */
    
    struct {
      __IM  uint32_t            : 2;
      __IOM uint32_t STOF_ADDR_OFF_L : 10;      /*!< [11..2] Stack Overflow Low Address Offset                                 */
      __IM  uint32_t            : 6;
      __IOM uint32_t STOF_ADDR_OFF_H : 10;      /*!< [27..18] Stack Overflow High Address Offset                               */
    } bit;
  } STACK_OVF_ADDR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000014C) Stack Overflow Status Register                             */
    
    struct {
      __IOM uint32_t STOF_STS   : 1;            /*!< [0..0] Stack Overflow Status                                              */
    } bit;
  } STACK_OVF_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000150) ADC1 Peripheral Clock Register                             */
    
    struct {
      __IOM uint32_t BRDRV_CLK_DIV : 2;         /*!< [1..0] Analog Module Clock Factorf                                        */
      __IM  uint32_t            : 6;
      __IOM uint32_t BRDRV_TFILT_DIV : 5;       /*!< [12..8] Slow Down Clock Divider for TFILT_CLK Generation                  */
    } bit;
  } BRDRV_CLK;
  __IM  uint32_t  RESERVED5[2];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000015C) General Purpose Timer 12 Interrupt Enable Register         */
    
    struct {
      __IOM uint32_t T2IE       : 1;            /*!< [0..0] General Purpose Timer 12 T2 Interrupt Enable                       */
      __IOM uint32_t T3IE       : 1;            /*!< [1..1] General Purpose Timer 12 T3 Interrupt Enable                       */
      __IOM uint32_t T4IE       : 1;            /*!< [2..2] General Purpose Timer 12 T4 Interrupt Enable                       */
      __IOM uint32_t T5IE       : 1;            /*!< [3..3] General Purpose Timer 12 T5 Interrupt Enable                       */
      __IOM uint32_t T6IE       : 1;            /*!< [4..4] General Purpose Timer 12 T6 Interrupt Enable                       */
      __IOM uint32_t CRIE       : 1;            /*!< [5..5] General Purpose Timer 12 Capture and Reload Interrupt
                                                     Enable                                                                    */
    } bit;
  } GPT12IEN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000160) Timer and Counter Control/Status Register                  */
    
    struct {
      __IM  uint32_t GPT1T2     : 1;            /*!< [0..0] GPT Module 1 Timer 2 Interrupt Status                              */
      __IM  uint32_t GPT1T3     : 1;            /*!< [1..1] GPT Module 1 Timer3 Interrupt Status                               */
      __IM  uint32_t GPT1T4     : 1;            /*!< [2..2] GPT Module 1 Timer4 Interrupt Status                               */
      __IM  uint32_t GPT2T5     : 1;            /*!< [3..3] GPT Module 2 Timer5 Interrupt Status                               */
      __IM  uint32_t GPT2T6     : 1;            /*!< [4..4] GPT Module 2Timer6 Interrupt Status                                */
      __IM  uint32_t GPT12CR    : 1;            /*!< [5..5] GPT Module 1 Capture Reload Interrupt Status                       */
    } bit;
  } GPT12IRC;
  __IM  uint32_t  RESERVED6[5];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000178) Interrupt Request 0 Clear Register                         */
    
    struct {
      __OM  uint32_t EXINT0RC   : 1;            /*!< [0..0] Interrupt Flag for External Interrupt 0x on rising edge            */
      __OM  uint32_t EXINT0FC   : 1;            /*!< [1..1] Interrupt Flag for External Interrupt 0x on falling edge           */
      __OM  uint32_t EXINT1RC   : 1;            /*!< [2..2] Interrupt Flag for External Interrupt 1x on rising edge            */
      __OM  uint32_t EXINT1FC   : 1;            /*!< [3..3] Interrupt Flag for External Interrupt 1x on falling edge           */
      __OM  uint32_t EXINT2RC   : 1;            /*!< [4..4] Interrupt Flag for External Interrupt 2x on rising edge            */
      __OM  uint32_t EXINT2FC   : 1;            /*!< [5..5] Interrupt Flag for External Interrupt 2x on falling edge           */
    } bit;
  } IRCON0CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000017C) Interrupt Request 1 Clear Register                         */
    
    struct {
      __OM  uint32_t MON1RC     : 1;            /*!< [0..0] Interrupt Flag for MON1x on rising edge                            */
      __OM  uint32_t MON1FC     : 1;            /*!< [1..1] Interrupt Flag for MON1x on falling edge                           */
      __OM  uint32_t MON2RC     : 1;            /*!< [2..2] Interrupt Flag for MON2x on rising edge                            */
      __OM  uint32_t MON2FC     : 1;            /*!< [3..3] Interrupt Flag for MON2x on falling edge                           */
      __OM  uint32_t MON3RC     : 1;            /*!< [4..4] Interrupt Flag for MON3x on rising edge                            */
      __OM  uint32_t MON3FC     : 1;            /*!< [5..5] Interrupt Flag for MON3x on falling edge                           */
      __OM  uint32_t MON4RC     : 1;            /*!< [6..6] Interrupt Flag for MON4x on rising edge                            */
      __OM  uint32_t MON4FC     : 1;            /*!< [7..7] Interrupt Flag for MON4x on falling edge                           */
    } bit;
  } IRCON1CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000180) Timer and Counter Control/Status Clear Register            */
    
