Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __OM  uint32_t GPT1T2C    : 1;            /*!< [0..0] GPT Module 1 Timer 2 Interrupt Status                              */
      __OM  uint32_t GPT1T3C    : 1;            /*!< [1..1] GPT Module 1 Timer3 Interrupt Status                               */
      __OM  uint32_t GPT1T4C    : 1;            /*!< [2..2] GPT Module 1 Timer4 Interrupt Status                               */
      __OM  uint32_t GPT2T5C    : 1;            /*!< [3..3] GPT Module 2 Timer5 Interrupt Status                               */
      __OM  uint32_t GPT2T6C    : 1;            /*!< [4..4] GPT Module 2Timer6 Interrupt Status                                */
      __OM  uint32_t GPT12CRC   : 1;            /*!< [5..5] GPT Module 1 Capture Reload Interrupt Status                       */
    } bit;
  } GPT12ICLR;
  __IM  uint32_t  RESERVED7[2];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000018C) Monitoring Input Interrupt Enable Register                 */
    
    struct {
      __IOM uint32_t MON1IE     : 1;            /*!< [0..0] MON 1 Interrupt Enable                                             */
      __IOM uint32_t MON2IE     : 1;            /*!< [1..1] MON 2 Interrupt Enable                                             */
      __IOM uint32_t MON3IE     : 1;            /*!< [2..2] MON 3 Interrupt Enable                                             */
      __IOM uint32_t MON4IE     : 1;            /*!< [3..3] MON 4 Interrupt Enable                                             */
    } bit;
  } MONIEN;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000190) Interrupt Request 2 Clear Register                         */
    
    struct {
      __OM  uint32_t EIR1C      : 1;            /*!< [0..0] Error Interrupt Flag for SSC1                                      */
      __OM  uint32_t TIR1C      : 1;            /*!< [1..1] Transmit Interrupt Flag for SSC1                                   */
      __OM  uint32_t RIR1C      : 1;            /*!< [2..2] Receive Interrupt Flag for SSC1                                    */
    } bit;
  } IRCON2CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000194) Interrupt Request 3 Clear Register                         */
    
    struct {
      __OM  uint32_t EIR2C      : 1;            /*!< [0..0] Error Interrupt Flag for SSC2                                      */
      __OM  uint32_t TIR2C      : 1;            /*!< [1..1] Transmit Interrupt Flag for SSC2                                   */
      __OM  uint32_t RIR2C      : 1;            /*!< [2..2] Receive Interrupt Flag for SSC2                                    */
    } bit;
  } IRCON3CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000198) Interrupt Request 4 Clear Register                         */
    
    struct {
      __OM  uint32_t CCU6SR0C   : 1;            /*!< [0..0] Interrupt Flag 1 for CCU6                                          */
      __IM  uint32_t            : 3;
      __OM  uint32_t CCU6SR1C   : 1;            /*!< [4..4] Interrupt Flag 1 for CCU6                                          */
      __IM  uint32_t            : 11;
      __OM  uint32_t CCU6SR2C   : 1;            /*!< [16..16] Interrupt Flag 1 for CCU6                                        */
      __IM  uint32_t            : 3;
      __OM  uint32_t CCU6SR3C   : 1;            /*!< [20..20] Interrupt Flag 1 for CCU6                                        */
    } bit;
  } IRCON4CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000019C) Interrupt Request 5 Clear Register                         */
    
    struct {
      __OM  uint32_t WAKEUPC    : 1;            /*!< [0..0] Clear Flag for Wakeup Interrupt                                    */
    } bit;
  } IRCON5CLR;
} SCU_Type;                                     /*!< Size = 416 (0x1a0)                                                        */



/* =========================================================================================================================== */
/* ================                                           SCUPM                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief SCUPM (SCUPM)
  */

typedef struct {                                /*!< (@ 0x50006000) SCUPM Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Analog Module Clock Frequency Status Register              */
    
    struct {
      __IM  uint32_t AMCLK1_FREQ : 6;           /*!< [5..0] Current frequency of Analog Module Clock System Clock
                                                     (MI_CLK)                                                                  */
      __IM  uint32_t            : 2;
      __IM  uint32_t AMCLK2_FREQ : 6;           /*!< [13..8] Current frequency of Analog Module Clock 2 (TFILT_CLK)            */
    } bit;
  } AMCLK_FREQ_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Analog Module Clock Control Register                       */
    
    struct {
      __IOM uint32_t CLKWDT_PD_N : 1;           /*!< [0..0] Clock Watchdog Powerdown                                           */
    } bit;
  } AMCLK_CTRL;
  __IM  uint32_t  RESERVED;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Analog Module Clock Limit Register                         */
    
    struct {
      __IOM uint32_t AMCLK1_UP_TH : 6;          /*!< [5..0] Analog Module Clock 1 (MI_CLK) Upper Limit Threshold               */
      __IOM uint32_t AMCLK1_UP_HYS : 2;         /*!< [7..6] Analog Module Clock 1 (MI_CLK) Upper Hysteresis                    */
      __IOM uint32_t AMCLK1_LOW_TH : 6;         /*!< [13..8] Analog Module Clock 1 (MI_CLK) Lower Limit Threshold              */
      __IOM uint32_t AMCLK1_LOW_HYS : 2;        /*!< [15..14] Analog Module Clock 1 (MI_CLK) Lower Hysteresis                  */
      __IOM uint32_t AMCLK2_UP_TH : 6;          /*!< [21..16] Analog Module Clock 2 (TFILT_CLK) Upper Limit Threshold          */
      __IOM uint32_t AMCLK2_UP_HYS : 2;         /*!< [23..22] Analog Module Clock 2 (TFILT_CLK) Upper Hysteresis               */
      __IOM uint32_t AMCLK2_LOW_TH : 6;         /*!< [29..24] Analog Module Clock 2 (TFILT_CLK) Lower Limit Threshold          */
      __IOM uint32_t AMCLK2_LOW_HYS : 2;        /*!< [31..30] Analog Module Clock 2 (TFILT_CLK) Lower Hysteresis               */
    } bit;
  } AMCLK_TH_HYS;
  __IM  uint32_t  RESERVED1;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) System Interrupt Status Clear Register                     */
    
