Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IM  uint32_t            : 8;
      __OM  uint32_t SYS_OTWARN_ISC : 1;        /*!< [8..8] System Overtemperature Prewarning Interrupt Status Clear           */
      __OM  uint32_t SYS_OT_ISC : 1;            /*!< [9..9] System Overtemperature Shutdown Interrupt Status Clear             */
      __IM  uint32_t            : 2;
      __OM  uint32_t VREF1V2_UV_ISC : 1;        /*!< [12..12] 8 Bit ADC2 Reference Undervoltage Interrupt Status
                                                     Clear                                                                     */
      __OM  uint32_t VREF1V2_OV_ISC : 1;        /*!< [13..13] 8 Bit ADC2 Reference Overvoltage Interrupt Status Clear          */
      __IM  uint32_t            : 10;
      __OM  uint32_t SYS_OTWARN_SC : 1;         /*!< [24..24] System Overtemperature Prewarning Status Clear                   */
      __OM  uint32_t SYS_OT_SC  : 1;            /*!< [25..25] System Overtemperature Shutdown Status Clear                     */
      __IM  uint32_t            : 2;
      __OM  uint32_t VREF1V2_UV_SC : 1;         /*!< [28..28] 8 Bit ADC2 Reference Undervoltage Status Clear                   */
      __OM  uint32_t VREF1V2_OV_SC : 1;         /*!< [29..29] 8 Bit ADC2 Reference Overvoltage Status Clear                    */
    } bit;
  } SYS_ISCLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000018) System Interrupt Status Register                           */
    
    struct {
      __IM  uint32_t LIN_FAIL_IS : 1;           /*!< [0..0] LIN Fail Interrupt Status                                          */
      __IM  uint32_t CP_FAIL_IS : 1;            /*!< [1..1] Charge Pump Fail Interrupt Status                                  */
      __IM  uint32_t DRV_FAIL_IS : 1;           /*!< [2..2] Gate Driver Fail Interrupt Status                                  */
      __IM  uint32_t HS_FAIL_IS : 1;            /*!< [3..3] High Side Driver Fail Interrupt Status                             */
      __IM  uint32_t            : 4;
      __IOM uint32_t SYS_OTWARN_IS : 1;         /*!< [8..8] System Overtemperature Prewarning (ADC2, Channel 8) interrupt
                                                     status                                                                    */
      __IOM uint32_t SYS_OT_IS  : 1;            /*!< [9..9] System Overtemperature Shutdown (ADC2, Channel 8) interrupt
                                                     status                                                                    */
      __IM  uint32_t CLKWDT_IS  : 1;            /*!< [10..10] Clock Watchdog Interrupt Status                                  */
      __IM  uint32_t            : 1;
      __IOM uint32_t VREF1V2_UV_IS : 1;         /*!< [12..12] 8 Bit ADC2 Reference Undervoltage (ADC2, Channel 5)
                                                     interrupt status                                                          */
      __IOM uint32_t VREF1V2_OV_IS : 1;         /*!< [13..13] 8 Bit ADC2 Reference Overvoltage (ADC2, Channel 5)
                                                     interrupt status                                                          */
      __IM  uint32_t SYS_SUPPLY_IS : 1;         /*!< [14..14] System Supply Interrupt Status                                   */
      __IM  uint32_t            : 1;
      __IM  uint32_t LIN_FAIL_STS : 1;          /*!< [16..16] LIN Fail Status                                                  */
      __IM  uint32_t CP_FAIL_STS : 1;           /*!< [17..17] Charge Pump Fail Status                                          */
      __IM  uint32_t DRV_FAIL_STS : 1;          /*!< [18..18] Gate Driver Fail Status                                          */
      __IM  uint32_t HS_FAIL_STS : 1;           /*!< [19..19] High Side Driver Fail Status                                     */
      __IM  uint32_t            : 4;
      __IOM uint32_t SYS_OTWARN_STS : 1;        /*!< [24..24] System Overtemperature Prewarning (ADC2, Channel 6)
                                                     status                                                                    */
      __IOM uint32_t SYS_OT_STS : 1;            /*!< [25..25] System Overtemperature Shutdown (ADC2, Channel 6) status         */
      __IM  uint32_t            : 2;
      __IOM uint32_t VREF1V2_UV_STS : 1;        /*!< [28..28] 8 Bit ADC2 Reference Undervoltage (ADC2, Channel 5)
                                                     interrstatus                                                              */
      __IOM uint32_t VREF1V2_OV_STS : 1;        /*!< [29..29] 8 Bit ADC2 Reference Overvoltage (ADC2, Channel 5)
                                                     interrupt status                                                          */
      __IM  uint32_t SYS_SUPPLY_STS : 1;        /*!< [30..30] System Supply Status                                             */
    } bit;
  } SYS_IS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) System Supply Interrupt Status Register                    */
    
    struct {
      __IOM uint32_t VS_UV_IS   : 1;            /*!< [0..0] VS Undervoltage Interrupt Status (ADC2 channel 0)                  */
      __IM  uint32_t            : 2;
      __IOM uint32_t VDDEXT_UV_IS : 1;          /*!< [3..3] VDDEXT Undervoltage Interrupt Status (ADC2 channel 3)              */
      __IOM uint32_t VDD5V_UV_IS : 1;           /*!< [4..4] VDDP Undervoltage Interrupt Status (ADC2 channel 4)                */
      __IM  uint32_t            : 1;
      __IOM uint32_t VDD1V5_UV_IS : 1;          /*!< [6..6] VDDC Undervoltage Interrupt Status (ADC2 channel 6)                */
      __IM  uint32_t            : 1;
      __IOM uint32_t VS_OV_IS   : 1;            /*!< [8..8] VS Overvoltage Interrupt Status (ADC2 channel 0)                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t VDDEXT_OV_IS : 1;          /*!< [11..11] VDDEXT Overvoltage Interrupt Status (ADC2 channel 3)             */
      __IOM uint32_t VDD5V_OV_IS : 1;           /*!< [12..12] VDDP Overvoltage Interrupt Status (ADC2 channel 4)               */
      __IM  uint32_t            : 1;
      __IOM uint32_t VDD1V5_OV_IS : 1;          /*!< [14..14] VDDC Overvoltage Interrupt Status (ADC2 channel 6)               */
      __IM  uint32_t            : 1;
      __IOM uint32_t VS_UV_STS  : 1;            /*!< [16..16] VS Undervoltage Status (ADC2 channel 0)                          */
      __IM  uint32_t            : 2;
      __IOM uint32_t VDDEXT_UV_STS : 1;         /*!< [19..19] VDDEXT Undervoltage Status (ADC2 channel 3)                      */
      __IOM uint32_t VDD5V_UV_STS : 1;          /*!< [20..20] VDDP Undervoltage Status (ADC2 channel 4)                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t VDD1V5_UV_STS : 1;         /*!< [22..22] VDDC Undervoltage Status (ADC2 channel 6)                        */
      __IM  uint32_t            : 1;
      __IOM uint32_t VS_OV_STS  : 1;            /*!< [24..24] VS Overvoltage Status (ADC2 channel 0)                           */
      __IM  uint32_t            : 2;
      __IOM uint32_t VDDEXT_OV_STS : 1;         /*!< [27..27] VDDEXT Overvoltage Status (ADC2 channel 3)                       */
      __IOM uint32_t VDD5V_OV_STS : 1;          /*!< [28..28] VDDP Overvoltage Status (ADC2 channel 4)                         */
      __IM  uint32_t            : 1;
      __IOM uint32_t VDD1V5_OV_STS : 1;         /*!< [30..30] VDDC Overvoltage Status (ADC2 channel 6)                         */
    } bit;
  } SYS_SUPPLY_IRQ_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000020) System Supply Interrupt Control Register                   */
    
