Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t VS_UV_IE   : 1;            /*!< [0..0] VS Undervoltage Interrupt Enable                                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t VDDEXT_UV_IE : 1;          /*!< [3..3] VDDEXT Undervoltage Interrupt Enable                               */
      __IOM uint32_t VDD5V_UV_IE : 1;           /*!< [4..4] VDDP Undervoltage Interrupt Enable                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t VDD1V5_UV_IE : 1;          /*!< [6..6] VDDC Undervoltage Interrupt Enable                                 */
      __IM  uint32_t            : 1;
      __IOM uint32_t VS_OV_IE   : 1;            /*!< [8..8] VS Overvoltage Interrupt Enable                                    */
      __IM  uint32_t            : 2;
      __IOM uint32_t VDDEXT_OV_IE : 1;          /*!< [11..11] VDDEXT Overvoltage Interrupt Enable                              */
      __IOM uint32_t VDD5V_OV_IE : 1;           /*!< [12..12] VDDP Overvoltage Interrupt Enable                                */
      __IM  uint32_t            : 1;
      __IOM uint32_t VDD1V5_OV_IE : 1;          /*!< [14..14] VDDC Overvoltage Interrupt Enable                                */
    } bit;
  } SYS_SUPPLY_IRQ_CTRL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000024) System Supply Interrupt Status Clear Register              */
    
    struct {
      __OM  uint32_t VS_UV_ISC  : 1;            /*!< [0..0] VS Undervoltage Interrupt Status clear                             */
      __IM  uint32_t            : 2;
      __OM  uint32_t VDDEXT_UV_ISC : 1;         /*!< [3..3] VDDEXT Undervoltage Interrupt Status clear                         */
      __OM  uint32_t VDD5V_UV_ISC : 1;          /*!< [4..4] VDDP Undervoltage Interrupt Status clear                           */
      __IM  uint32_t            : 1;
      __OM  uint32_t VDD1V5_UV_ISC : 1;         /*!< [6..6] VDDC Undervoltage Interrupt Status clear                           */
      __IM  uint32_t            : 1;
      __OM  uint32_t VS_OV_ISC  : 1;            /*!< [8..8] VS Overvoltage Interrupt Status clear                              */
      __IM  uint32_t            : 2;
      __OM  uint32_t VDDEXT_OV_ISC : 1;         /*!< [11..11] VDDEXT Overvoltage Interrupt Status clear                        */
      __OM  uint32_t VDD5V_OV_ISC : 1;          /*!< [12..12] VDDP Overvoltage Interrupt Status clear                          */
      __IM  uint32_t            : 1;
      __OM  uint32_t VDD1V5_OV_ISC : 1;         /*!< [14..14] VDDC Overvoltage Interrupt Status clear                          */
      __IM  uint32_t            : 1;
      __OM  uint32_t VS_UV_SC   : 1;            /*!< [16..16] VS Undervoltage Status clear                                     */
      __IM  uint32_t            : 2;
      __OM  uint32_t VDDEXT_UV_SC : 1;          /*!< [19..19] VDDEXT Undervoltage Status clear                                 */
      __OM  uint32_t VDD5V_UV_SC : 1;           /*!< [20..20] VDDP Undervoltage Status clear                                   */
      __IM  uint32_t            : 1;
      __OM  uint32_t VDD1V5_UV_SC : 1;          /*!< [22..22] VDDC Undervoltage Status clear                                   */
      __IM  uint32_t            : 1;
      __OM  uint32_t VS_OV_SC   : 1;            /*!< [24..24] VS Overvoltage Status clear                                      */
      __IM  uint32_t            : 2;
      __OM  uint32_t VDDEXT_OV_SC : 1;          /*!< [27..27] VDDEXT Overvoltage Status clear                                  */
      __OM  uint32_t VDD5V_OV_SC : 1;           /*!< [28..28] VDDP Overvoltage Status clear                                    */
      __IM  uint32_t            : 1;
      __OM  uint32_t VDD1V5_OV_SC : 1;          /*!< [30..30] VDDC Overvoltage Status clear                                    */
    } bit;
  } SYS_SUPPLY_IRQ_CLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000028) System Interrupt Control Register                          */
    
    struct {
      __IM  uint32_t            : 8;
      __IOM uint32_t SYS_OTWARN_IE : 1;         /*!< [8..8] System Overtemperature Prewarning Interrupt Enable                 */
      __IOM uint32_t SYS_OT_IE  : 1;            /*!< [9..9] System Overtemperature Shutdown Interrupt Enable                   */
      __IM  uint32_t            : 2;
      __IOM uint32_t VREF1V2_UV_IE : 1;         /*!< [12..12] 8 Bit ADC2 Reference Undervoltage Interrupt Enable               */
      __IOM uint32_t VREF1V2_OV_IE : 1;         /*!< [13..13] 8 Bit ADC2 Reference Overvoltage Interrupt Enable                */
    } bit;
  } SYS_IRQ_CTRL;
  __IM  uint32_t  RESERVED2;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000030) Power Control Unit Control Status Register                 */
    
    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t CLKWDT_SD_DIS : 1;         /*!< [1..1] Power Modules Clock Watchdog Shutdown Disable                      */
      __IM  uint32_t            : 5;
      __IOM uint32_t FAIL_PS_DIS : 1;           /*!< [7..7] Disable LIN Tx and HS and because of Overtemperature
                                                     Warning or VS OV/UV                                                       */
      __IOM uint32_t LIN_VS_UV_SD_DIS : 1;      /*!< [8..8] LIN Module VS Undervoltage Transmitter Shutdown                    */
      __IM  uint32_t            : 4;
      __IOM uint32_t SYS_VS_UV_SLM_DIS : 1;     /*!< [13..13] VS Undervoltage Shutdown for Peripherals Disable                 */
      __IOM uint32_t SYS_VS_OV_SLM_DIS : 1;     /*!< [14..14] VS Overvoltage Shutdown for Peripherals Disable                  */
      __IM  uint32_t            : 9;
      __IOM uint32_t SYS_OTWARN_PS_DIS : 1;     /*!< [24..24] System Overtemperature Warning Power Switches Shutdown
                                                     Disable                                                                   */
      __IOM uint32_t CLKLOSS_SD_DIS : 1;        /*!< [25..25] System Loss of Clock Shutdown Disable (AMCLK3)                   */
      __IOM uint32_t CLKWDT_RES_SD_DIS : 1;     /*!< [26..26] Clock Watchdog Reset Disable                                     */
      __IOM uint32_t CLKLOSS_RES_SD_DIS : 1;    /*!< [27..27] Loss of Clock Reset Disable                                      */
    } bit;
  } PCU_CTRL_STS;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000034) WDT1 Watchdog Control Register                             */
    
