Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IOM uint32_t WDP_SEL    : 6;            /*!< [5..0] Watchdog Period Selection and trigger                              */
      __IOM uint32_t SOWCONF    : 2;            /*!< [7..6] Short Open Window Configuration                                    */
    } bit;
  } WDT1_TRIG;
  __IM  uint32_t  RESERVED3[13];
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000006C) System Tick Calibration Register                           */
    
    struct {
      __IOM uint32_t STCALIB    : 26;           /*!< [25..0] System Tick Calibration                                           */
    } bit;
  } STCALIB;
} SCUPM_Type;                                   /*!< Size = 112 (0x70)                                                         */



/* =========================================================================================================================== */
/* ================                                           SSC1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SSC1 (SSC1)
  */

typedef struct {                                /*!< (@ 0x48024000) SSC1 Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Port Input Select Register                                 */
    
    struct {
      __IOM uint32_t MIS_0      : 1;            /*!< [0..0] Master Mode Input Select Bit 0 (Master Mode only)                  */
      __IOM uint32_t SIS        : 1;            /*!< [1..1] Slave Mode Input Select (Slave Mode only)                          */
      __IOM uint32_t CIS        : 1;            /*!< [2..2] Clock Input Select (Slave Mode only)                               */
      __IOM uint32_t MIS_1      : 1;            /*!< [3..3] Master Mode Input Select Bit 1 (Master Mode only)                  */
      __IOM uint32_t GIS        : 1;            /*!< [4..4] Global SSC12 Input Select                                          */
    } bit;
  } PISEL;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Control Register                                           */
    
    struct {
      __IOM uint32_t BM         : 4;            /*!< [3..0] Data Width Selection                                               */
      __IOM uint32_t HB         : 1;            /*!< [4..4] Heading Control                                                    */
      __IOM uint32_t PH         : 1;            /*!< [5..5] Clock Phase Control                                                */
      __IOM uint32_t PO         : 1;            /*!< [6..6] Clock Polarity Control                                             */
      __IOM uint32_t LB         : 1;            /*!< [7..7] Loop Back Control                                                  */
      __IOM uint32_t TEN        : 1;            /*!< [8..8] Transmit Error Enable                                              */
      __IOM uint32_t REN        : 1;            /*!< [9..9] Receive Error Enable                                               */
      __IOM uint32_t PEN        : 1;            /*!< [10..10] Phase Error Enable                                               */
      __IOM uint32_t BEN        : 1;            /*!< [11..11] Baud Rate Error Enable                                           */
      __IOM uint32_t AREN       : 1;            /*!< [12..12] Automatic Reset Enable                                           */
      __IM  uint32_t            : 1;
      __IOM uint32_t MS         : 1;            /*!< [14..14] Master Select                                                    */
      __IOM uint32_t EN         : 1;            /*!< [15..15] Enable Bit                                                       */
      __IM  uint32_t BC         : 4;            /*!< [19..16] Bit Count Field                                                  */
      __IM  uint32_t            : 4;
      __IM  uint32_t TE         : 1;            /*!< [24..24] Transmit Error Flag                                              */
      __IM  uint32_t RE         : 1;            /*!< [25..25] Receive Error Flag                                               */
      __IM  uint32_t PE         : 1;            /*!< [26..26] Phase Error Flag                                                 */
      __IM  uint32_t BE         : 1;            /*!< [27..27] Baud Rate Error Flag                                             */
      __IM  uint32_t BSY        : 1;            /*!< [28..28] Busy Flag                                                        */
    } bit;
  } CON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Transmitter Buffer Register                                */
    
    struct {
      __IOM uint32_t TB_VALUE   : 16;           /*!< [15..0] Transmit Data Register Value                                      */
    } bit;
  } TB;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000000C) Receiver Buffer Register                                   */
    
    struct {
      __IM  uint32_t RB_VALUE   : 16;           /*!< [15..0] Receive Data Register Value                                       */
    } bit;
  } RB;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000010) Baud Rate Timer Reload Register                            */
    
    struct {
      __IOM uint32_t BR_VALUE   : 16;           /*!< [15..0] Baud Rate Timer/Reload Register Value                             */
    } bit;
  } BR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000014) Interrupt Status Register Clear                            */
    
    struct {
      __IM  uint32_t            : 8;
      __OM  uint32_t TECLR      : 1;            /*!< [8..8] Transmit Error Flag Clear                                          */
      __OM  uint32_t RECLR      : 1;            /*!< [9..9] Receive Error Flag Clear                                           */
      __OM  uint32_t PECLR      : 1;            /*!< [10..10] Phase Error Flag Clear                                           */
      __OM  uint32_t BECLR      : 1;            /*!< [11..11] Baud Rate Error Flag Clear                                       */
    } bit;
  } ISRCLR;
} SSC1_Type;                                    /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                           SSC2                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief SSC2 (SSC2)
  */

typedef struct {                                /*!< (@ 0x48026000) SSC2 Structure                                             */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Port Input Select Register                                 */
    
