Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __IM  uint32_t            : 6;
      __OM  uint32_t EXF2CLR    : 1;            /*!< [6..6] External Interrupt Clear Flag                                      */
      __OM  uint32_t TF2CLR     : 1;            /*!< [7..7] Overflow/Underflow Interrupt Clear Flag                            */
    } bit;
  } ICLR;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x0000001C) Timer 2 Control Register 1                                 */
    
    struct {
      __IOM uint32_t EXF2EN     : 1;            /*!< [0..0] External Interrupt Enable                                          */
      __IOM uint32_t TF2EN      : 1;            /*!< [1..1] Overflow/Underflow Interrupt Enable                                */
    } bit;
  } CON1;
} TIMER21_Type;                                 /*!< Size = 32 (0x20)                                                          */



/* =========================================================================================================================== */
/* ================                                           UART1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief UART1 (UART1)
  */

typedef struct {                                /*!< (@ 0x48020000) UART1 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Serial Channel Control Register                            */
    
    struct {
      __IOM uint32_t RI         : 1;            /*!< [0..0] Receive Interrupt Flag                                             */
      __IOM uint32_t TI         : 1;            /*!< [1..1] Transmit Interrupt Flag                                            */
      __IOM uint32_t RB8        : 1;            /*!< [2..2] Serial Port Receiver Bit 9                                         */
      __IOM uint32_t TB8        : 1;            /*!< [3..3] Serial Port Transmitter Bit 9                                      */
      __IOM uint32_t REN        : 1;            /*!< [4..4] Enable Receiver of Serial Port                                     */
      __IOM uint32_t SM2        : 1;            /*!< [5..5] Enable Serial Port Multiprocessor Communication in Modes
                                                     2 and 3                                                                   */
      __IOM uint32_t SM1        : 1;            /*!< [6..6] Serial Port Operating Mode Selection                               */
      __IOM uint32_t SM0        : 1;            /*!< [7..7] Serial Port Operating Mode Selection                               */
    } bit;
  } SCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Serial Data Buffer                                         */
    
    struct {
      __IOM uint32_t VAL        : 8;            /*!< [7..0] Serial Interface Buffer Register                                   */
    } bit;
  } SBUF;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Serial Channel Control Clear Register                      */
    
    struct {
      __OM  uint32_t RICLR      : 1;            /*!< [0..0] SCON.RI Clear Flag                                                 */
      __OM  uint32_t TICLR      : 1;            /*!< [1..1] SCON.TI Clear Flag                                                 */
      __OM  uint32_t RB8CLR     : 1;            /*!< [2..2] SCON.RB8 Clear Flag                                                */
    } bit;
  } SCONCLR;
} UART1_Type;                                   /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           UART2                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief UART2 (UART2)
  */

typedef struct {                                /*!< (@ 0x48022000) UART2 Structure                                            */
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000000) Serial Channel Control Register                            */
    
    struct {
      __IOM uint32_t RI         : 1;            /*!< [0..0] Receive Interrupt Flag                                             */
      __IOM uint32_t TI         : 1;            /*!< [1..1] Transmit Interrupt Flag                                            */
      __IOM uint32_t RB8        : 1;            /*!< [2..2] Serial Port Receiver Bit 9                                         */
      __IOM uint32_t TB8        : 1;            /*!< [3..3] Serial Port Transmitter Bit 9                                      */
      __IOM uint32_t REN        : 1;            /*!< [4..4] Enable Receiver of Serial Port                                     */
      __IOM uint32_t SM2        : 1;            /*!< [5..5] Enable Serial Port Multiprocessor Communication in Modes
                                                     2 and 3                                                                   */
      __IOM uint32_t SM1        : 1;            /*!< [6..6] Serial Port Operating Mode Selection                               */
      __IOM uint32_t SM0        : 1;            /*!< [7..7] Serial Port Operating Mode Selection                               */
    } bit;
  } SCON;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000004) Serial Data Buffer                                         */
    
    struct {
      __IOM uint32_t VAL        : 8;            /*!< [7..0] Serial Interface Buffer Register                                   */
    } bit;
  } SBUF;
  
  union {
    __IOM uint32_t reg;                         /*!< (@ 0x00000008) Serial Channel Control Clear Register                      */
    
