Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
    struct {
      __OM  uint32_t RICLR      : 1;            /*!< [0..0] SCON.RI Clear Flag                                                 */
      __OM  uint32_t TICLR      : 1;            /*!< [1..1] SCON.TI Clear Flag                                                 */
      __OM  uint32_t RB8CLR     : 1;            /*!< [2..2] SCON.RB8 Clear Flag                                                */
    } bit;
  } SCONCLR;
} UART2_Type;                                   /*!< Size = 12 (0xc)                                                           */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define ADC1_BASE                   0x40004000UL
#define ADC2_BASE                   0x4801C000UL
#define BDRV_BASE                   0x40034000UL
#define CCU6_BASE                   0x4000C000UL
#define CPU_BASE                    0xE000E000UL
#define GPT12E_BASE                 0x40010000UL
#define HS_BASE                     0x40024000UL
#define LIN_BASE                    0x4801E000UL
#define MATH_BASE                   0x48013000UL
#define MF_BASE                     0x48018000UL
#define PMU_BASE                    0x50004000UL
#define PORT_BASE                   0x48028000UL
#define SCU_BASE                    0x50005000UL
#define SCUPM_BASE                  0x50006000UL
#define SSC1_BASE                   0x48024000UL
#define SSC2_BASE                   0x48026000UL
#define TIMER2_BASE                 0x48004000UL
#define TIMER21_BASE                0x48005000UL
#define UART1_BASE                  0x48020000UL
#define UART2_BASE                  0x48022000UL 

 
/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#ifndef UNIT_TESTING_LV2
#define ADC1      ((ADC1_Type*)      ADC1_BASE)
#define ADC2      ((ADC2_Type*)      ADC2_BASE)
#define BDRV      ((BDRV_Type*)      BDRV_BASE)
#define CCU6      ((CCU6_Type*)      CCU6_BASE)
#define CPU       ((CPU_Type*)       CPU_BASE)
#define GPT12E    ((GPT12E_Type*)    GPT12E_BASE)
#define HS        ((HS_Type*)        HS_BASE)
#define LIN       ((LIN_Type*)       LIN_BASE)
#define MATH      ((MATH_Type*)      MATH_BASE)
#define MF        ((MF_Type*)        MF_BASE)
#define PMU       ((PMU_Type*)       PMU_BASE)
#define PORT      ((PORT_Type*)      PORT_BASE)
#define SCU       ((SCU_Type*)       SCU_BASE)
#define SCUPM     ((SCUPM_Type*)     SCUPM_BASE)
#define SSC1      ((SSC1_Type*)      SSC1_BASE)
#define SSC2      ((SSC2_Type*)      SSC2_BASE)
#define TIMER2    ((TIMER2_Type*)    TIMER2_BASE)
#define TIMER21   ((TIMER21_Type*)   TIMER21_BASE)
#define UART1     ((UART1_Type*)     UART1_BASE)
#define UART2     ((UART2_Type*)     UART2_BASE)

#else
  extern ADC1_Type*   ADC1;
  extern ADC2_Type*   ADC2;
  extern BDRV_Type*   BDRV; 
  extern CCU6_Type*   CCU6;
  extern CPU_Type*    CPU;
  extern GPT12E_Type* GPT12E;
  extern HS_Type*     HS;  
  extern LIN_Type*    LIN;
  extern MATH_Type*   MATH;  
  extern MF_Type*     MF;
  extern PMU_Type*    PMU;
  extern PORT_Type*   PORT;
  extern SCU_Type*    SCU;
  extern SCUPM_Type*  SCUPM;
  extern SSC1_Type*   SSC1;
  extern SSC2_Type*   SSC2;
  extern TIMER2_Type*  TIMER2;
  extern TIMER21_Type*  TIMER21;
  extern UART1_Type*     UART1;
  extern UART2_Type*     UART2;
#endif /* UNIT_TESTING_LV2 */

/** @} */ /* End of group Device_Peripheral_declaration */

/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                           ADC1                                            ================ */
/* =========================================================================================================================== */

/* =======================================================  CAL_CH0_1  ======================================================= */
#define ADC1_CAL_CH0_1_CALGAIN_CH1_Pos    (24UL)                    /*!< ADC1 CAL_CH0_1: CALGAIN_CH1 (Bit 24)                  */
#define ADC1_CAL_CH0_1_CALGAIN_CH1_Msk    (0xff000000UL)            /*!< ADC1 CAL_CH0_1: CALGAIN_CH1 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH0_1_CALOFFS_CH1_Pos    (16UL)                    /*!< ADC1 CAL_CH0_1: CALOFFS_CH1 (Bit 16)                  */
#define ADC1_CAL_CH0_1_CALOFFS_CH1_Msk    (0x1f0000UL)              /*!< ADC1 CAL_CH0_1: CALOFFS_CH1 (Bitfield-Mask: 0x1f)     */
#define ADC1_CAL_CH0_1_CALGAIN_CH0_Pos    (8UL)                     /*!< ADC1 CAL_CH0_1: CALGAIN_CH0 (Bit 8)                   */
#define ADC1_CAL_CH0_1_CALGAIN_CH0_Msk    (0xff00UL)                /*!< ADC1 CAL_CH0_1: CALGAIN_CH0 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH0_1_CALOFFS_CH0_Pos    (0UL)                     /*!< ADC1 CAL_CH0_1: CALOFFS_CH0 (Bit 0)                   */
#define ADC1_CAL_CH0_1_CALOFFS_CH0_Msk    (0x1fUL)                  /*!< ADC1 CAL_CH0_1: CALOFFS_CH0 (Bitfield-Mask: 0x1f)     */
/* ======================================================  CAL_CH10_11  ====================================================== */
#define ADC1_CAL_CH10_11_CALGAIN_CH11_Pos (24UL)                    /*!< ADC1 CAL_CH10_11: CALGAIN_CH11 (Bit 24)               */
#define ADC1_CAL_CH10_11_CALGAIN_CH11_Msk (0xff000000UL)            /*!< ADC1 CAL_CH10_11: CALGAIN_CH11 (Bitfield-Mask: 0xff)  */
#define ADC1_CAL_CH10_11_CALOFFS_CH11_Pos (16UL)                    /*!< ADC1 CAL_CH10_11: CALOFFS_CH11 (Bit 16)               */
#define ADC1_CAL_CH10_11_CALOFFS_CH11_Msk (0x1f0000UL)              /*!< ADC1 CAL_CH10_11: CALOFFS_CH11 (Bitfield-Mask: 0x1f)  */
#define ADC1_CAL_CH10_11_CALGAIN_CH10_Pos (8UL)                     /*!< ADC1 CAL_CH10_11: CALGAIN_CH10 (Bit 8)                */
#define ADC1_CAL_CH10_11_CALGAIN_CH10_Msk (0xff00UL)                /*!< ADC1 CAL_CH10_11: CALGAIN_CH10 (Bitfield-Mask: 0xff)  */
#define ADC1_CAL_CH10_11_CALOFFS_CH10_Pos (0UL)                     /*!< ADC1 CAL_CH10_11: CALOFFS_CH10 (Bit 0)                */
#define ADC1_CAL_CH10_11_CALOFFS_CH10_Msk (0x1fUL)                  /*!< ADC1 CAL_CH10_11: CALOFFS_CH10 (Bitfield-Mask: 0x1f)  */
/* ======================================================  CAL_CH12_13  ====================================================== */
#define ADC1_CAL_CH12_13_CALGAIN_CH13_Pos (24UL)                    /*!< ADC1 CAL_CH12_13: CALGAIN_CH13 (Bit 24)               */
#define ADC1_CAL_CH12_13_CALGAIN_CH13_Msk (0xff000000UL)            /*!< ADC1 CAL_CH12_13: CALGAIN_CH13 (Bitfield-Mask: 0xff)  */
#define ADC1_CAL_CH12_13_CALOFFS_CH13_Pos (16UL)                    /*!< ADC1 CAL_CH12_13: CALOFFS_CH13 (Bit 16)               */
#define ADC1_CAL_CH12_13_CALOFFS_CH13_Msk (0x1f0000UL)              /*!< ADC1 CAL_CH12_13: CALOFFS_CH13 (Bitfield-Mask: 0x1f)  */
#define ADC1_CAL_CH12_13_CALGAIN_CH12_Pos (8UL)                     /*!< ADC1 CAL_CH12_13: CALGAIN_CH12 (Bit 8)                */
#define ADC1_CAL_CH12_13_CALGAIN_CH12_Msk (0xff00UL)                /*!< ADC1 CAL_CH12_13: CALGAIN_CH12 (Bitfield-Mask: 0xff)  */
#define ADC1_CAL_CH12_13_CALOFFS_CH12_Pos (0UL)                     /*!< ADC1 CAL_CH12_13: CALOFFS_CH12 (Bit 0)                */
#define ADC1_CAL_CH12_13_CALOFFS_CH12_Msk (0x1fUL)                  /*!< ADC1 CAL_CH12_13: CALOFFS_CH12 (Bitfield-Mask: 0x1f)  */
/* =======================================================  CAL_CH2_3  ======================================================= */
#define ADC1_CAL_CH2_3_CALGAIN_CH3_Pos    (24UL)                    /*!< ADC1 CAL_CH2_3: CALGAIN_CH3 (Bit 24)                  */
#define ADC1_CAL_CH2_3_CALGAIN_CH3_Msk    (0xff000000UL)            /*!< ADC1 CAL_CH2_3: CALGAIN_CH3 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH2_3_CALOFFS_CH3_Pos    (16UL)                    /*!< ADC1 CAL_CH2_3: CALOFFS_CH3 (Bit 16)                  */
#define ADC1_CAL_CH2_3_CALOFFS_CH3_Msk    (0x1f0000UL)              /*!< ADC1 CAL_CH2_3: CALOFFS_CH3 (Bitfield-Mask: 0x1f)     */
#define ADC1_CAL_CH2_3_CALGAIN_CH2_Pos    (8UL)                     /*!< ADC1 CAL_CH2_3: CALGAIN_CH2 (Bit 8)                   */
#define ADC1_CAL_CH2_3_CALGAIN_CH2_Msk    (0xff00UL)                /*!< ADC1 CAL_CH2_3: CALGAIN_CH2 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH2_3_CALOFFS_CH2_Pos    (0UL)                     /*!< ADC1 CAL_CH2_3: CALOFFS_CH2 (Bit 0)                   */
#define ADC1_CAL_CH2_3_CALOFFS_CH2_Msk    (0x1fUL)                  /*!< ADC1 CAL_CH2_3: CALOFFS_CH2 (Bitfield-Mask: 0x1f)     */
/* =======================================================  CAL_CH4_5  ======================================================= */
#define ADC1_CAL_CH4_5_CALGAIN_CH5_Pos    (24UL)                    /*!< ADC1 CAL_CH4_5: CALGAIN_CH5 (Bit 24)                  */
#define ADC1_CAL_CH4_5_CALGAIN_CH5_Msk    (0xff000000UL)            /*!< ADC1 CAL_CH4_5: CALGAIN_CH5 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH4_5_CALOFFS_CH5_Pos    (16UL)                    /*!< ADC1 CAL_CH4_5: CALOFFS_CH5 (Bit 16)                  */
#define ADC1_CAL_CH4_5_CALOFFS_CH5_Msk    (0x1f0000UL)              /*!< ADC1 CAL_CH4_5: CALOFFS_CH5 (Bitfield-Mask: 0x1f)     */
#define ADC1_CAL_CH4_5_CALGAIN_CH4_Pos    (8UL)                     /*!< ADC1 CAL_CH4_5: CALGAIN_CH4 (Bit 8)                   */
#define ADC1_CAL_CH4_5_CALGAIN_CH4_Msk    (0xff00UL)                /*!< ADC1 CAL_CH4_5: CALGAIN_CH4 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH4_5_CALOFFS_CH4_Pos    (0UL)                     /*!< ADC1 CAL_CH4_5: CALOFFS_CH4 (Bit 0)                   */
#define ADC1_CAL_CH4_5_CALOFFS_CH4_Msk    (0x1fUL)                  /*!< ADC1 CAL_CH4_5: CALOFFS_CH4 (Bitfield-Mask: 0x1f)     */
/* =======================================================  CAL_CH6_7  ======================================================= */
#define ADC1_CAL_CH6_7_CALGAIN_CH7_Pos    (24UL)                    /*!< ADC1 CAL_CH6_7: CALGAIN_CH7 (Bit 24)                  */
#define ADC1_CAL_CH6_7_CALGAIN_CH7_Msk    (0xff000000UL)            /*!< ADC1 CAL_CH6_7: CALGAIN_CH7 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH6_7_CALOFFS_CH7_Pos    (16UL)                    /*!< ADC1 CAL_CH6_7: CALOFFS_CH7 (Bit 16)                  */
#define ADC1_CAL_CH6_7_CALOFFS_CH7_Msk    (0x1f0000UL)              /*!< ADC1 CAL_CH6_7: CALOFFS_CH7 (Bitfield-Mask: 0x1f)     */
#define ADC1_CAL_CH6_7_CALGAIN_CH6_Pos    (8UL)                     /*!< ADC1 CAL_CH6_7: CALGAIN_CH6 (Bit 8)                   */
#define ADC1_CAL_CH6_7_CALGAIN_CH6_Msk    (0xff00UL)                /*!< ADC1 CAL_CH6_7: CALGAIN_CH6 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH6_7_CALOFFS_CH6_Pos    (0UL)                     /*!< ADC1 CAL_CH6_7: CALOFFS_CH6 (Bit 0)                   */
#define ADC1_CAL_CH6_7_CALOFFS_CH6_Msk    (0x1fUL)                  /*!< ADC1 CAL_CH6_7: CALOFFS_CH6 (Bitfield-Mask: 0x1f)     */
/* =======================================================  CAL_CH8_9  ======================================================= */
#define ADC1_CAL_CH8_9_CALGAIN_CH9_Pos    (24UL)                    /*!< ADC1 CAL_CH8_9: CALGAIN_CH9 (Bit 24)                  */
#define ADC1_CAL_CH8_9_CALGAIN_CH9_Msk    (0xff000000UL)            /*!< ADC1 CAL_CH8_9: CALGAIN_CH9 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH8_9_CALOFFS_CH9_Pos    (16UL)                    /*!< ADC1 CAL_CH8_9: CALOFFS_CH9 (Bit 16)                  */
#define ADC1_CAL_CH8_9_CALOFFS_CH9_Msk    (0x1f0000UL)              /*!< ADC1 CAL_CH8_9: CALOFFS_CH9 (Bitfield-Mask: 0x1f)     */
#define ADC1_CAL_CH8_9_CALGAIN_CH8_Pos    (8UL)                     /*!< ADC1 CAL_CH8_9: CALGAIN_CH8 (Bit 8)                   */
#define ADC1_CAL_CH8_9_CALGAIN_CH8_Msk    (0xff00UL)                /*!< ADC1 CAL_CH8_9: CALGAIN_CH8 (Bitfield-Mask: 0xff)     */
#define ADC1_CAL_CH8_9_CALOFFS_CH8_Pos    (0UL)                     /*!< ADC1 CAL_CH8_9: CALOFFS_CH8 (Bit 0)                   */
#define ADC1_CAL_CH8_9_CALOFFS_CH8_Msk    (0x1fUL)                  /*!< ADC1 CAL_CH8_9: CALOFFS_CH8 (Bitfield-Mask: 0x1f)     */
/* ========================================================  CHx_EIM  ======================================================== */
#define ADC1_CHx_EIM_ADC1_EIM_TRIG_SEL_Pos (16UL)                   /*!< ADC1 CHx_EIM: ADC1_EIM_TRIG_SEL (Bit 16)              */
#define ADC1_CHx_EIM_ADC1_EIM_TRIG_SEL_Msk (0x70000UL)              /*!< ADC1 CHx_EIM: ADC1_EIM_TRIG_SEL (Bitfield-Mask: 0x07) */
#define ADC1_CHx_EIM_EIM_EN_Pos           (11UL)                    /*!< ADC1 CHx_EIM: EIM_EN (Bit 11)                         */
#define ADC1_CHx_EIM_EIM_EN_Msk           (0x800UL)                 /*!< ADC1 CHx_EIM: EIM_EN (Bitfield-Mask: 0x01)            */
#define ADC1_CHx_EIM_EIM_REP_Pos          (8UL)                     /*!< ADC1 CHx_EIM: EIM_REP (Bit 8)                         */
#define ADC1_CHx_EIM_EIM_REP_Msk          (0x700UL)                 /*!< ADC1 CHx_EIM: EIM_REP (Bitfield-Mask: 0x07)           */
#define ADC1_CHx_EIM_EIM_CHx_Pos          (0UL)                     /*!< ADC1 CHx_EIM: EIM_CHx (Bit 0)                         */
#define ADC1_CHx_EIM_EIM_CHx_Msk          (0xfUL)                   /*!< ADC1 CHx_EIM: EIM_CHx (Bitfield-Mask: 0x0f)           */
/* ========================================================  CHx_ESM  ======================================================== */
#define ADC1_CHx_ESM_ESM_STS_Pos          (31UL)                    /*!< ADC1 CHx_ESM: ESM_STS (Bit 31)                        */
#define ADC1_CHx_ESM_ESM_STS_Msk          (0x80000000UL)            /*!< ADC1 CHx_ESM: ESM_STS (Bitfield-Mask: 0x01)           */
#define ADC1_CHx_ESM_ESM_EN_Pos           (30UL)                    /*!< ADC1 CHx_ESM: ESM_EN (Bit 30)                         */
#define ADC1_CHx_ESM_ESM_EN_Msk           (0x40000000UL)            /*!< ADC1 CHx_ESM: ESM_EN (Bitfield-Mask: 0x01)            */
#define ADC1_CHx_ESM_ADC1_ESM_TRIG_SEL_Pos (16UL)                   /*!< ADC1 CHx_ESM: ADC1_ESM_TRIG_SEL (Bit 16)              */
#define ADC1_CHx_ESM_ADC1_ESM_TRIG_SEL_Msk (0x70000UL)              /*!< ADC1 CHx_ESM: ADC1_ESM_TRIG_SEL (Bitfield-Mask: 0x07) */
#define ADC1_CHx_ESM_ESM_0_Pos            (0UL)                     /*!< ADC1 CHx_ESM: ESM_0 (Bit 0)                           */
#define ADC1_CHx_ESM_ESM_0_Msk            (0x3fffUL)                /*!< ADC1 CHx_ESM: ESM_0 (Bitfield-Mask: 0x3fff)           */
/* =====================================================  CNT0_3_LOWER  ====================================================== */
#define ADC1_CNT0_3_LOWER_HYST_LO_PP3_Pos (27UL)                    /*!< ADC1 CNT0_3_LOWER: HYST_LO_PP3 (Bit 27)               */
#define ADC1_CNT0_3_LOWER_HYST_LO_PP3_Msk (0x18000000UL)            /*!< ADC1 CNT0_3_LOWER: HYST_LO_PP3 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT0_3_LOWER_CNT_LO_PP3_Pos  (24UL)                    /*!< ADC1 CNT0_3_LOWER: CNT_LO_PP3 (Bit 24)                */
#define ADC1_CNT0_3_LOWER_CNT_LO_PP3_Msk  (0x3000000UL)             /*!< ADC1 CNT0_3_LOWER: CNT_LO_PP3 (Bitfield-Mask: 0x03)   */
#define ADC1_CNT0_3_LOWER_HYST_LO_PP2_Pos (19UL)                    /*!< ADC1 CNT0_3_LOWER: HYST_LO_PP2 (Bit 19)               */
#define ADC1_CNT0_3_LOWER_HYST_LO_PP2_Msk (0x180000UL)              /*!< ADC1 CNT0_3_LOWER: HYST_LO_PP2 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT0_3_LOWER_CNT_LO_PP2_Pos  (16UL)                    /*!< ADC1 CNT0_3_LOWER: CNT_LO_PP2 (Bit 16)                */
#define ADC1_CNT0_3_LOWER_CNT_LO_PP2_Msk  (0x30000UL)               /*!< ADC1 CNT0_3_LOWER: CNT_LO_PP2 (Bitfield-Mask: 0x03)   */
#define ADC1_CNT0_3_LOWER_HYST_LO_PP1_Pos (11UL)                    /*!< ADC1 CNT0_3_LOWER: HYST_LO_PP1 (Bit 11)               */
#define ADC1_CNT0_3_LOWER_HYST_LO_PP1_Msk (0x1800UL)                /*!< ADC1 CNT0_3_LOWER: HYST_LO_PP1 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT0_3_LOWER_CNT_LO_PP1_Pos  (8UL)                     /*!< ADC1 CNT0_3_LOWER: CNT_LO_PP1 (Bit 8)                 */
#define ADC1_CNT0_3_LOWER_CNT_LO_PP1_Msk  (0x300UL)                 /*!< ADC1 CNT0_3_LOWER: CNT_LO_PP1 (Bitfield-Mask: 0x03)   */
#define ADC1_CNT0_3_LOWER_HYST_LO_PP0_Pos (3UL)                     /*!< ADC1 CNT0_3_LOWER: HYST_LO_PP0 (Bit 3)                */
#define ADC1_CNT0_3_LOWER_HYST_LO_PP0_Msk (0x18UL)                  /*!< ADC1 CNT0_3_LOWER: HYST_LO_PP0 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT0_3_LOWER_CNT_LO_PP0_Pos  (0UL)                     /*!< ADC1 CNT0_3_LOWER: CNT_LO_PP0 (Bit 0)                 */
#define ADC1_CNT0_3_LOWER_CNT_LO_PP0_Msk  (0x3UL)                   /*!< ADC1 CNT0_3_LOWER: CNT_LO_PP0 (Bitfield-Mask: 0x03)   */
/* =====================================================  CNT0_3_UPPER  ====================================================== */
#define ADC1_CNT0_3_UPPER_HYST_UP_PP3_Pos (27UL)                    /*!< ADC1 CNT0_3_UPPER: HYST_UP_PP3 (Bit 27)               */
#define ADC1_CNT0_3_UPPER_HYST_UP_PP3_Msk (0x18000000UL)            /*!< ADC1 CNT0_3_UPPER: HYST_UP_PP3 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT0_3_UPPER_CNT_UP_PP3_Pos  (24UL)                    /*!< ADC1 CNT0_3_UPPER: CNT_UP_PP3 (Bit 24)                */
#define ADC1_CNT0_3_UPPER_CNT_UP_PP3_Msk  (0x3000000UL)             /*!< ADC1 CNT0_3_UPPER: CNT_UP_PP3 (Bitfield-Mask: 0x03)   */
#define ADC1_CNT0_3_UPPER_HYST_UP_PP2_Pos (19UL)                    /*!< ADC1 CNT0_3_UPPER: HYST_UP_PP2 (Bit 19)               */
#define ADC1_CNT0_3_UPPER_HYST_UP_PP2_Msk (0x180000UL)              /*!< ADC1 CNT0_3_UPPER: HYST_UP_PP2 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT0_3_UPPER_CNT_UP_PP2_Pos  (16UL)                    /*!< ADC1 CNT0_3_UPPER: CNT_UP_PP2 (Bit 16)                */
#define ADC1_CNT0_3_UPPER_CNT_UP_PP2_Msk  (0x30000UL)               /*!< ADC1 CNT0_3_UPPER: CNT_UP_PP2 (Bitfield-Mask: 0x03)   */
#define ADC1_CNT0_3_UPPER_HYST_UP_PP1_Pos (11UL)                    /*!< ADC1 CNT0_3_UPPER: HYST_UP_PP1 (Bit 11)               */
#define ADC1_CNT0_3_UPPER_HYST_UP_PP1_Msk (0x1800UL)                /*!< ADC1 CNT0_3_UPPER: HYST_UP_PP1 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT0_3_UPPER_CNT_UP_PP1_Pos  (8UL)                     /*!< ADC1 CNT0_3_UPPER: CNT_UP_PP1 (Bit 8)                 */
#define ADC1_CNT0_3_UPPER_CNT_UP_PP1_Msk  (0x300UL)                 /*!< ADC1 CNT0_3_UPPER: CNT_UP_PP1 (Bitfield-Mask: 0x03)   */
#define ADC1_CNT0_3_UPPER_HYST_UP_PP0_Pos (3UL)                     /*!< ADC1 CNT0_3_UPPER: HYST_UP_PP0 (Bit 3)                */
#define ADC1_CNT0_3_UPPER_HYST_UP_PP0_Msk (0x18UL)                  /*!< ADC1 CNT0_3_UPPER: HYST_UP_PP0 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT0_3_UPPER_CNT_UP_PP0_Pos  (0UL)                     /*!< ADC1 CNT0_3_UPPER: CNT_UP_PP0 (Bit 0)                 */
#define ADC1_CNT0_3_UPPER_CNT_UP_PP0_Msk  (0x3UL)                   /*!< ADC1 CNT0_3_UPPER: CNT_UP_PP0 (Bitfield-Mask: 0x03)   */
/* =====================================================  CNT4_7_LOWER  ====================================================== */
#define ADC1_CNT4_7_LOWER_HYST_LO_PP7_Pos (27UL)                    /*!< ADC1 CNT4_7_LOWER: HYST_LO_PP7 (Bit 27)               */
#define ADC1_CNT4_7_LOWER_HYST_LO_PP7_Msk (0x18000000UL)            /*!< ADC1 CNT4_7_LOWER: HYST_LO_PP7 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT4_7_LOWER_CNT_LO_PP7_Pos  (24UL)                    /*!< ADC1 CNT4_7_LOWER: CNT_LO_PP7 (Bit 24)                */
#define ADC1_CNT4_7_LOWER_CNT_LO_PP7_Msk  (0x3000000UL)             /*!< ADC1 CNT4_7_LOWER: CNT_LO_PP7 (Bitfield-Mask: 0x03)   */
#define ADC1_CNT4_7_LOWER_HYST_LO_PP6_Pos (19UL)                    /*!< ADC1 CNT4_7_LOWER: HYST_LO_PP6 (Bit 19)               */
#define ADC1_CNT4_7_LOWER_HYST_LO_PP6_Msk (0x180000UL)              /*!< ADC1 CNT4_7_LOWER: HYST_LO_PP6 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT4_7_LOWER_CNT_LO_PP6_Pos  (16UL)                    /*!< ADC1 CNT4_7_LOWER: CNT_LO_PP6 (Bit 16)                */
#define ADC1_CNT4_7_LOWER_CNT_LO_PP6_Msk  (0x30000UL)               /*!< ADC1 CNT4_7_LOWER: CNT_LO_PP6 (Bitfield-Mask: 0x03)   */
#define ADC1_CNT4_7_LOWER_HYST_LO_PP5_Pos (11UL)                    /*!< ADC1 CNT4_7_LOWER: HYST_LO_PP5 (Bit 11)               */
#define ADC1_CNT4_7_LOWER_HYST_LO_PP5_Msk (0x1800UL)                /*!< ADC1 CNT4_7_LOWER: HYST_LO_PP5 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT4_7_LOWER_CNT_LO_PP5_Pos  (8UL)                     /*!< ADC1 CNT4_7_LOWER: CNT_LO_PP5 (Bit 8)                 */
#define ADC1_CNT4_7_LOWER_CNT_LO_PP5_Msk  (0x300UL)                 /*!< ADC1 CNT4_7_LOWER: CNT_LO_PP5 (Bitfield-Mask: 0x03)   */
#define ADC1_CNT4_7_LOWER_HYST_LO_PP4_Pos (3UL)                     /*!< ADC1 CNT4_7_LOWER: HYST_LO_PP4 (Bit 3)                */
#define ADC1_CNT4_7_LOWER_HYST_LO_PP4_Msk (0x18UL)                  /*!< ADC1 CNT4_7_LOWER: HYST_LO_PP4 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT4_7_LOWER_CNT_LO_PP4_Pos  (0UL)                     /*!< ADC1 CNT4_7_LOWER: CNT_LO_PP4 (Bit 0)                 */
#define ADC1_CNT4_7_LOWER_CNT_LO_PP4_Msk  (0x3UL)                   /*!< ADC1 CNT4_7_LOWER: CNT_LO_PP4 (Bitfield-Mask: 0x03)   */
/* =====================================================  CNT4_7_UPPER  ====================================================== */
#define ADC1_CNT4_7_UPPER_HYST_UP_PP7_Pos (27UL)                    /*!< ADC1 CNT4_7_UPPER: HYST_UP_PP7 (Bit 27)               */
#define ADC1_CNT4_7_UPPER_HYST_UP_PP7_Msk (0x18000000UL)            /*!< ADC1 CNT4_7_UPPER: HYST_UP_PP7 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT4_7_UPPER_CNT_UP_PP7_Pos  (24UL)                    /*!< ADC1 CNT4_7_UPPER: CNT_UP_PP7 (Bit 24)                */
#define ADC1_CNT4_7_UPPER_CNT_UP_PP7_Msk  (0x3000000UL)             /*!< ADC1 CNT4_7_UPPER: CNT_UP_PP7 (Bitfield-Mask: 0x03)   */
#define ADC1_CNT4_7_UPPER_HYST_UP_PP6_Pos (19UL)                    /*!< ADC1 CNT4_7_UPPER: HYST_UP_PP6 (Bit 19)               */
#define ADC1_CNT4_7_UPPER_HYST_UP_PP6_Msk (0x180000UL)              /*!< ADC1 CNT4_7_UPPER: HYST_UP_PP6 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT4_7_UPPER_CNT_UP_PP6_Pos  (16UL)                    /*!< ADC1 CNT4_7_UPPER: CNT_UP_PP6 (Bit 16)                */
#define ADC1_CNT4_7_UPPER_CNT_UP_PP6_Msk  (0x30000UL)               /*!< ADC1 CNT4_7_UPPER: CNT_UP_PP6 (Bitfield-Mask: 0x03)   */
#define ADC1_CNT4_7_UPPER_HYST_UP_PP5_Pos (11UL)                    /*!< ADC1 CNT4_7_UPPER: HYST_UP_PP5 (Bit 11)               */
#define ADC1_CNT4_7_UPPER_HYST_UP_PP5_Msk (0x1800UL)                /*!< ADC1 CNT4_7_UPPER: HYST_UP_PP5 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT4_7_UPPER_CNT_UP_PP5_Pos  (8UL)                     /*!< ADC1 CNT4_7_UPPER: CNT_UP_PP5 (Bit 8)                 */
#define ADC1_CNT4_7_UPPER_CNT_UP_PP5_Msk  (0x300UL)                 /*!< ADC1 CNT4_7_UPPER: CNT_UP_PP5 (Bitfield-Mask: 0x03)   */
