Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
#define ADC1_CNT4_7_UPPER_HYST_UP_PP4_Pos (3UL)                     /*!< ADC1 CNT4_7_UPPER: HYST_UP_PP4 (Bit 3)                */
#define ADC1_CNT4_7_UPPER_HYST_UP_PP4_Msk (0x18UL)                  /*!< ADC1 CNT4_7_UPPER: HYST_UP_PP4 (Bitfield-Mask: 0x03)  */
#define ADC1_CNT4_7_UPPER_CNT_UP_PP4_Pos  (0UL)                     /*!< ADC1 CNT4_7_UPPER: CNT_UP_PP4 (Bit 0)                 */
#define ADC1_CNT4_7_UPPER_CNT_UP_PP4_Msk  (0x3UL)                   /*!< ADC1 CNT4_7_UPPER: CNT_UP_PP4 (Bitfield-Mask: 0x03)   */
/* =========================================================  CTRL2  ========================================================= */
#define ADC1_CTRL2_CAL_EN_Pos             (0UL)                     /*!< ADC1 CTRL2: CAL_EN (Bit 0)                            */
#define ADC1_CTRL2_CAL_EN_Msk             (0x3fffUL)                /*!< ADC1 CTRL2: CAL_EN (Bitfield-Mask: 0x3fff)            */
/* =========================================================  CTRL3  ========================================================= */
#define ADC1_CTRL3_SAMPLE_TIME_LVCH_Pos   (16UL)                    /*!< ADC1 CTRL3: SAMPLE_TIME_LVCH (Bit 16)                 */
#define ADC1_CTRL3_SAMPLE_TIME_LVCH_Msk   (0xf0000UL)               /*!< ADC1 CTRL3: SAMPLE_TIME_LVCH (Bitfield-Mask: 0x0f)    */
#define ADC1_CTRL3_SAMPLE_TIME_HVCH_Pos   (8UL)                     /*!< ADC1 CTRL3: SAMPLE_TIME_HVCH (Bit 8)                  */
#define ADC1_CTRL3_SAMPLE_TIME_HVCH_Msk   (0x1f00UL)                /*!< ADC1 CTRL3: SAMPLE_TIME_HVCH (Bitfield-Mask: 0x1f)    */
#define ADC1_CTRL3_MCM_RDY_Pos            (7UL)                     /*!< ADC1 CTRL3: MCM_RDY (Bit 7)                           */
#define ADC1_CTRL3_MCM_RDY_Msk            (0x80UL)                  /*!< ADC1 CTRL3: MCM_RDY (Bitfield-Mask: 0x01)             */
#define ADC1_CTRL3_EoC_FAIL_Pos           (6UL)                     /*!< ADC1 CTRL3: EoC_FAIL (Bit 6)                          */
#define ADC1_CTRL3_EoC_FAIL_Msk           (0x40UL)                  /*!< ADC1 CTRL3: EoC_FAIL (Bitfield-Mask: 0x01)            */
#define ADC1_CTRL3_EoC_FAIL_CLR_Pos       (4UL)                     /*!< ADC1 CTRL3: EoC_FAIL_CLR (Bit 4)                      */
#define ADC1_CTRL3_EoC_FAIL_CLR_Msk       (0x10UL)                  /*!< ADC1 CTRL3: EoC_FAIL_CLR (Bitfield-Mask: 0x01)        */
#define ADC1_CTRL3_SW_MODE_Pos            (1UL)                     /*!< ADC1 CTRL3: SW_MODE (Bit 1)                           */
#define ADC1_CTRL3_SW_MODE_Msk            (0x2UL)                   /*!< ADC1 CTRL3: SW_MODE (Bitfield-Mask: 0x01)             */
#define ADC1_CTRL3_MCM_PD_N_Pos           (0UL)                     /*!< ADC1 CTRL3: MCM_PD_N (Bit 0)                          */
#define ADC1_CTRL3_MCM_PD_N_Msk           (0x1UL)                   /*!< ADC1 CTRL3: MCM_PD_N (Bitfield-Mask: 0x01)            */
/* =========================================================  CTRL5  ========================================================= */
#define ADC1_CTRL5_FILT_OUT_SEL_13_0_Pos  (0UL)                     /*!< ADC1 CTRL5: FILT_OUT_SEL_13_0 (Bit 0)                 */
#define ADC1_CTRL5_FILT_OUT_SEL_13_0_Msk  (0x3fffUL)                /*!< ADC1 CTRL5: FILT_OUT_SEL_13_0 (Bitfield-Mask: 0x3fff) */
/* =======================================================  CTRL_STS  ======================================================== */
#define ADC1_CTRL_STS_STRTUP_DIS_Pos      (18UL)                    /*!< ADC1 CTRL_STS: STRTUP_DIS (Bit 18)                    */
#define ADC1_CTRL_STS_STRTUP_DIS_Msk      (0x40000UL)               /*!< ADC1 CTRL_STS: STRTUP_DIS (Bitfield-Mask: 0x01)       */
#define ADC1_CTRL_STS_SW_CH_SEL_Pos       (8UL)                     /*!< ADC1 CTRL_STS: SW_CH_SEL (Bit 8)                      */
#define ADC1_CTRL_STS_SW_CH_SEL_Msk       (0xf00UL)                 /*!< ADC1 CTRL_STS: SW_CH_SEL (Bitfield-Mask: 0x0f)        */
#define ADC1_CTRL_STS_EOC_Pos             (7UL)                     /*!< ADC1 CTRL_STS: EOC (Bit 7)                            */
#define ADC1_CTRL_STS_EOC_Msk             (0x80UL)                  /*!< ADC1 CTRL_STS: EOC (Bitfield-Mask: 0x01)              */
#define ADC1_CTRL_STS_CAL_SIGN_Pos        (5UL)                     /*!< ADC1 CTRL_STS: CAL_SIGN (Bit 5)                       */
#define ADC1_CTRL_STS_CAL_SIGN_Msk        (0x20UL)                  /*!< ADC1 CTRL_STS: CAL_SIGN (Bitfield-Mask: 0x01)         */
#define ADC1_CTRL_STS_READY_Pos           (4UL)                     /*!< ADC1 CTRL_STS: READY (Bit 4)                          */
#define ADC1_CTRL_STS_READY_Msk           (0x10UL)                  /*!< ADC1 CTRL_STS: READY (Bitfield-Mask: 0x01)            */
#define ADC1_CTRL_STS_SOS_Pos             (2UL)                     /*!< ADC1 CTRL_STS: SOS (Bit 2)                            */
#define ADC1_CTRL_STS_SOS_Msk             (0x4UL)                   /*!< ADC1 CTRL_STS: SOS (Bitfield-Mask: 0x01)              */
#define ADC1_CTRL_STS_SOOC_Pos            (1UL)                     /*!< ADC1 CTRL_STS: SOOC (Bit 1)                           */
#define ADC1_CTRL_STS_SOOC_Msk            (0x2UL)                   /*!< ADC1 CTRL_STS: SOOC (Bitfield-Mask: 0x01)             */
#define ADC1_CTRL_STS_PD_N_Pos            (0UL)                     /*!< ADC1 CTRL_STS: PD_N (Bit 0)                           */
#define ADC1_CTRL_STS_PD_N_Msk            (0x1UL)                   /*!< ADC1 CTRL_STS: PD_N (Bitfield-Mask: 0x01)             */
/* ====================================================  DCHCNT1_4_LOWER  ==================================================== */
#define ADC1_DCHCNT1_4_LOWER_HYST_LO_DCH1_Pos (3UL)                 /*!< ADC1 DCHCNT1_4_LOWER: HYST_LO_DCH1 (Bit 3)            */
#define ADC1_DCHCNT1_4_LOWER_HYST_LO_DCH1_Msk (0x18UL)              /*!< ADC1 DCHCNT1_4_LOWER: HYST_LO_DCH1 (Bitfield-Mask: 0x03) */
#define ADC1_DCHCNT1_4_LOWER_CNT_LO_DCH1_Pos (0UL)                  /*!< ADC1 DCHCNT1_4_LOWER: CNT_LO_DCH1 (Bit 0)             */
#define ADC1_DCHCNT1_4_LOWER_CNT_LO_DCH1_Msk (0x3UL)                /*!< ADC1 DCHCNT1_4_LOWER: CNT_LO_DCH1 (Bitfield-Mask: 0x03) */
/* ====================================================  DCHCNT1_4_UPPER  ==================================================== */
#define ADC1_DCHCNT1_4_UPPER_HYST_UP_DCH1_Pos (3UL)                 /*!< ADC1 DCHCNT1_4_UPPER: HYST_UP_DCH1 (Bit 3)            */
#define ADC1_DCHCNT1_4_UPPER_HYST_UP_DCH1_Msk (0x18UL)              /*!< ADC1 DCHCNT1_4_UPPER: HYST_UP_DCH1 (Bitfield-Mask: 0x03) */
#define ADC1_DCHCNT1_4_UPPER_CNT_UP_DCH1_Pos (0UL)                  /*!< ADC1 DCHCNT1_4_UPPER: CNT_UP_DCH1 (Bit 0)             */
#define ADC1_DCHCNT1_4_UPPER_CNT_UP_DCH1_Msk (0x3UL)                /*!< ADC1 DCHCNT1_4_UPPER: CNT_UP_DCH1 (Bitfield-Mask: 0x03) */
/* ====================================================  DCHTH1_4_LOWER  ===================================================== */
#define ADC1_DCHTH1_4_LOWER_DCH1_LOW_Pos  (0UL)                     /*!< ADC1 DCHTH1_4_LOWER: DCH1_LOW (Bit 0)                 */
#define ADC1_DCHTH1_4_LOWER_DCH1_LOW_Msk  (0xffUL)                  /*!< ADC1 DCHTH1_4_LOWER: DCH1_LOW (Bitfield-Mask: 0xff)   */
/* ====================================================  DCHTH1_4_UPPER  ===================================================== */
#define ADC1_DCHTH1_4_UPPER_DCH1_UP_Pos   (0UL)                     /*!< ADC1 DCHTH1_4_UPPER: DCH1_UP (Bit 0)                  */
#define ADC1_DCHTH1_4_UPPER_DCH1_UP_Msk   (0xffUL)                  /*!< ADC1 DCHTH1_4_UPPER: DCH1_UP (Bitfield-Mask: 0xff)    */
/* ======================================================  DIFFCH_OUT1  ====================================================== */
#define ADC1_DIFFCH_OUT1_DOF1_Pos         (18UL)                    /*!< ADC1 DIFFCH_OUT1: DOF1 (Bit 18)                       */
#define ADC1_DIFFCH_OUT1_DOF1_Msk         (0x40000UL)               /*!< ADC1 DIFFCH_OUT1: DOF1 (Bitfield-Mask: 0x01)          */
#define ADC1_DIFFCH_OUT1_DVF1_Pos         (17UL)                    /*!< ADC1 DIFFCH_OUT1: DVF1 (Bit 17)                       */
#define ADC1_DIFFCH_OUT1_DVF1_Msk         (0x20000UL)               /*!< ADC1 DIFFCH_OUT1: DVF1 (Bitfield-Mask: 0x01)          */
#define ADC1_DIFFCH_OUT1_DWFR1_Pos        (16UL)                    /*!< ADC1 DIFFCH_OUT1: DWFR1 (Bit 16)                      */
#define ADC1_DIFFCH_OUT1_DWFR1_Msk        (0x10000UL)               /*!< ADC1 DIFFCH_OUT1: DWFR1 (Bitfield-Mask: 0x01)         */
#define ADC1_DIFFCH_OUT1_DCH1_Pos         (0UL)                     /*!< ADC1 DIFFCH_OUT1: DCH1 (Bit 0)                        */
#define ADC1_DIFFCH_OUT1_DCH1_Msk         (0xfffUL)                 /*!< ADC1 DIFFCH_OUT1: DCH1 (Bitfield-Mask: 0xfff)         */
/* =======================================================  DUIN_SEL  ======================================================== */
#define ADC1_DUIN_SEL_DU1RES_NEG_Pos      (4UL)                     /*!< ADC1 DUIN_SEL: DU1RES_NEG (Bit 4)                     */
#define ADC1_DUIN_SEL_DU1RES_NEG_Msk      (0x10UL)                  /*!< ADC1 DUIN_SEL: DU1RES_NEG (Bitfield-Mask: 0x01)       */
#define ADC1_DUIN_SEL_DU1_EN_Pos          (0UL)                     /*!< ADC1 DUIN_SEL: DU1_EN (Bit 0)                         */
#define ADC1_DUIN_SEL_DU1_EN_Msk          (0x1UL)                   /*!< ADC1 DUIN_SEL: DU1_EN (Bitfield-Mask: 0x01)           */
/* =======================================================  FILT_OUT0  ======================================================= */
#define ADC1_FILT_OUT0_OF0_Pos            (18UL)                    /*!< ADC1 FILT_OUT0: OF0 (Bit 18)                          */
#define ADC1_FILT_OUT0_OF0_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT0: OF0 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT0_VF0_Pos            (17UL)                    /*!< ADC1 FILT_OUT0: VF0 (Bit 17)                          */
#define ADC1_FILT_OUT0_VF0_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT0: VF0 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT0_WFR0_Pos           (16UL)                    /*!< ADC1 FILT_OUT0: WFR0 (Bit 16)                         */
#define ADC1_FILT_OUT0_WFR0_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT0: WFR0 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT0_FILT_OUT_CH0_Pos   (0UL)                     /*!< ADC1 FILT_OUT0: FILT_OUT_CH0 (Bit 0)                  */
#define ADC1_FILT_OUT0_FILT_OUT_CH0_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT0: FILT_OUT_CH0 (Bitfield-Mask: 0xfff)   */
/* =======================================================  FILT_OUT1  ======================================================= */
#define ADC1_FILT_OUT1_OF1_Pos            (18UL)                    /*!< ADC1 FILT_OUT1: OF1 (Bit 18)                          */
#define ADC1_FILT_OUT1_OF1_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT1: OF1 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT1_VF1_Pos            (17UL)                    /*!< ADC1 FILT_OUT1: VF1 (Bit 17)                          */
#define ADC1_FILT_OUT1_VF1_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT1: VF1 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT1_WFR1_Pos           (16UL)                    /*!< ADC1 FILT_OUT1: WFR1 (Bit 16)                         */
#define ADC1_FILT_OUT1_WFR1_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT1: WFR1 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT1_FILT_OUT_CH1_Pos   (0UL)                     /*!< ADC1 FILT_OUT1: FILT_OUT_CH1 (Bit 0)                  */
#define ADC1_FILT_OUT1_FILT_OUT_CH1_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT1: FILT_OUT_CH1 (Bitfield-Mask: 0xfff)   */
/* ======================================================  FILT_OUT10  ======================================================= */
#define ADC1_FILT_OUT10_OF10_Pos          (18UL)                    /*!< ADC1 FILT_OUT10: OF10 (Bit 18)                        */
#define ADC1_FILT_OUT10_OF10_Msk          (0x40000UL)               /*!< ADC1 FILT_OUT10: OF10 (Bitfield-Mask: 0x01)           */
#define ADC1_FILT_OUT10_VF10_Pos          (17UL)                    /*!< ADC1 FILT_OUT10: VF10 (Bit 17)                        */
#define ADC1_FILT_OUT10_VF10_Msk          (0x20000UL)               /*!< ADC1 FILT_OUT10: VF10 (Bitfield-Mask: 0x01)           */
#define ADC1_FILT_OUT10_WFR10_Pos         (16UL)                    /*!< ADC1 FILT_OUT10: WFR10 (Bit 16)                       */
#define ADC1_FILT_OUT10_WFR10_Msk         (0x10000UL)               /*!< ADC1 FILT_OUT10: WFR10 (Bitfield-Mask: 0x01)          */
#define ADC1_FILT_OUT10_FILT_OUT_CH10_Pos (0UL)                     /*!< ADC1 FILT_OUT10: FILT_OUT_CH10 (Bit 0)                */
#define ADC1_FILT_OUT10_FILT_OUT_CH10_Msk (0xfffUL)                 /*!< ADC1 FILT_OUT10: FILT_OUT_CH10 (Bitfield-Mask: 0xfff) */
/* ======================================================  FILT_OUT11  ======================================================= */
#define ADC1_FILT_OUT11_OF11_Pos          (18UL)                    /*!< ADC1 FILT_OUT11: OF11 (Bit 18)                        */
#define ADC1_FILT_OUT11_OF11_Msk          (0x40000UL)               /*!< ADC1 FILT_OUT11: OF11 (Bitfield-Mask: 0x01)           */
#define ADC1_FILT_OUT11_VF11_Pos          (17UL)                    /*!< ADC1 FILT_OUT11: VF11 (Bit 17)                        */
#define ADC1_FILT_OUT11_VF11_Msk          (0x20000UL)               /*!< ADC1 FILT_OUT11: VF11 (Bitfield-Mask: 0x01)           */
#define ADC1_FILT_OUT11_WFR11_Pos         (16UL)                    /*!< ADC1 FILT_OUT11: WFR11 (Bit 16)                       */
#define ADC1_FILT_OUT11_WFR11_Msk         (0x10000UL)               /*!< ADC1 FILT_OUT11: WFR11 (Bitfield-Mask: 0x01)          */
#define ADC1_FILT_OUT11_FILT_OUT_CH11_Pos (0UL)                     /*!< ADC1 FILT_OUT11: FILT_OUT_CH11 (Bit 0)                */
#define ADC1_FILT_OUT11_FILT_OUT_CH11_Msk (0xfffUL)                 /*!< ADC1 FILT_OUT11: FILT_OUT_CH11 (Bitfield-Mask: 0xfff) */
/* ======================================================  FILT_OUT12  ======================================================= */
#define ADC1_FILT_OUT12_OF12_Pos          (18UL)                    /*!< ADC1 FILT_OUT12: OF12 (Bit 18)                        */
#define ADC1_FILT_OUT12_OF12_Msk          (0x40000UL)               /*!< ADC1 FILT_OUT12: OF12 (Bitfield-Mask: 0x01)           */
#define ADC1_FILT_OUT12_VF12_Pos          (17UL)                    /*!< ADC1 FILT_OUT12: VF12 (Bit 17)                        */
#define ADC1_FILT_OUT12_VF12_Msk          (0x20000UL)               /*!< ADC1 FILT_OUT12: VF12 (Bitfield-Mask: 0x01)           */
#define ADC1_FILT_OUT12_WFR12_Pos         (16UL)                    /*!< ADC1 FILT_OUT12: WFR12 (Bit 16)                       */
#define ADC1_FILT_OUT12_WFR12_Msk         (0x10000UL)               /*!< ADC1 FILT_OUT12: WFR12 (Bitfield-Mask: 0x01)          */
#define ADC1_FILT_OUT12_FILT_OUT_CH12_Pos (0UL)                     /*!< ADC1 FILT_OUT12: FILT_OUT_CH12 (Bit 0)                */
#define ADC1_FILT_OUT12_FILT_OUT_CH12_Msk (0xfffUL)                 /*!< ADC1 FILT_OUT12: FILT_OUT_CH12 (Bitfield-Mask: 0xfff) */
/* ======================================================  FILT_OUT13  ======================================================= */
#define ADC1_FILT_OUT13_OF13_Pos          (18UL)                    /*!< ADC1 FILT_OUT13: OF13 (Bit 18)                        */
#define ADC1_FILT_OUT13_OF13_Msk          (0x40000UL)               /*!< ADC1 FILT_OUT13: OF13 (Bitfield-Mask: 0x01)           */
#define ADC1_FILT_OUT13_VF13_Pos          (17UL)                    /*!< ADC1 FILT_OUT13: VF13 (Bit 17)                        */
#define ADC1_FILT_OUT13_VF13_Msk          (0x20000UL)               /*!< ADC1 FILT_OUT13: VF13 (Bitfield-Mask: 0x01)           */
#define ADC1_FILT_OUT13_WFR13_Pos         (16UL)                    /*!< ADC1 FILT_OUT13: WFR13 (Bit 16)                       */
#define ADC1_FILT_OUT13_WFR13_Msk         (0x10000UL)               /*!< ADC1 FILT_OUT13: WFR13 (Bitfield-Mask: 0x01)          */
#define ADC1_FILT_OUT13_FILT_OUT_CH13_Pos (0UL)                     /*!< ADC1 FILT_OUT13: FILT_OUT_CH13 (Bit 0)                */
#define ADC1_FILT_OUT13_FILT_OUT_CH13_Msk (0xfffUL)                 /*!< ADC1 FILT_OUT13: FILT_OUT_CH13 (Bitfield-Mask: 0xfff) */
/* =======================================================  FILT_OUT2  ======================================================= */
#define ADC1_FILT_OUT2_OF2_Pos            (18UL)                    /*!< ADC1 FILT_OUT2: OF2 (Bit 18)                          */
#define ADC1_FILT_OUT2_OF2_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT2: OF2 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT2_VF2_Pos            (17UL)                    /*!< ADC1 FILT_OUT2: VF2 (Bit 17)                          */
#define ADC1_FILT_OUT2_VF2_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT2: VF2 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT2_WFR2_Pos           (16UL)                    /*!< ADC1 FILT_OUT2: WFR2 (Bit 16)                         */
#define ADC1_FILT_OUT2_WFR2_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT2: WFR2 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT2_FILT_OUT_CH2_Pos   (0UL)                     /*!< ADC1 FILT_OUT2: FILT_OUT_CH2 (Bit 0)                  */
#define ADC1_FILT_OUT2_FILT_OUT_CH2_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT2: FILT_OUT_CH2 (Bitfield-Mask: 0xfff)   */
/* =======================================================  FILT_OUT3  ======================================================= */
#define ADC1_FILT_OUT3_OF3_Pos            (18UL)                    /*!< ADC1 FILT_OUT3: OF3 (Bit 18)                          */
#define ADC1_FILT_OUT3_OF3_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT3: OF3 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT3_VF3_Pos            (17UL)                    /*!< ADC1 FILT_OUT3: VF3 (Bit 17)                          */
#define ADC1_FILT_OUT3_VF3_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT3: VF3 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT3_WFR3_Pos           (16UL)                    /*!< ADC1 FILT_OUT3: WFR3 (Bit 16)                         */
#define ADC1_FILT_OUT3_WFR3_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT3: WFR3 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT3_FILT_OUT_CH3_Pos   (0UL)                     /*!< ADC1 FILT_OUT3: FILT_OUT_CH3 (Bit 0)                  */
#define ADC1_FILT_OUT3_FILT_OUT_CH3_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT3: FILT_OUT_CH3 (Bitfield-Mask: 0xfff)   */
/* =======================================================  FILT_OUT4  ======================================================= */
#define ADC1_FILT_OUT4_OF4_Pos            (18UL)                    /*!< ADC1 FILT_OUT4: OF4 (Bit 18)                          */
#define ADC1_FILT_OUT4_OF4_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT4: OF4 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT4_VF4_Pos            (17UL)                    /*!< ADC1 FILT_OUT4: VF4 (Bit 17)                          */
#define ADC1_FILT_OUT4_VF4_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT4: VF4 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT4_WFR4_Pos           (16UL)                    /*!< ADC1 FILT_OUT4: WFR4 (Bit 16)                         */
#define ADC1_FILT_OUT4_WFR4_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT4: WFR4 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT4_FILT_OUT_CH4_Pos   (0UL)                     /*!< ADC1 FILT_OUT4: FILT_OUT_CH4 (Bit 0)                  */
#define ADC1_FILT_OUT4_FILT_OUT_CH4_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT4: FILT_OUT_CH4 (Bitfield-Mask: 0xfff)   */
/* =======================================================  FILT_OUT5  ======================================================= */
#define ADC1_FILT_OUT5_OF5_Pos            (18UL)                    /*!< ADC1 FILT_OUT5: OF5 (Bit 18)                          */
#define ADC1_FILT_OUT5_OF5_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT5: OF5 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT5_VF5_Pos            (17UL)                    /*!< ADC1 FILT_OUT5: VF5 (Bit 17)                          */
#define ADC1_FILT_OUT5_VF5_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT5: VF5 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT5_WFR5_Pos           (16UL)                    /*!< ADC1 FILT_OUT5: WFR5 (Bit 16)                         */
#define ADC1_FILT_OUT5_WFR5_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT5: WFR5 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT5_FILT_OUT_CH5_Pos   (0UL)                     /*!< ADC1 FILT_OUT5: FILT_OUT_CH5 (Bit 0)                  */
#define ADC1_FILT_OUT5_FILT_OUT_CH5_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT5: FILT_OUT_CH5 (Bitfield-Mask: 0xfff)   */
/* =======================================================  FILT_OUT6  ======================================================= */
#define ADC1_FILT_OUT6_OF6_Pos            (18UL)                    /*!< ADC1 FILT_OUT6: OF6 (Bit 18)                          */
#define ADC1_FILT_OUT6_OF6_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT6: OF6 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT6_VF6_Pos            (17UL)                    /*!< ADC1 FILT_OUT6: VF6 (Bit 17)                          */
#define ADC1_FILT_OUT6_VF6_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT6: VF6 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT6_WFR6_Pos           (16UL)                    /*!< ADC1 FILT_OUT6: WFR6 (Bit 16)                         */
#define ADC1_FILT_OUT6_WFR6_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT6: WFR6 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT6_FILT_OUT_CH6_Pos   (0UL)                     /*!< ADC1 FILT_OUT6: FILT_OUT_CH6 (Bit 0)                  */
#define ADC1_FILT_OUT6_FILT_OUT_CH6_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT6: FILT_OUT_CH6 (Bitfield-Mask: 0xfff)   */
/* =======================================================  FILT_OUT7  ======================================================= */
#define ADC1_FILT_OUT7_OF7_Pos            (18UL)                    /*!< ADC1 FILT_OUT7: OF7 (Bit 18)                          */
#define ADC1_FILT_OUT7_OF7_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT7: OF7 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT7_VF7_Pos            (17UL)                    /*!< ADC1 FILT_OUT7: VF7 (Bit 17)                          */
#define ADC1_FILT_OUT7_VF7_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT7: VF7 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT7_WFR7_Pos           (16UL)                    /*!< ADC1 FILT_OUT7: WFR7 (Bit 16)                         */
#define ADC1_FILT_OUT7_WFR7_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT7: WFR7 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT7_FILT_OUT_CH7_Pos   (0UL)                     /*!< ADC1 FILT_OUT7: FILT_OUT_CH7 (Bit 0)                  */
#define ADC1_FILT_OUT7_FILT_OUT_CH7_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT7: FILT_OUT_CH7 (Bitfield-Mask: 0xfff)   */
/* =======================================================  FILT_OUT8  ======================================================= */
#define ADC1_FILT_OUT8_OF8_Pos            (18UL)                    /*!< ADC1 FILT_OUT8: OF8 (Bit 18)                          */
#define ADC1_FILT_OUT8_OF8_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT8: OF8 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT8_VF8_Pos            (17UL)                    /*!< ADC1 FILT_OUT8: VF8 (Bit 17)                          */
