Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
#define ADC1_FILT_OUT8_VF8_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT8: VF8 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT8_WFR8_Pos           (16UL)                    /*!< ADC1 FILT_OUT8: WFR8 (Bit 16)                         */
#define ADC1_FILT_OUT8_WFR8_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT8: WFR8 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT8_FILT_OUT_CH8_Pos   (0UL)                     /*!< ADC1 FILT_OUT8: FILT_OUT_CH8 (Bit 0)                  */
#define ADC1_FILT_OUT8_FILT_OUT_CH8_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT8: FILT_OUT_CH8 (Bitfield-Mask: 0xfff)   */
/* =======================================================  FILT_OUT9  ======================================================= */
#define ADC1_FILT_OUT9_OF9_Pos            (18UL)                    /*!< ADC1 FILT_OUT9: OF9 (Bit 18)                          */
#define ADC1_FILT_OUT9_OF9_Msk            (0x40000UL)               /*!< ADC1 FILT_OUT9: OF9 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT9_VF9_Pos            (17UL)                    /*!< ADC1 FILT_OUT9: VF9 (Bit 17)                          */
#define ADC1_FILT_OUT9_VF9_Msk            (0x20000UL)               /*!< ADC1 FILT_OUT9: VF9 (Bitfield-Mask: 0x01)             */
#define ADC1_FILT_OUT9_WFR9_Pos           (16UL)                    /*!< ADC1 FILT_OUT9: WFR9 (Bit 16)                         */
#define ADC1_FILT_OUT9_WFR9_Msk           (0x10000UL)               /*!< ADC1 FILT_OUT9: WFR9 (Bitfield-Mask: 0x01)            */
#define ADC1_FILT_OUT9_FILT_OUT_CH9_Pos   (0UL)                     /*!< ADC1 FILT_OUT9: FILT_OUT_CH9 (Bit 0)                  */
#define ADC1_FILT_OUT9_FILT_OUT_CH9_Msk   (0xfffUL)                 /*!< ADC1 FILT_OUT9: FILT_OUT_CH9 (Bitfield-Mask: 0xfff)   */
/* ======================================================  FILT_OUTEIM  ====================================================== */
#define ADC1_FILT_OUTEIM_OF_EIM_Pos       (18UL)                    /*!< ADC1 FILT_OUTEIM: OF_EIM (Bit 18)                     */
#define ADC1_FILT_OUTEIM_OF_EIM_Msk       (0x40000UL)               /*!< ADC1 FILT_OUTEIM: OF_EIM (Bitfield-Mask: 0x01)        */
#define ADC1_FILT_OUTEIM_VF_EIM_Pos       (17UL)                    /*!< ADC1 FILT_OUTEIM: VF_EIM (Bit 17)                     */
#define ADC1_FILT_OUTEIM_VF_EIM_Msk       (0x20000UL)               /*!< ADC1 FILT_OUTEIM: VF_EIM (Bitfield-Mask: 0x01)        */
#define ADC1_FILT_OUTEIM_WFR_EIM_Pos      (16UL)                    /*!< ADC1 FILT_OUTEIM: WFR_EIM (Bit 16)                    */
#define ADC1_FILT_OUTEIM_WFR_EIM_Msk      (0x10000UL)               /*!< ADC1 FILT_OUTEIM: WFR_EIM (Bitfield-Mask: 0x01)       */
#define ADC1_FILT_OUTEIM_FILT_OUT_EIM_Pos (0UL)                     /*!< ADC1 FILT_OUTEIM: FILT_OUT_EIM (Bit 0)                */
#define ADC1_FILT_OUTEIM_FILT_OUT_EIM_Msk (0xfffUL)                 /*!< ADC1 FILT_OUTEIM: FILT_OUT_EIM (Bitfield-Mask: 0xfff) */
/* ====================================================  FILT_UPLO_CTRL  ===================================================== */
#define ADC1_FILT_UPLO_CTRL_FUL_PP_CH7_EN_Pos (7UL)                 /*!< ADC1 FILT_UPLO_CTRL: FUL_PP_CH7_EN (Bit 7)            */
#define ADC1_FILT_UPLO_CTRL_FUL_PP_CH7_EN_Msk (0x80UL)              /*!< ADC1 FILT_UPLO_CTRL: FUL_PP_CH7_EN (Bitfield-Mask: 0x01) */
#define ADC1_FILT_UPLO_CTRL_FUL_PP_CH6_EN_Pos (6UL)                 /*!< ADC1 FILT_UPLO_CTRL: FUL_PP_CH6_EN (Bit 6)            */
#define ADC1_FILT_UPLO_CTRL_FUL_PP_CH6_EN_Msk (0x40UL)              /*!< ADC1 FILT_UPLO_CTRL: FUL_PP_CH6_EN (Bitfield-Mask: 0x01) */
#define ADC1_FILT_UPLO_CTRL_FUL_PP_CH5_EN_Pos (5UL)                 /*!< ADC1 FILT_UPLO_CTRL: FUL_PP_CH5_EN (Bit 5)            */
#define ADC1_FILT_UPLO_CTRL_FUL_PP_CH5_EN_Msk (0x20UL)              /*!< ADC1 FILT_UPLO_CTRL: FUL_PP_CH5_EN (Bitfield-Mask: 0x01) */
#define ADC1_FILT_UPLO_CTRL_FUL_PP_CH4_EN_Pos (4UL)                 /*!< ADC1 FILT_UPLO_CTRL: FUL_PP_CH4_EN (Bit 4)            */
#define ADC1_FILT_UPLO_CTRL_FUL_PP_CH4_EN_Msk (0x10UL)              /*!< ADC1 FILT_UPLO_CTRL: FUL_PP_CH4_EN (Bitfield-Mask: 0x01) */
#define ADC1_FILT_UPLO_CTRL_FUL_PP_CH3_EN_Pos (3UL)                 /*!< ADC1 FILT_UPLO_CTRL: FUL_PP_CH3_EN (Bit 3)            */
#define ADC1_FILT_UPLO_CTRL_FUL_PP_CH3_EN_Msk (0x8UL)               /*!< ADC1 FILT_UPLO_CTRL: FUL_PP_CH3_EN (Bitfield-Mask: 0x01) */
#define ADC1_FILT_UPLO_CTRL_FUL_PP_CH2_EN_Pos (2UL)                 /*!< ADC1 FILT_UPLO_CTRL: FUL_PP_CH2_EN (Bit 2)            */
#define ADC1_FILT_UPLO_CTRL_FUL_PP_CH2_EN_Msk (0x4UL)               /*!< ADC1 FILT_UPLO_CTRL: FUL_PP_CH2_EN (Bitfield-Mask: 0x01) */
#define ADC1_FILT_UPLO_CTRL_FUL_PP_CH1_EN_Pos (1UL)                 /*!< ADC1 FILT_UPLO_CTRL: FUL_PP_CH1_EN (Bit 1)            */
#define ADC1_FILT_UPLO_CTRL_FUL_PP_CH1_EN_Msk (0x2UL)               /*!< ADC1 FILT_UPLO_CTRL: FUL_PP_CH1_EN (Bitfield-Mask: 0x01) */
#define ADC1_FILT_UPLO_CTRL_FUL_PP_CH0_EN_Pos (0UL)                 /*!< ADC1 FILT_UPLO_CTRL: FUL_PP_CH0_EN (Bit 0)            */
#define ADC1_FILT_UPLO_CTRL_FUL_PP_CH0_EN_Msk (0x1UL)               /*!< ADC1 FILT_UPLO_CTRL: FUL_PP_CH0_EN (Bitfield-Mask: 0x01) */
/* =====================================================  FILTCOEFF0_13  ===================================================== */
#define ADC1_FILTCOEFF0_13_CH13_Pos       (26UL)                    /*!< ADC1 FILTCOEFF0_13: CH13 (Bit 26)                     */
#define ADC1_FILTCOEFF0_13_CH13_Msk       (0xc000000UL)             /*!< ADC1 FILTCOEFF0_13: CH13 (Bitfield-Mask: 0x03)        */
#define ADC1_FILTCOEFF0_13_CH12_Pos       (24UL)                    /*!< ADC1 FILTCOEFF0_13: CH12 (Bit 24)                     */
#define ADC1_FILTCOEFF0_13_CH12_Msk       (0x3000000UL)             /*!< ADC1 FILTCOEFF0_13: CH12 (Bitfield-Mask: 0x03)        */
#define ADC1_FILTCOEFF0_13_CH11_Pos       (22UL)                    /*!< ADC1 FILTCOEFF0_13: CH11 (Bit 22)                     */
#define ADC1_FILTCOEFF0_13_CH11_Msk       (0xc00000UL)              /*!< ADC1 FILTCOEFF0_13: CH11 (Bitfield-Mask: 0x03)        */
#define ADC1_FILTCOEFF0_13_CH10_Pos       (20UL)                    /*!< ADC1 FILTCOEFF0_13: CH10 (Bit 20)                     */
#define ADC1_FILTCOEFF0_13_CH10_Msk       (0x300000UL)              /*!< ADC1 FILTCOEFF0_13: CH10 (Bitfield-Mask: 0x03)        */
#define ADC1_FILTCOEFF0_13_CH9_Pos        (18UL)                    /*!< ADC1 FILTCOEFF0_13: CH9 (Bit 18)                      */
#define ADC1_FILTCOEFF0_13_CH9_Msk        (0xc0000UL)               /*!< ADC1 FILTCOEFF0_13: CH9 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_13_CH8_Pos        (16UL)                    /*!< ADC1 FILTCOEFF0_13: CH8 (Bit 16)                      */
#define ADC1_FILTCOEFF0_13_CH8_Msk        (0x30000UL)               /*!< ADC1 FILTCOEFF0_13: CH8 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_13_CH7_Pos        (14UL)                    /*!< ADC1 FILTCOEFF0_13: CH7 (Bit 14)                      */
#define ADC1_FILTCOEFF0_13_CH7_Msk        (0xc000UL)                /*!< ADC1 FILTCOEFF0_13: CH7 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_13_CH6_Pos        (12UL)                    /*!< ADC1 FILTCOEFF0_13: CH6 (Bit 12)                      */
#define ADC1_FILTCOEFF0_13_CH6_Msk        (0x3000UL)                /*!< ADC1 FILTCOEFF0_13: CH6 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_13_CH5_Pos        (10UL)                    /*!< ADC1 FILTCOEFF0_13: CH5 (Bit 10)                      */
#define ADC1_FILTCOEFF0_13_CH5_Msk        (0xc00UL)                 /*!< ADC1 FILTCOEFF0_13: CH5 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_13_CH4_Pos        (8UL)                     /*!< ADC1 FILTCOEFF0_13: CH4 (Bit 8)                       */
#define ADC1_FILTCOEFF0_13_CH4_Msk        (0x300UL)                 /*!< ADC1 FILTCOEFF0_13: CH4 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_13_CH3_Pos        (6UL)                     /*!< ADC1 FILTCOEFF0_13: CH3 (Bit 6)                       */
#define ADC1_FILTCOEFF0_13_CH3_Msk        (0xc0UL)                  /*!< ADC1 FILTCOEFF0_13: CH3 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_13_CH2_Pos        (4UL)                     /*!< ADC1 FILTCOEFF0_13: CH2 (Bit 4)                       */
#define ADC1_FILTCOEFF0_13_CH2_Msk        (0x30UL)                  /*!< ADC1 FILTCOEFF0_13: CH2 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_13_CH1_Pos        (2UL)                     /*!< ADC1 FILTCOEFF0_13: CH1 (Bit 2)                       */
#define ADC1_FILTCOEFF0_13_CH1_Msk        (0xcUL)                   /*!< ADC1 FILTCOEFF0_13: CH1 (Bitfield-Mask: 0x03)         */
#define ADC1_FILTCOEFF0_13_CH0_Pos        (0UL)                     /*!< ADC1 FILTCOEFF0_13: CH0 (Bit 0)                       */
#define ADC1_FILTCOEFF0_13_CH0_Msk        (0x3UL)                   /*!< ADC1 FILTCOEFF0_13: CH0 (Bitfield-Mask: 0x03)         */
/* =======================================================  IRQCLR_1  ======================================================== */
#define ADC1_IRQCLR_1_DU1UP_ISC_Pos       (25UL)                    /*!< ADC1 IRQCLR_1: DU1UP_ISC (Bit 25)                     */
#define ADC1_IRQCLR_1_DU1UP_ISC_Msk       (0x2000000UL)             /*!< ADC1 IRQCLR_1: DU1UP_ISC (Bitfield-Mask: 0x01)        */
#define ADC1_IRQCLR_1_DU1LO_ISC_Pos       (24UL)                    /*!< ADC1 IRQCLR_1: DU1LO_ISC (Bit 24)                     */
#define ADC1_IRQCLR_1_DU1LO_ISC_Msk       (0x1000000UL)             /*!< ADC1 IRQCLR_1: DU1LO_ISC (Bitfield-Mask: 0x01)        */
#define ADC1_IRQCLR_1_ESM_ISC_Pos         (17UL)                    /*!< ADC1 IRQCLR_1: ESM_ISC (Bit 17)                       */
#define ADC1_IRQCLR_1_ESM_ISC_Msk         (0x20000UL)               /*!< ADC1 IRQCLR_1: ESM_ISC (Bitfield-Mask: 0x01)          */
#define ADC1_IRQCLR_1_EIM_ISC_Pos         (16UL)                    /*!< ADC1 IRQCLR_1: EIM_ISC (Bit 16)                       */
#define ADC1_IRQCLR_1_EIM_ISC_Msk         (0x10000UL)               /*!< ADC1 IRQCLR_1: EIM_ISC (Bitfield-Mask: 0x01)          */
#define ADC1_IRQCLR_1_IIR_CH13_ISC_Pos    (13UL)                    /*!< ADC1 IRQCLR_1: IIR_CH13_ISC (Bit 13)                  */
#define ADC1_IRQCLR_1_IIR_CH13_ISC_Msk    (0x2000UL)                /*!< ADC1 IRQCLR_1: IIR_CH13_ISC (Bitfield-Mask: 0x01)     */
#define ADC1_IRQCLR_1_IIR_CH12_ISC_Pos    (12UL)                    /*!< ADC1 IRQCLR_1: IIR_CH12_ISC (Bit 12)                  */
#define ADC1_IRQCLR_1_IIR_CH12_ISC_Msk    (0x1000UL)                /*!< ADC1 IRQCLR_1: IIR_CH12_ISC (Bitfield-Mask: 0x01)     */
#define ADC1_IRQCLR_1_IIR_CH11_ISC_Pos    (11UL)                    /*!< ADC1 IRQCLR_1: IIR_CH11_ISC (Bit 11)                  */
#define ADC1_IRQCLR_1_IIR_CH11_ISC_Msk    (0x800UL)                 /*!< ADC1 IRQCLR_1: IIR_CH11_ISC (Bitfield-Mask: 0x01)     */
#define ADC1_IRQCLR_1_IIR_CH10_ISC_Pos    (10UL)                    /*!< ADC1 IRQCLR_1: IIR_CH10_ISC (Bit 10)                  */
#define ADC1_IRQCLR_1_IIR_CH10_ISC_Msk    (0x400UL)                 /*!< ADC1 IRQCLR_1: IIR_CH10_ISC (Bitfield-Mask: 0x01)     */
#define ADC1_IRQCLR_1_IIR_CH9_ISC_Pos     (9UL)                     /*!< ADC1 IRQCLR_1: IIR_CH9_ISC (Bit 9)                    */
#define ADC1_IRQCLR_1_IIR_CH9_ISC_Msk     (0x200UL)                 /*!< ADC1 IRQCLR_1: IIR_CH9_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_1_IIR_CH8_ISC_Pos     (8UL)                     /*!< ADC1 IRQCLR_1: IIR_CH8_ISC (Bit 8)                    */
#define ADC1_IRQCLR_1_IIR_CH8_ISC_Msk     (0x100UL)                 /*!< ADC1 IRQCLR_1: IIR_CH8_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_1_IIR_CH7_ISC_Pos     (7UL)                     /*!< ADC1 IRQCLR_1: IIR_CH7_ISC (Bit 7)                    */
#define ADC1_IRQCLR_1_IIR_CH7_ISC_Msk     (0x80UL)                  /*!< ADC1 IRQCLR_1: IIR_CH7_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_1_IIR_CH6_ISC_Pos     (6UL)                     /*!< ADC1 IRQCLR_1: IIR_CH6_ISC (Bit 6)                    */
#define ADC1_IRQCLR_1_IIR_CH6_ISC_Msk     (0x40UL)                  /*!< ADC1 IRQCLR_1: IIR_CH6_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_1_IIR_CH5_ISC_Pos     (5UL)                     /*!< ADC1 IRQCLR_1: IIR_CH5_ISC (Bit 5)                    */
#define ADC1_IRQCLR_1_IIR_CH5_ISC_Msk     (0x20UL)                  /*!< ADC1 IRQCLR_1: IIR_CH5_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_1_IIR_CH4_ISC_Pos     (4UL)                     /*!< ADC1 IRQCLR_1: IIR_CH4_ISC (Bit 4)                    */
#define ADC1_IRQCLR_1_IIR_CH4_ISC_Msk     (0x10UL)                  /*!< ADC1 IRQCLR_1: IIR_CH4_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_1_IIR_CH3_ISC_Pos     (3UL)                     /*!< ADC1 IRQCLR_1: IIR_CH3_ISC (Bit 3)                    */
#define ADC1_IRQCLR_1_IIR_CH3_ISC_Msk     (0x8UL)                   /*!< ADC1 IRQCLR_1: IIR_CH3_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_1_IIR_CH2_ISC_Pos     (2UL)                     /*!< ADC1 IRQCLR_1: IIR_CH2_ISC (Bit 2)                    */
#define ADC1_IRQCLR_1_IIR_CH2_ISC_Msk     (0x4UL)                   /*!< ADC1 IRQCLR_1: IIR_CH2_ISC (Bitfield-Mask: 0x01)      */
#define ADC1_IRQCLR_1_VS_ISC_Pos          (1UL)                     /*!< ADC1 IRQCLR_1: VS_ISC (Bit 1)                         */
#define ADC1_IRQCLR_1_VS_ISC_Msk          (0x2UL)                   /*!< ADC1 IRQCLR_1: VS_ISC (Bitfield-Mask: 0x01)           */
#define ADC1_IRQCLR_1_IIR_CH0_ISC_Pos     (0UL)                     /*!< ADC1 IRQCLR_1: IIR_CH0_ISC (Bit 0)                    */
#define ADC1_IRQCLR_1_IIR_CH0_ISC_Msk     (0x1UL)                   /*!< ADC1 IRQCLR_1: IIR_CH0_ISC (Bitfield-Mask: 0x01)      */
/* =======================================================  IRQCLR_2  ======================================================== */
#define ADC1_IRQCLR_2_PP_CH7_UP_ISC_Pos   (23UL)                    /*!< ADC1 IRQCLR_2: PP_CH7_UP_ISC (Bit 23)                 */
#define ADC1_IRQCLR_2_PP_CH7_UP_ISC_Msk   (0x800000UL)              /*!< ADC1 IRQCLR_2: PP_CH7_UP_ISC (Bitfield-Mask: 0x01)    */
#define ADC1_IRQCLR_2_PP_CH6_UP_ISC_Pos   (22UL)                    /*!< ADC1 IRQCLR_2: PP_CH6_UP_ISC (Bit 22)                 */
#define ADC1_IRQCLR_2_PP_CH6_UP_ISC_Msk   (0x400000UL)              /*!< ADC1 IRQCLR_2: PP_CH6_UP_ISC (Bitfield-Mask: 0x01)    */
#define ADC1_IRQCLR_2_PP_CH5_UP_ISC_Pos   (21UL)                    /*!< ADC1 IRQCLR_2: PP_CH5_UP_ISC (Bit 21)                 */
#define ADC1_IRQCLR_2_PP_CH5_UP_ISC_Msk   (0x200000UL)              /*!< ADC1 IRQCLR_2: PP_CH5_UP_ISC (Bitfield-Mask: 0x01)    */
#define ADC1_IRQCLR_2_PP_CH4_UP_ISC_Pos   (20UL)                    /*!< ADC1 IRQCLR_2: PP_CH4_UP_ISC (Bit 20)                 */
#define ADC1_IRQCLR_2_PP_CH4_UP_ISC_Msk   (0x100000UL)              /*!< ADC1 IRQCLR_2: PP_CH4_UP_ISC (Bitfield-Mask: 0x01)    */
#define ADC1_IRQCLR_2_PP_CH3_UP_ISC_Pos   (19UL)                    /*!< ADC1 IRQCLR_2: PP_CH3_UP_ISC (Bit 19)                 */
#define ADC1_IRQCLR_2_PP_CH3_UP_ISC_Msk   (0x80000UL)               /*!< ADC1 IRQCLR_2: PP_CH3_UP_ISC (Bitfield-Mask: 0x01)    */
#define ADC1_IRQCLR_2_PP_CH2_UP_ISC_Pos   (18UL)                    /*!< ADC1 IRQCLR_2: PP_CH2_UP_ISC (Bit 18)                 */
#define ADC1_IRQCLR_2_PP_CH2_UP_ISC_Msk   (0x40000UL)               /*!< ADC1 IRQCLR_2: PP_CH2_UP_ISC (Bitfield-Mask: 0x01)    */
#define ADC1_IRQCLR_2_VS_UP_ISC_Pos       (17UL)                    /*!< ADC1 IRQCLR_2: VS_UP_ISC (Bit 17)                     */
#define ADC1_IRQCLR_2_VS_UP_ISC_Msk       (0x20000UL)               /*!< ADC1 IRQCLR_2: VS_UP_ISC (Bitfield-Mask: 0x01)        */
#define ADC1_IRQCLR_2_PP_CH0_UP_ISC_Pos   (16UL)                    /*!< ADC1 IRQCLR_2: PP_CH0_UP_ISC (Bit 16)                 */
#define ADC1_IRQCLR_2_PP_CH0_UP_ISC_Msk   (0x10000UL)               /*!< ADC1 IRQCLR_2: PP_CH0_UP_ISC (Bitfield-Mask: 0x01)    */
#define ADC1_IRQCLR_2_PP_CH7_LO_ISC_Pos   (7UL)                     /*!< ADC1 IRQCLR_2: PP_CH7_LO_ISC (Bit 7)                  */
#define ADC1_IRQCLR_2_PP_CH7_LO_ISC_Msk   (0x80UL)                  /*!< ADC1 IRQCLR_2: PP_CH7_LO_ISC (Bitfield-Mask: 0x01)    */
#define ADC1_IRQCLR_2_PP_CH6_LO_ISC_Pos   (6UL)                     /*!< ADC1 IRQCLR_2: PP_CH6_LO_ISC (Bit 6)                  */
#define ADC1_IRQCLR_2_PP_CH6_LO_ISC_Msk   (0x40UL)                  /*!< ADC1 IRQCLR_2: PP_CH6_LO_ISC (Bitfield-Mask: 0x01)    */
#define ADC1_IRQCLR_2_PP_CH5_LO_ISC_Pos   (5UL)                     /*!< ADC1 IRQCLR_2: PP_CH5_LO_ISC (Bit 5)                  */
#define ADC1_IRQCLR_2_PP_CH5_LO_ISC_Msk   (0x20UL)                  /*!< ADC1 IRQCLR_2: PP_CH5_LO_ISC (Bitfield-Mask: 0x01)    */
#define ADC1_IRQCLR_2_PP_CH4_LO_ISC_Pos   (4UL)                     /*!< ADC1 IRQCLR_2: PP_CH4_LO_ISC (Bit 4)                  */
#define ADC1_IRQCLR_2_PP_CH4_LO_ISC_Msk   (0x10UL)                  /*!< ADC1 IRQCLR_2: PP_CH4_LO_ISC (Bitfield-Mask: 0x01)    */
#define ADC1_IRQCLR_2_PP_CH3_LO_ISC_Pos   (3UL)                     /*!< ADC1 IRQCLR_2: PP_CH3_LO_ISC (Bit 3)                  */
#define ADC1_IRQCLR_2_PP_CH3_LO_ISC_Msk   (0x8UL)                   /*!< ADC1 IRQCLR_2: PP_CH3_LO_ISC (Bitfield-Mask: 0x01)    */
#define ADC1_IRQCLR_2_PP_CH2_LO_ISC_Pos   (2UL)                     /*!< ADC1 IRQCLR_2: PP_CH2_LO_ISC (Bit 2)                  */
#define ADC1_IRQCLR_2_PP_CH2_LO_ISC_Msk   (0x4UL)                   /*!< ADC1 IRQCLR_2: PP_CH2_LO_ISC (Bitfield-Mask: 0x01)    */
#define ADC1_IRQCLR_2_VS_LO_ISC_Pos       (1UL)                     /*!< ADC1 IRQCLR_2: VS_LO_ISC (Bit 1)                      */
#define ADC1_IRQCLR_2_VS_LO_ISC_Msk       (0x2UL)                   /*!< ADC1 IRQCLR_2: VS_LO_ISC (Bitfield-Mask: 0x01)        */
#define ADC1_IRQCLR_2_PP_CH0_LO_ISC_Pos   (0UL)                     /*!< ADC1 IRQCLR_2: PP_CH0_LO_ISC (Bit 0)                  */
#define ADC1_IRQCLR_2_PP_CH0_LO_ISC_Msk   (0x1UL)                   /*!< ADC1 IRQCLR_2: PP_CH0_LO_ISC (Bitfield-Mask: 0x01)    */
/* ========================================================  IRQEN_1  ======================================================== */
#define ADC1_IRQEN_1_DU1UP_IEN_Pos        (25UL)                    /*!< ADC1 IRQEN_1: DU1UP_IEN (Bit 25)                      */
#define ADC1_IRQEN_1_DU1UP_IEN_Msk        (0x2000000UL)             /*!< ADC1 IRQEN_1: DU1UP_IEN (Bitfield-Mask: 0x01)         */
#define ADC1_IRQEN_1_DU1LO_IEN_Pos        (24UL)                    /*!< ADC1 IRQEN_1: DU1LO_IEN (Bit 24)                      */
#define ADC1_IRQEN_1_DU1LO_IEN_Msk        (0x1000000UL)             /*!< ADC1 IRQEN_1: DU1LO_IEN (Bitfield-Mask: 0x01)         */
#define ADC1_IRQEN_1_ESM_IEN_Pos          (17UL)                    /*!< ADC1 IRQEN_1: ESM_IEN (Bit 17)                        */
#define ADC1_IRQEN_1_ESM_IEN_Msk          (0x20000UL)               /*!< ADC1 IRQEN_1: ESM_IEN (Bitfield-Mask: 0x01)           */
#define ADC1_IRQEN_1_EIM_IEN_Pos          (16UL)                    /*!< ADC1 IRQEN_1: EIM_IEN (Bit 16)                        */
#define ADC1_IRQEN_1_EIM_IEN_Msk          (0x10000UL)               /*!< ADC1 IRQEN_1: EIM_IEN (Bitfield-Mask: 0x01)           */
#define ADC1_IRQEN_1_IIR_CH13_IEN_Pos     (13UL)                    /*!< ADC1 IRQEN_1: IIR_CH13_IEN (Bit 13)                   */
#define ADC1_IRQEN_1_IIR_CH13_IEN_Msk     (0x2000UL)                /*!< ADC1 IRQEN_1: IIR_CH13_IEN (Bitfield-Mask: 0x01)      */
#define ADC1_IRQEN_1_IIR_CH12_IEN_Pos     (12UL)                    /*!< ADC1 IRQEN_1: IIR_CH12_IEN (Bit 12)                   */
#define ADC1_IRQEN_1_IIR_CH12_IEN_Msk     (0x1000UL)                /*!< ADC1 IRQEN_1: IIR_CH12_IEN (Bitfield-Mask: 0x01)      */
#define ADC1_IRQEN_1_IIR_CH11_IEN_Pos     (11UL)                    /*!< ADC1 IRQEN_1: IIR_CH11_IEN (Bit 11)                   */
#define ADC1_IRQEN_1_IIR_CH11_IEN_Msk     (0x800UL)                 /*!< ADC1 IRQEN_1: IIR_CH11_IEN (Bitfield-Mask: 0x01)      */
#define ADC1_IRQEN_1_IIR_CH10_IEN_Pos     (10UL)                    /*!< ADC1 IRQEN_1: IIR_CH10_IEN (Bit 10)                   */
#define ADC1_IRQEN_1_IIR_CH10_IEN_Msk     (0x400UL)                 /*!< ADC1 IRQEN_1: IIR_CH10_IEN (Bitfield-Mask: 0x01)      */
#define ADC1_IRQEN_1_IIR_CH9_IEN_Pos      (9UL)                     /*!< ADC1 IRQEN_1: IIR_CH9_IEN (Bit 9)                     */
#define ADC1_IRQEN_1_IIR_CH9_IEN_Msk      (0x200UL)                 /*!< ADC1 IRQEN_1: IIR_CH9_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_1_IIR_CH8_IEN_Pos      (8UL)                     /*!< ADC1 IRQEN_1: IIR_CH8_IEN (Bit 8)                     */
#define ADC1_IRQEN_1_IIR_CH8_IEN_Msk      (0x100UL)                 /*!< ADC1 IRQEN_1: IIR_CH8_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_1_IIR_CH7_IEN_Pos      (7UL)                     /*!< ADC1 IRQEN_1: IIR_CH7_IEN (Bit 7)                     */
#define ADC1_IRQEN_1_IIR_CH7_IEN_Msk      (0x80UL)                  /*!< ADC1 IRQEN_1: IIR_CH7_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_1_IIR_CH6_IEN_Pos      (6UL)                     /*!< ADC1 IRQEN_1: IIR_CH6_IEN (Bit 6)                     */
#define ADC1_IRQEN_1_IIR_CH6_IEN_Msk      (0x40UL)                  /*!< ADC1 IRQEN_1: IIR_CH6_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_1_IIR_CH5_IEN_Pos      (5UL)                     /*!< ADC1 IRQEN_1: IIR_CH5_IEN (Bit 5)                     */
#define ADC1_IRQEN_1_IIR_CH5_IEN_Msk      (0x20UL)                  /*!< ADC1 IRQEN_1: IIR_CH5_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_1_IIR_CH4_IEN_Pos      (4UL)                     /*!< ADC1 IRQEN_1: IIR_CH4_IEN (Bit 4)                     */
#define ADC1_IRQEN_1_IIR_CH4_IEN_Msk      (0x10UL)                  /*!< ADC1 IRQEN_1: IIR_CH4_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_1_IIR_CH3_IEN_Pos      (3UL)                     /*!< ADC1 IRQEN_1: IIR_CH3_IEN (Bit 3)                     */
#define ADC1_IRQEN_1_IIR_CH3_IEN_Msk      (0x8UL)                   /*!< ADC1 IRQEN_1: IIR_CH3_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_1_IIR_CH2_IEN_Pos      (2UL)                     /*!< ADC1 IRQEN_1: IIR_CH2_IEN (Bit 2)                     */
#define ADC1_IRQEN_1_IIR_CH2_IEN_Msk      (0x4UL)                   /*!< ADC1 IRQEN_1: IIR_CH2_IEN (Bitfield-Mask: 0x01)       */
#define ADC1_IRQEN_1_VS_IEN_Pos           (1UL)                     /*!< ADC1 IRQEN_1: VS_IEN (Bit 1)                          */
#define ADC1_IRQEN_1_VS_IEN_Msk           (0x2UL)                   /*!< ADC1 IRQEN_1: VS_IEN (Bitfield-Mask: 0x01)            */
#define ADC1_IRQEN_1_IIR_CH0_IEN_Pos      (0UL)                     /*!< ADC1 IRQEN_1: IIR_CH0_IEN (Bit 0)                     */
#define ADC1_IRQEN_1_IIR_CH0_IEN_Msk      (0x1UL)                   /*!< ADC1 IRQEN_1: IIR_CH0_IEN (Bitfield-Mask: 0x01)       */
/* ========================================================  IRQEN_2  ======================================================== */
#define ADC1_IRQEN_2_PP_CH7_UP_IEN_Pos    (23UL)                    /*!< ADC1 IRQEN_2: PP_CH7_UP_IEN (Bit 23)                  */
#define ADC1_IRQEN_2_PP_CH7_UP_IEN_Msk    (0x800000UL)              /*!< ADC1 IRQEN_2: PP_CH7_UP_IEN (Bitfield-Mask: 0x01)     */
#define ADC1_IRQEN_2_PP_CH6_UP_IEN_Pos    (22UL)                    /*!< ADC1 IRQEN_2: PP_CH6_UP_IEN (Bit 22)                  */
#define ADC1_IRQEN_2_PP_CH6_UP_IEN_Msk    (0x400000UL)              /*!< ADC1 IRQEN_2: PP_CH6_UP_IEN (Bitfield-Mask: 0x01)     */
#define ADC1_IRQEN_2_PP_CH5_UP_IEN_Pos    (21UL)                    /*!< ADC1 IRQEN_2: PP_CH5_UP_IEN (Bit 21)                  */
#define ADC1_IRQEN_2_PP_CH5_UP_IEN_Msk    (0x200000UL)              /*!< ADC1 IRQEN_2: PP_CH5_UP_IEN (Bitfield-Mask: 0x01)     */
#define ADC1_IRQEN_2_PP_CH4_UP_IEN_Pos    (20UL)                    /*!< ADC1 IRQEN_2: PP_CH4_UP_IEN (Bit 20)                  */
