Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
#define ADC1_IRQEN_2_PP_CH4_UP_IEN_Msk    (0x100000UL)              /*!< ADC1 IRQEN_2: PP_CH4_UP_IEN (Bitfield-Mask: 0x01)     */
#define ADC1_IRQEN_2_PP_CH3_UP_IEN_Pos    (19UL)                    /*!< ADC1 IRQEN_2: PP_CH3_UP_IEN (Bit 19)                  */
#define ADC1_IRQEN_2_PP_CH3_UP_IEN_Msk    (0x80000UL)               /*!< ADC1 IRQEN_2: PP_CH3_UP_IEN (Bitfield-Mask: 0x01)     */
#define ADC1_IRQEN_2_PP_CH2_UP_IEN_Pos    (18UL)                    /*!< ADC1 IRQEN_2: PP_CH2_UP_IEN (Bit 18)                  */
#define ADC1_IRQEN_2_PP_CH2_UP_IEN_Msk    (0x40000UL)               /*!< ADC1 IRQEN_2: PP_CH2_UP_IEN (Bitfield-Mask: 0x01)     */
#define ADC1_IRQEN_2_VS_UP_IEN_Pos        (17UL)                    /*!< ADC1 IRQEN_2: VS_UP_IEN (Bit 17)                      */
#define ADC1_IRQEN_2_VS_UP_IEN_Msk        (0x20000UL)               /*!< ADC1 IRQEN_2: VS_UP_IEN (Bitfield-Mask: 0x01)         */
#define ADC1_IRQEN_2_PP_CH0_UP_IEN_Pos    (16UL)                    /*!< ADC1 IRQEN_2: PP_CH0_UP_IEN (Bit 16)                  */
#define ADC1_IRQEN_2_PP_CH0_UP_IEN_Msk    (0x10000UL)               /*!< ADC1 IRQEN_2: PP_CH0_UP_IEN (Bitfield-Mask: 0x01)     */
#define ADC1_IRQEN_2_PP_CH7_LO_IEN_Pos    (7UL)                     /*!< ADC1 IRQEN_2: PP_CH7_LO_IEN (Bit 7)                   */
#define ADC1_IRQEN_2_PP_CH7_LO_IEN_Msk    (0x80UL)                  /*!< ADC1 IRQEN_2: PP_CH7_LO_IEN (Bitfield-Mask: 0x01)     */
#define ADC1_IRQEN_2_PP_CH6_LO_IEN_Pos    (6UL)                     /*!< ADC1 IRQEN_2: PP_CH6_LO_IEN (Bit 6)                   */
#define ADC1_IRQEN_2_PP_CH6_LO_IEN_Msk    (0x40UL)                  /*!< ADC1 IRQEN_2: PP_CH6_LO_IEN (Bitfield-Mask: 0x01)     */
#define ADC1_IRQEN_2_PP_CH5_LO_IEN_Pos    (5UL)                     /*!< ADC1 IRQEN_2: PP_CH5_LO_IEN (Bit 5)                   */
#define ADC1_IRQEN_2_PP_CH5_LO_IEN_Msk    (0x20UL)                  /*!< ADC1 IRQEN_2: PP_CH5_LO_IEN (Bitfield-Mask: 0x01)     */
#define ADC1_IRQEN_2_PP_CH4_LO_IEN_Pos    (4UL)                     /*!< ADC1 IRQEN_2: PP_CH4_LO_IEN (Bit 4)                   */
#define ADC1_IRQEN_2_PP_CH4_LO_IEN_Msk    (0x10UL)                  /*!< ADC1 IRQEN_2: PP_CH4_LO_IEN (Bitfield-Mask: 0x01)     */
#define ADC1_IRQEN_2_PP_CH3_LO_IEN_Pos    (3UL)                     /*!< ADC1 IRQEN_2: PP_CH3_LO_IEN (Bit 3)                   */
#define ADC1_IRQEN_2_PP_CH3_LO_IEN_Msk    (0x8UL)                   /*!< ADC1 IRQEN_2: PP_CH3_LO_IEN (Bitfield-Mask: 0x01)     */
#define ADC1_IRQEN_2_PP_CH2_LO_IEN_Pos    (2UL)                     /*!< ADC1 IRQEN_2: PP_CH2_LO_IEN (Bit 2)                   */
#define ADC1_IRQEN_2_PP_CH2_LO_IEN_Msk    (0x4UL)                   /*!< ADC1 IRQEN_2: PP_CH2_LO_IEN (Bitfield-Mask: 0x01)     */
#define ADC1_IRQEN_2_VS_LO_IEN_Pos        (1UL)                     /*!< ADC1 IRQEN_2: VS_LO_IEN (Bit 1)                       */
#define ADC1_IRQEN_2_VS_LO_IEN_Msk        (0x2UL)                   /*!< ADC1 IRQEN_2: VS_LO_IEN (Bitfield-Mask: 0x01)         */
#define ADC1_IRQEN_2_PP_CH0_LO_IEN_Pos    (0UL)                     /*!< ADC1 IRQEN_2: PP_CH0_LO_IEN (Bit 0)                   */
#define ADC1_IRQEN_2_PP_CH0_LO_IEN_Msk    (0x1UL)                   /*!< ADC1 IRQEN_2: PP_CH0_LO_IEN (Bitfield-Mask: 0x01)     */
/* ========================================================  IRQS_1  ========================================================= */
#define ADC1_IRQS_1_DU1UP_IS_Pos          (25UL)                    /*!< ADC1 IRQS_1: DU1UP_IS (Bit 25)                        */
#define ADC1_IRQS_1_DU1UP_IS_Msk          (0x2000000UL)             /*!< ADC1 IRQS_1: DU1UP_IS (Bitfield-Mask: 0x01)           */
#define ADC1_IRQS_1_DU1LO_IS_Pos          (24UL)                    /*!< ADC1 IRQS_1: DU1LO_IS (Bit 24)                        */
#define ADC1_IRQS_1_DU1LO_IS_Msk          (0x1000000UL)             /*!< ADC1 IRQS_1: DU1LO_IS (Bitfield-Mask: 0x01)           */
#define ADC1_IRQS_1_ESM_IS_Pos            (17UL)                    /*!< ADC1 IRQS_1: ESM_IS (Bit 17)                          */
#define ADC1_IRQS_1_ESM_IS_Msk            (0x20000UL)               /*!< ADC1 IRQS_1: ESM_IS (Bitfield-Mask: 0x01)             */
#define ADC1_IRQS_1_EIM_IS_Pos            (16UL)                    /*!< ADC1 IRQS_1: EIM_IS (Bit 16)                          */
#define ADC1_IRQS_1_EIM_IS_Msk            (0x10000UL)               /*!< ADC1 IRQS_1: EIM_IS (Bitfield-Mask: 0x01)             */
#define ADC1_IRQS_1_IIR_CH13_IS_Pos       (13UL)                    /*!< ADC1 IRQS_1: IIR_CH13_IS (Bit 13)                     */
#define ADC1_IRQS_1_IIR_CH13_IS_Msk       (0x2000UL)                /*!< ADC1 IRQS_1: IIR_CH13_IS (Bitfield-Mask: 0x01)        */
#define ADC1_IRQS_1_IIR_CH12_IS_Pos       (12UL)                    /*!< ADC1 IRQS_1: IIR_CH12_IS (Bit 12)                     */
#define ADC1_IRQS_1_IIR_CH12_IS_Msk       (0x1000UL)                /*!< ADC1 IRQS_1: IIR_CH12_IS (Bitfield-Mask: 0x01)        */
#define ADC1_IRQS_1_IIR_CH11_IS_Pos       (11UL)                    /*!< ADC1 IRQS_1: IIR_CH11_IS (Bit 11)                     */
#define ADC1_IRQS_1_IIR_CH11_IS_Msk       (0x800UL)                 /*!< ADC1 IRQS_1: IIR_CH11_IS (Bitfield-Mask: 0x01)        */
#define ADC1_IRQS_1_IIR_CH10_IS_Pos       (10UL)                    /*!< ADC1 IRQS_1: IIR_CH10_IS (Bit 10)                     */
#define ADC1_IRQS_1_IIR_CH10_IS_Msk       (0x400UL)                 /*!< ADC1 IRQS_1: IIR_CH10_IS (Bitfield-Mask: 0x01)        */
#define ADC1_IRQS_1_IIR_CH9_IS_Pos        (9UL)                     /*!< ADC1 IRQS_1: IIR_CH9_IS (Bit 9)                       */
#define ADC1_IRQS_1_IIR_CH9_IS_Msk        (0x200UL)                 /*!< ADC1 IRQS_1: IIR_CH9_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_1_IIR_CH8_IS_Pos        (8UL)                     /*!< ADC1 IRQS_1: IIR_CH8_IS (Bit 8)                       */
#define ADC1_IRQS_1_IIR_CH8_IS_Msk        (0x100UL)                 /*!< ADC1 IRQS_1: IIR_CH8_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_1_IIR_CH7_IS_Pos        (7UL)                     /*!< ADC1 IRQS_1: IIR_CH7_IS (Bit 7)                       */
#define ADC1_IRQS_1_IIR_CH7_IS_Msk        (0x80UL)                  /*!< ADC1 IRQS_1: IIR_CH7_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_1_IIR_CH6_IS_Pos        (6UL)                     /*!< ADC1 IRQS_1: IIR_CH6_IS (Bit 6)                       */
#define ADC1_IRQS_1_IIR_CH6_IS_Msk        (0x40UL)                  /*!< ADC1 IRQS_1: IIR_CH6_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_1_IIR_CH5_IS_Pos        (5UL)                     /*!< ADC1 IRQS_1: IIR_CH5_IS (Bit 5)                       */
#define ADC1_IRQS_1_IIR_CH5_IS_Msk        (0x20UL)                  /*!< ADC1 IRQS_1: IIR_CH5_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_1_IIR_CH4_IS_Pos        (4UL)                     /*!< ADC1 IRQS_1: IIR_CH4_IS (Bit 4)                       */
#define ADC1_IRQS_1_IIR_CH4_IS_Msk        (0x10UL)                  /*!< ADC1 IRQS_1: IIR_CH4_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_1_IIR_CH3_IS_Pos        (3UL)                     /*!< ADC1 IRQS_1: IIR_CH3_IS (Bit 3)                       */
#define ADC1_IRQS_1_IIR_CH3_IS_Msk        (0x8UL)                   /*!< ADC1 IRQS_1: IIR_CH3_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_1_IIR_CH2_IS_Pos        (2UL)                     /*!< ADC1 IRQS_1: IIR_CH2_IS (Bit 2)                       */
#define ADC1_IRQS_1_IIR_CH2_IS_Msk        (0x4UL)                   /*!< ADC1 IRQS_1: IIR_CH2_IS (Bitfield-Mask: 0x01)         */
#define ADC1_IRQS_1_VS_IS_Pos             (1UL)                     /*!< ADC1 IRQS_1: VS_IS (Bit 1)                            */
#define ADC1_IRQS_1_VS_IS_Msk             (0x2UL)                   /*!< ADC1 IRQS_1: VS_IS (Bitfield-Mask: 0x01)              */
#define ADC1_IRQS_1_IIR_CH0_IS_Pos        (0UL)                     /*!< ADC1 IRQS_1: IIR_CH0_IS (Bit 0)                       */
#define ADC1_IRQS_1_IIR_CH0_IS_Msk        (0x1UL)                   /*!< ADC1 IRQS_1: IIR_CH0_IS (Bitfield-Mask: 0x01)         */
/* ========================================================  IRQS_2  ========================================================= */
#define ADC1_IRQS_2_PP_CH7_UP_IS_Pos      (23UL)                    /*!< ADC1 IRQS_2: PP_CH7_UP_IS (Bit 23)                    */
#define ADC1_IRQS_2_PP_CH7_UP_IS_Msk      (0x800000UL)              /*!< ADC1 IRQS_2: PP_CH7_UP_IS (Bitfield-Mask: 0x01)       */
#define ADC1_IRQS_2_PP_CH6_UP_IS_Pos      (22UL)                    /*!< ADC1 IRQS_2: PP_CH6_UP_IS (Bit 22)                    */
#define ADC1_IRQS_2_PP_CH6_UP_IS_Msk      (0x400000UL)              /*!< ADC1 IRQS_2: PP_CH6_UP_IS (Bitfield-Mask: 0x01)       */
#define ADC1_IRQS_2_PP_CH5_UP_IS_Pos      (21UL)                    /*!< ADC1 IRQS_2: PP_CH5_UP_IS (Bit 21)                    */
#define ADC1_IRQS_2_PP_CH5_UP_IS_Msk      (0x200000UL)              /*!< ADC1 IRQS_2: PP_CH5_UP_IS (Bitfield-Mask: 0x01)       */
#define ADC1_IRQS_2_PP_CH4_UP_IS_Pos      (20UL)                    /*!< ADC1 IRQS_2: PP_CH4_UP_IS (Bit 20)                    */
#define ADC1_IRQS_2_PP_CH4_UP_IS_Msk      (0x100000UL)              /*!< ADC1 IRQS_2: PP_CH4_UP_IS (Bitfield-Mask: 0x01)       */
#define ADC1_IRQS_2_PP_CH3_UP_IS_Pos      (19UL)                    /*!< ADC1 IRQS_2: PP_CH3_UP_IS (Bit 19)                    */
#define ADC1_IRQS_2_PP_CH3_UP_IS_Msk      (0x80000UL)               /*!< ADC1 IRQS_2: PP_CH3_UP_IS (Bitfield-Mask: 0x01)       */
#define ADC1_IRQS_2_PP_CH2_UP_IS_Pos      (18UL)                    /*!< ADC1 IRQS_2: PP_CH2_UP_IS (Bit 18)                    */
#define ADC1_IRQS_2_PP_CH2_UP_IS_Msk      (0x40000UL)               /*!< ADC1 IRQS_2: PP_CH2_UP_IS (Bitfield-Mask: 0x01)       */
#define ADC1_IRQS_2_VS_UP_IS_Pos          (17UL)                    /*!< ADC1 IRQS_2: VS_UP_IS (Bit 17)                        */
#define ADC1_IRQS_2_VS_UP_IS_Msk          (0x20000UL)               /*!< ADC1 IRQS_2: VS_UP_IS (Bitfield-Mask: 0x01)           */
#define ADC1_IRQS_2_PP_CH0_UP_IS_Pos      (16UL)                    /*!< ADC1 IRQS_2: PP_CH0_UP_IS (Bit 16)                    */
#define ADC1_IRQS_2_PP_CH0_UP_IS_Msk      (0x10000UL)               /*!< ADC1 IRQS_2: PP_CH0_UP_IS (Bitfield-Mask: 0x01)       */
#define ADC1_IRQS_2_PP_CH7_LO_IS_Pos      (7UL)                     /*!< ADC1 IRQS_2: PP_CH7_LO_IS (Bit 7)                     */
#define ADC1_IRQS_2_PP_CH7_LO_IS_Msk      (0x80UL)                  /*!< ADC1 IRQS_2: PP_CH7_LO_IS (Bitfield-Mask: 0x01)       */
#define ADC1_IRQS_2_PP_CH6_LO_IS_Pos      (6UL)                     /*!< ADC1 IRQS_2: PP_CH6_LO_IS (Bit 6)                     */
#define ADC1_IRQS_2_PP_CH6_LO_IS_Msk      (0x40UL)                  /*!< ADC1 IRQS_2: PP_CH6_LO_IS (Bitfield-Mask: 0x01)       */
#define ADC1_IRQS_2_PP_CH5_LO_IS_Pos      (5UL)                     /*!< ADC1 IRQS_2: PP_CH5_LO_IS (Bit 5)                     */
#define ADC1_IRQS_2_PP_CH5_LO_IS_Msk      (0x20UL)                  /*!< ADC1 IRQS_2: PP_CH5_LO_IS (Bitfield-Mask: 0x01)       */
#define ADC1_IRQS_2_PP_CH4_LO_IS_Pos      (4UL)                     /*!< ADC1 IRQS_2: PP_CH4_LO_IS (Bit 4)                     */
#define ADC1_IRQS_2_PP_CH4_LO_IS_Msk      (0x10UL)                  /*!< ADC1 IRQS_2: PP_CH4_LO_IS (Bitfield-Mask: 0x01)       */
#define ADC1_IRQS_2_PP_CH3_LO_IS_Pos      (3UL)                     /*!< ADC1 IRQS_2: PP_CH3_LO_IS (Bit 3)                     */
#define ADC1_IRQS_2_PP_CH3_LO_IS_Msk      (0x8UL)                   /*!< ADC1 IRQS_2: PP_CH3_LO_IS (Bitfield-Mask: 0x01)       */
#define ADC1_IRQS_2_PP_CH2_LO_IS_Pos      (2UL)                     /*!< ADC1 IRQS_2: PP_CH2_LO_IS (Bit 2)                     */
#define ADC1_IRQS_2_PP_CH2_LO_IS_Msk      (0x4UL)                   /*!< ADC1 IRQS_2: PP_CH2_LO_IS (Bitfield-Mask: 0x01)       */
#define ADC1_IRQS_2_VS_LO_IS_Pos          (1UL)                     /*!< ADC1 IRQS_2: VS_LO_IS (Bit 1)                         */
#define ADC1_IRQS_2_VS_LO_IS_Msk          (0x2UL)                   /*!< ADC1 IRQS_2: VS_LO_IS (Bitfield-Mask: 0x01)           */
#define ADC1_IRQS_2_PP_CH0_LO_IS_Pos      (0UL)                     /*!< ADC1 IRQS_2: PP_CH0_LO_IS (Bit 0)                     */
#define ADC1_IRQS_2_PP_CH0_LO_IS_Msk      (0x1UL)                   /*!< ADC1 IRQS_2: PP_CH0_LO_IS (Bitfield-Mask: 0x01)       */
/* =======================================================  MAX_TIME  ======================================================== */
#define ADC1_MAX_TIME_MAX_TIME_Pos        (0UL)                     /*!< ADC1 MAX_TIME: MAX_TIME (Bit 0)                       */
#define ADC1_MAX_TIME_MAX_TIME_Msk        (0xffUL)                  /*!< ADC1 MAX_TIME: MAX_TIME (Bitfield-Mask: 0xff)         */
/* =======================================================  MMODE0_7  ======================================================== */
#define ADC1_MMODE0_7_MMODE_D1_Pos        (24UL)                    /*!< ADC1 MMODE0_7: MMODE_D1 (Bit 24)                      */
#define ADC1_MMODE0_7_MMODE_D1_Msk        (0x3000000UL)             /*!< ADC1 MMODE0_7: MMODE_D1 (Bitfield-Mask: 0x03)         */
#define ADC1_MMODE0_7_MMODE_7_Pos         (14UL)                    /*!< ADC1 MMODE0_7: MMODE_7 (Bit 14)                       */
#define ADC1_MMODE0_7_MMODE_7_Msk         (0xc000UL)                /*!< ADC1 MMODE0_7: MMODE_7 (Bitfield-Mask: 0x03)          */
#define ADC1_MMODE0_7_MMODE_6_Pos         (12UL)                    /*!< ADC1 MMODE0_7: MMODE_6 (Bit 12)                       */
#define ADC1_MMODE0_7_MMODE_6_Msk         (0x3000UL)                /*!< ADC1 MMODE0_7: MMODE_6 (Bitfield-Mask: 0x03)          */
#define ADC1_MMODE0_7_MMODE_5_Pos         (10UL)                    /*!< ADC1 MMODE0_7: MMODE_5 (Bit 10)                       */
#define ADC1_MMODE0_7_MMODE_5_Msk         (0xc00UL)                 /*!< ADC1 MMODE0_7: MMODE_5 (Bitfield-Mask: 0x03)          */
#define ADC1_MMODE0_7_MMODE_4_Pos         (8UL)                     /*!< ADC1 MMODE0_7: MMODE_4 (Bit 8)                        */
#define ADC1_MMODE0_7_MMODE_4_Msk         (0x300UL)                 /*!< ADC1 MMODE0_7: MMODE_4 (Bitfield-Mask: 0x03)          */
#define ADC1_MMODE0_7_MMODE_3_Pos         (6UL)                     /*!< ADC1 MMODE0_7: MMODE_3 (Bit 6)                        */
#define ADC1_MMODE0_7_MMODE_3_Msk         (0xc0UL)                  /*!< ADC1 MMODE0_7: MMODE_3 (Bitfield-Mask: 0x03)          */
#define ADC1_MMODE0_7_MMODE_2_Pos         (4UL)                     /*!< ADC1 MMODE0_7: MMODE_2 (Bit 4)                        */
#define ADC1_MMODE0_7_MMODE_2_Msk         (0x30UL)                  /*!< ADC1 MMODE0_7: MMODE_2 (Bitfield-Mask: 0x03)          */
#define ADC1_MMODE0_7_MMODE_1_Pos         (2UL)                     /*!< ADC1 MMODE0_7: MMODE_1 (Bit 2)                        */
#define ADC1_MMODE0_7_MMODE_1_Msk         (0xcUL)                   /*!< ADC1 MMODE0_7: MMODE_1 (Bitfield-Mask: 0x03)          */
#define ADC1_MMODE0_7_MMODE_0_Pos         (0UL)                     /*!< ADC1 MMODE0_7: MMODE_0 (Bit 0)                        */
#define ADC1_MMODE0_7_MMODE_0_Msk         (0x3UL)                   /*!< ADC1 MMODE0_7: MMODE_0 (Bitfield-Mask: 0x03)          */
/* ======================================================  OFFSETCALIB  ====================================================== */
#define ADC1_OFFSETCALIB_OFFSET_DAC_Pos   (8UL)                     /*!< ADC1 OFFSETCALIB: OFFSET_DAC (Bit 8)                  */
#define ADC1_OFFSETCALIB_OFFSET_DAC_Msk   (0x1f00UL)                /*!< ADC1 OFFSETCALIB: OFFSET_DAC (Bitfield-Mask: 0x1f)    */
#define ADC1_OFFSETCALIB_OFFSET_SHIFT_Pos (0UL)                     /*!< ADC1 OFFSETCALIB: OFFSET_SHIFT (Bit 0)                */
#define ADC1_OFFSETCALIB_OFFSET_SHIFT_Msk (0x7UL)                   /*!< ADC1 OFFSETCALIB: OFFSET_SHIFT (Bitfield-Mask: 0x07)  */
/* =======================================================  PP_MAP0_3  ======================================================= */
#define ADC1_PP_MAP0_3_EN_PP_MAP3_Pos     (31UL)                    /*!< ADC1 PP_MAP0_3: EN_PP_MAP3 (Bit 31)                   */
#define ADC1_PP_MAP0_3_EN_PP_MAP3_Msk     (0x80000000UL)            /*!< ADC1 PP_MAP0_3: EN_PP_MAP3 (Bitfield-Mask: 0x01)      */
#define ADC1_PP_MAP0_3_RESET_PP_MAP3_Pos  (30UL)                    /*!< ADC1 PP_MAP0_3: RESET_PP_MAP3 (Bit 30)                */
#define ADC1_PP_MAP0_3_RESET_PP_MAP3_Msk  (0x40000000UL)            /*!< ADC1 PP_MAP0_3: RESET_PP_MAP3 (Bitfield-Mask: 0x01)   */
#define ADC1_PP_MAP0_3_PP_MAP3_Pos        (24UL)                    /*!< ADC1 PP_MAP0_3: PP_MAP3 (Bit 24)                      */
#define ADC1_PP_MAP0_3_PP_MAP3_Msk        (0xf000000UL)             /*!< ADC1 PP_MAP0_3: PP_MAP3 (Bitfield-Mask: 0x0f)         */
#define ADC1_PP_MAP0_3_EN_PP_MAP2_Pos     (23UL)                    /*!< ADC1 PP_MAP0_3: EN_PP_MAP2 (Bit 23)                   */
#define ADC1_PP_MAP0_3_EN_PP_MAP2_Msk     (0x800000UL)              /*!< ADC1 PP_MAP0_3: EN_PP_MAP2 (Bitfield-Mask: 0x01)      */
#define ADC1_PP_MAP0_3_RESET_PP_MAP2_Pos  (22UL)                    /*!< ADC1 PP_MAP0_3: RESET_PP_MAP2 (Bit 22)                */
#define ADC1_PP_MAP0_3_RESET_PP_MAP2_Msk  (0x400000UL)              /*!< ADC1 PP_MAP0_3: RESET_PP_MAP2 (Bitfield-Mask: 0x01)   */
#define ADC1_PP_MAP0_3_PP_MAP2_Pos        (16UL)                    /*!< ADC1 PP_MAP0_3: PP_MAP2 (Bit 16)                      */
#define ADC1_PP_MAP0_3_PP_MAP2_Msk        (0xf0000UL)               /*!< ADC1 PP_MAP0_3: PP_MAP2 (Bitfield-Mask: 0x0f)         */
#define ADC1_PP_MAP0_3_EN_PP_MAP1_Pos     (15UL)                    /*!< ADC1 PP_MAP0_3: EN_PP_MAP1 (Bit 15)                   */
#define ADC1_PP_MAP0_3_EN_PP_MAP1_Msk     (0x8000UL)                /*!< ADC1 PP_MAP0_3: EN_PP_MAP1 (Bitfield-Mask: 0x01)      */
#define ADC1_PP_MAP0_3_RESET_PP_MAP1_Pos  (14UL)                    /*!< ADC1 PP_MAP0_3: RESET_PP_MAP1 (Bit 14)                */
#define ADC1_PP_MAP0_3_RESET_PP_MAP1_Msk  (0x4000UL)                /*!< ADC1 PP_MAP0_3: RESET_PP_MAP1 (Bitfield-Mask: 0x01)   */
#define ADC1_PP_MAP0_3_EN_PP_MAP0_Pos     (7UL)                     /*!< ADC1 PP_MAP0_3: EN_PP_MAP0 (Bit 7)                    */
#define ADC1_PP_MAP0_3_EN_PP_MAP0_Msk     (0x80UL)                  /*!< ADC1 PP_MAP0_3: EN_PP_MAP0 (Bitfield-Mask: 0x01)      */
#define ADC1_PP_MAP0_3_RESET_PP_MAP0_Pos  (6UL)                     /*!< ADC1 PP_MAP0_3: RESET_PP_MAP0 (Bit 6)                 */
#define ADC1_PP_MAP0_3_RESET_PP_MAP0_Msk  (0x40UL)                  /*!< ADC1 PP_MAP0_3: RESET_PP_MAP0 (Bitfield-Mask: 0x01)   */
/* =======================================================  PP_MAP4_7  ======================================================= */
#define ADC1_PP_MAP4_7_EN_PP_MAP7_Pos     (31UL)                    /*!< ADC1 PP_MAP4_7: EN_PP_MAP7 (Bit 31)                   */
#define ADC1_PP_MAP4_7_EN_PP_MAP7_Msk     (0x80000000UL)            /*!< ADC1 PP_MAP4_7: EN_PP_MAP7 (Bitfield-Mask: 0x01)      */
#define ADC1_PP_MAP4_7_RESET_PP_MAP7_Pos  (30UL)                    /*!< ADC1 PP_MAP4_7: RESET_PP_MAP7 (Bit 30)                */
#define ADC1_PP_MAP4_7_RESET_PP_MAP7_Msk  (0x40000000UL)            /*!< ADC1 PP_MAP4_7: RESET_PP_MAP7 (Bitfield-Mask: 0x01)   */
#define ADC1_PP_MAP4_7_PP_MAP7_Pos        (24UL)                    /*!< ADC1 PP_MAP4_7: PP_MAP7 (Bit 24)                      */
#define ADC1_PP_MAP4_7_PP_MAP7_Msk        (0xf000000UL)             /*!< ADC1 PP_MAP4_7: PP_MAP7 (Bitfield-Mask: 0x0f)         */
#define ADC1_PP_MAP4_7_EN_PP_MAP6_Pos     (23UL)                    /*!< ADC1 PP_MAP4_7: EN_PP_MAP6 (Bit 23)                   */
#define ADC1_PP_MAP4_7_EN_PP_MAP6_Msk     (0x800000UL)              /*!< ADC1 PP_MAP4_7: EN_PP_MAP6 (Bitfield-Mask: 0x01)      */
#define ADC1_PP_MAP4_7_RESET_PP_MAP6_Pos  (22UL)                    /*!< ADC1 PP_MAP4_7: RESET_PP_MAP6 (Bit 22)                */
#define ADC1_PP_MAP4_7_RESET_PP_MAP6_Msk  (0x400000UL)              /*!< ADC1 PP_MAP4_7: RESET_PP_MAP6 (Bitfield-Mask: 0x01)   */
#define ADC1_PP_MAP4_7_PP_MAP6_Pos        (16UL)                    /*!< ADC1 PP_MAP4_7: PP_MAP6 (Bit 16)                      */
#define ADC1_PP_MAP4_7_PP_MAP6_Msk        (0xf0000UL)               /*!< ADC1 PP_MAP4_7: PP_MAP6 (Bitfield-Mask: 0x0f)         */
#define ADC1_PP_MAP4_7_EN_PP_MAP5_Pos     (15UL)                    /*!< ADC1 PP_MAP4_7: EN_PP_MAP5 (Bit 15)                   */
#define ADC1_PP_MAP4_7_EN_PP_MAP5_Msk     (0x8000UL)                /*!< ADC1 PP_MAP4_7: EN_PP_MAP5 (Bitfield-Mask: 0x01)      */
#define ADC1_PP_MAP4_7_RESET_PP_MAP5_Pos  (14UL)                    /*!< ADC1 PP_MAP4_7: RESET_PP_MAP5 (Bit 14)                */
#define ADC1_PP_MAP4_7_RESET_PP_MAP5_Msk  (0x4000UL)                /*!< ADC1 PP_MAP4_7: RESET_PP_MAP5 (Bitfield-Mask: 0x01)   */
#define ADC1_PP_MAP4_7_PP_MAP5_Pos        (8UL)                     /*!< ADC1 PP_MAP4_7: PP_MAP5 (Bit 8)                       */
#define ADC1_PP_MAP4_7_PP_MAP5_Msk        (0xf00UL)                 /*!< ADC1 PP_MAP4_7: PP_MAP5 (Bitfield-Mask: 0x0f)         */
#define ADC1_PP_MAP4_7_EN_PP_MAP4_Pos     (7UL)                     /*!< ADC1 PP_MAP4_7: EN_PP_MAP4 (Bit 7)                    */
#define ADC1_PP_MAP4_7_EN_PP_MAP4_Msk     (0x80UL)                  /*!< ADC1 PP_MAP4_7: EN_PP_MAP4 (Bitfield-Mask: 0x01)      */
#define ADC1_PP_MAP4_7_RESET_PP_MAP4_Pos  (6UL)                     /*!< ADC1 PP_MAP4_7: RESET_PP_MAP4 (Bit 6)                 */
#define ADC1_PP_MAP4_7_RESET_PP_MAP4_Msk  (0x40UL)                  /*!< ADC1 PP_MAP4_7: RESET_PP_MAP4 (Bitfield-Mask: 0x01)   */
#define ADC1_PP_MAP4_7_PP_MAP4_Pos        (0UL)                     /*!< ADC1 PP_MAP4_7: PP_MAP4 (Bit 0)                       */
#define ADC1_PP_MAP4_7_PP_MAP4_Msk        (0xfUL)                   /*!< ADC1 PP_MAP4_7: PP_MAP4 (Bitfield-Mask: 0x0f)         */
/* =========================================================  SQ0_1  ========================================================= */
#define ADC1_SQ0_1_SQ1_Pos                (16UL)                    /*!< ADC1 SQ0_1: SQ1 (Bit 16)                              */
#define ADC1_SQ0_1_SQ1_Msk                (0x3fff0000UL)            /*!< ADC1 SQ0_1: SQ1 (Bitfield-Mask: 0x3fff)               */
#define ADC1_SQ0_1_SQ0_Pos                (0UL)                     /*!< ADC1 SQ0_1: SQ0 (Bit 0)                               */
#define ADC1_SQ0_1_SQ0_Msk                (0x3fffUL)                /*!< ADC1 SQ0_1: SQ0 (Bitfield-Mask: 0x3fff)               */
/* ========================================================  SQ10_11  ======================================================== */
#define ADC1_SQ10_11_SQ11_Pos             (16UL)                    /*!< ADC1 SQ10_11: SQ11 (Bit 16)                           */
#define ADC1_SQ10_11_SQ11_Msk             (0x3fff0000UL)            /*!< ADC1 SQ10_11: SQ11 (Bitfield-Mask: 0x3fff)            */
#define ADC1_SQ10_11_SQ10_Pos             (0UL)                     /*!< ADC1 SQ10_11: SQ10 (Bit 0)                            */
#define ADC1_SQ10_11_SQ10_Msk             (0x3fffUL)                /*!< ADC1 SQ10_11: SQ10 (Bitfield-Mask: 0x3fff)            */
/* ========================================================  SQ12_13  ======================================================== */
#define ADC1_SQ12_13_SQ13_Pos             (16UL)                    /*!< ADC1 SQ12_13: SQ13 (Bit 16)                           */
#define ADC1_SQ12_13_SQ13_Msk             (0x3fff0000UL)            /*!< ADC1 SQ12_13: SQ13 (Bitfield-Mask: 0x3fff)            */
#define ADC1_SQ12_13_SQ12_Pos             (0UL)                     /*!< ADC1 SQ12_13: SQ12 (Bit 0)                            */
#define ADC1_SQ12_13_SQ12_Msk             (0x3fffUL)                /*!< ADC1 SQ12_13: SQ12 (Bitfield-Mask: 0x3fff)            */
/* =========================================================  SQ2_3  ========================================================= */
