Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
#define ADC1_SQ2_3_SQ3_Pos                (16UL)                    /*!< ADC1 SQ2_3: SQ3 (Bit 16)                              */
#define ADC1_SQ2_3_SQ3_Msk                (0x3fff0000UL)            /*!< ADC1 SQ2_3: SQ3 (Bitfield-Mask: 0x3fff)               */
#define ADC1_SQ2_3_SQ2_Pos                (0UL)                     /*!< ADC1 SQ2_3: SQ2 (Bit 0)                               */
#define ADC1_SQ2_3_SQ2_Msk                (0x3fffUL)                /*!< ADC1 SQ2_3: SQ2 (Bitfield-Mask: 0x3fff)               */
/* =========================================================  SQ4_5  ========================================================= */
#define ADC1_SQ4_5_SQ5_Pos                (16UL)                    /*!< ADC1 SQ4_5: SQ5 (Bit 16)                              */
#define ADC1_SQ4_5_SQ5_Msk                (0x3fff0000UL)            /*!< ADC1 SQ4_5: SQ5 (Bitfield-Mask: 0x3fff)               */
#define ADC1_SQ4_5_SQ4_Pos                (0UL)                     /*!< ADC1 SQ4_5: SQ4 (Bit 0)                               */
#define ADC1_SQ4_5_SQ4_Msk                (0x3fffUL)                /*!< ADC1 SQ4_5: SQ4 (Bitfield-Mask: 0x3fff)               */
/* =========================================================  SQ6_7  ========================================================= */
#define ADC1_SQ6_7_SQ7_Pos                (16UL)                    /*!< ADC1 SQ6_7: SQ7 (Bit 16)                              */
#define ADC1_SQ6_7_SQ7_Msk                (0x3fff0000UL)            /*!< ADC1 SQ6_7: SQ7 (Bitfield-Mask: 0x3fff)               */
#define ADC1_SQ6_7_SQ6_Pos                (0UL)                     /*!< ADC1 SQ6_7: SQ6 (Bit 0)                               */
#define ADC1_SQ6_7_SQ6_Msk                (0x3fffUL)                /*!< ADC1 SQ6_7: SQ6 (Bitfield-Mask: 0x3fff)               */
/* =========================================================  SQ8_9  ========================================================= */
#define ADC1_SQ8_9_SQ9_Pos                (16UL)                    /*!< ADC1 SQ8_9: SQ9 (Bit 16)                              */
#define ADC1_SQ8_9_SQ9_Msk                (0x3fff0000UL)            /*!< ADC1 SQ8_9: SQ9 (Bitfield-Mask: 0x3fff)               */
#define ADC1_SQ8_9_SQ8_Pos                (0UL)                     /*!< ADC1 SQ8_9: SQ8 (Bit 0)                               */
#define ADC1_SQ8_9_SQ8_Msk                (0x3fffUL)                /*!< ADC1 SQ8_9: SQ8 (Bitfield-Mask: 0x3fff)               */
/* =======================================================  SQ_CH_MAP  ======================================================= */
#define ADC1_SQ_CH_MAP_SQ_CH12_MAP_Pos    (12UL)                    /*!< ADC1 SQ_CH_MAP: SQ_CH12_MAP (Bit 12)                  */
#define ADC1_SQ_CH_MAP_SQ_CH12_MAP_Msk    (0x1000UL)                /*!< ADC1 SQ_CH_MAP: SQ_CH12_MAP (Bitfield-Mask: 0x01)     */
#define ADC1_SQ_CH_MAP_SQ_CH6_MAP_Pos     (6UL)                     /*!< ADC1 SQ_CH_MAP: SQ_CH6_MAP (Bit 6)                    */
#define ADC1_SQ_CH_MAP_SQ_CH6_MAP_Msk     (0x40UL)                  /*!< ADC1 SQ_CH_MAP: SQ_CH6_MAP (Bitfield-Mask: 0x01)      */
#define ADC1_SQ_CH_MAP_SQ_CH5_MAP_Pos     (5UL)                     /*!< ADC1 SQ_CH_MAP: SQ_CH5_MAP (Bit 5)                    */
#define ADC1_SQ_CH_MAP_SQ_CH5_MAP_Msk     (0x20UL)                  /*!< ADC1 SQ_CH_MAP: SQ_CH5_MAP (Bitfield-Mask: 0x01)      */
/* =========================================================  SQ_FB  ========================================================= */
#define ADC1_SQ_FB_CHx_Pos                (16UL)                    /*!< ADC1 SQ_FB: CHx (Bit 16)                              */
#define ADC1_SQ_FB_CHx_Msk                (0xf0000UL)               /*!< ADC1 SQ_FB: CHx (Bitfield-Mask: 0x0f)                 */
#define ADC1_SQ_FB_SQx_Pos                (11UL)                    /*!< ADC1 SQ_FB: SQx (Bit 11)                              */
#define ADC1_SQ_FB_SQx_Msk                (0x7800UL)                /*!< ADC1 SQ_FB: SQx (Bitfield-Mask: 0x0f)                 */
#define ADC1_SQ_FB_ESM_ACTIVE_Pos         (10UL)                    /*!< ADC1 SQ_FB: ESM_ACTIVE (Bit 10)                       */
#define ADC1_SQ_FB_ESM_ACTIVE_Msk         (0x400UL)                 /*!< ADC1 SQ_FB: ESM_ACTIVE (Bitfield-Mask: 0x01)          */
#define ADC1_SQ_FB_EIM_ACTIVE_Pos         (9UL)                     /*!< ADC1 SQ_FB: EIM_ACTIVE (Bit 9)                        */
#define ADC1_SQ_FB_EIM_ACTIVE_Msk         (0x200UL)                 /*!< ADC1 SQ_FB: EIM_ACTIVE (Bitfield-Mask: 0x01)          */
#define ADC1_SQ_FB_SQ_STOP_Pos            (8UL)                     /*!< ADC1 SQ_FB: SQ_STOP (Bit 8)                           */
#define ADC1_SQ_FB_SQ_STOP_Msk            (0x100UL)                 /*!< ADC1 SQ_FB: SQ_STOP (Bitfield-Mask: 0x01)             */
#define ADC1_SQ_FB_SQ_FB_Pos              (0UL)                     /*!< ADC1 SQ_FB: SQ_FB (Bit 0)                             */
#define ADC1_SQ_FB_SQ_FB_Msk              (0x1fUL)                  /*!< ADC1 SQ_FB: SQ_FB (Bitfield-Mask: 0x1f)               */
/* ========================================================  STATUS  ========================================================= */
#define ADC1_STATUS_SD_FEEDB_ON_Pos       (31UL)                    /*!< ADC1 STATUS: SD_FEEDB_ON (Bit 31)                     */
#define ADC1_STATUS_SD_FEEDB_ON_Msk       (0x80000000UL)            /*!< ADC1 STATUS: SD_FEEDB_ON (Bitfield-Mask: 0x01)        */
#define ADC1_STATUS_SOC_JITTER_Pos        (16UL)                    /*!< ADC1 STATUS: SOC_JITTER (Bit 16)                      */
#define ADC1_STATUS_SOC_JITTER_Msk        (0x30000UL)               /*!< ADC1 STATUS: SOC_JITTER (Bitfield-Mask: 0x03)         */
#define ADC1_STATUS_DAC_IN_Pos            (0UL)                     /*!< ADC1 STATUS: DAC_IN (Bit 0)                           */
#define ADC1_STATUS_DAC_IN_Msk            (0x7UL)                   /*!< ADC1 STATUS: DAC_IN (Bitfield-Mask: 0x07)             */
/* =========================================================  STS_1  ========================================================= */
#define ADC1_STS_1_DU1UP_STS_Pos          (25UL)                    /*!< ADC1 STS_1: DU1UP_STS (Bit 25)                        */
#define ADC1_STS_1_DU1UP_STS_Msk          (0x2000000UL)             /*!< ADC1 STS_1: DU1UP_STS (Bitfield-Mask: 0x01)           */
#define ADC1_STS_1_DU1LO_STS_Pos          (24UL)                    /*!< ADC1 STS_1: DU1LO_STS (Bit 24)                        */
#define ADC1_STS_1_DU1LO_STS_Msk          (0x1000000UL)             /*!< ADC1 STS_1: DU1LO_STS (Bitfield-Mask: 0x01)           */
/* =========================================================  STS_2  ========================================================= */
#define ADC1_STS_2_PP_CH7_UP_STS_Pos      (23UL)                    /*!< ADC1 STS_2: PP_CH7_UP_STS (Bit 23)                    */
#define ADC1_STS_2_PP_CH7_UP_STS_Msk      (0x800000UL)              /*!< ADC1 STS_2: PP_CH7_UP_STS (Bitfield-Mask: 0x01)       */
#define ADC1_STS_2_PP_CH6_UP_STS_Pos      (22UL)                    /*!< ADC1 STS_2: PP_CH6_UP_STS (Bit 22)                    */
#define ADC1_STS_2_PP_CH6_UP_STS_Msk      (0x400000UL)              /*!< ADC1 STS_2: PP_CH6_UP_STS (Bitfield-Mask: 0x01)       */
#define ADC1_STS_2_PP_CH5_UP_STS_Pos      (21UL)                    /*!< ADC1 STS_2: PP_CH5_UP_STS (Bit 21)                    */
#define ADC1_STS_2_PP_CH5_UP_STS_Msk      (0x200000UL)              /*!< ADC1 STS_2: PP_CH5_UP_STS (Bitfield-Mask: 0x01)       */
#define ADC1_STS_2_PP_CH4_UP_STS_Pos      (20UL)                    /*!< ADC1 STS_2: PP_CH4_UP_STS (Bit 20)                    */
#define ADC1_STS_2_PP_CH4_UP_STS_Msk      (0x100000UL)              /*!< ADC1 STS_2: PP_CH4_UP_STS (Bitfield-Mask: 0x01)       */
#define ADC1_STS_2_PP_CH3_UP_STS_Pos      (19UL)                    /*!< ADC1 STS_2: PP_CH3_UP_STS (Bit 19)                    */
#define ADC1_STS_2_PP_CH3_UP_STS_Msk      (0x80000UL)               /*!< ADC1 STS_2: PP_CH3_UP_STS (Bitfield-Mask: 0x01)       */
#define ADC1_STS_2_PP_CH2_UP_STS_Pos      (18UL)                    /*!< ADC1 STS_2: PP_CH2_UP_STS (Bit 18)                    */
#define ADC1_STS_2_PP_CH2_UP_STS_Msk      (0x40000UL)               /*!< ADC1 STS_2: PP_CH2_UP_STS (Bitfield-Mask: 0x01)       */
#define ADC1_STS_2_VS_UP_STS_Pos          (17UL)                    /*!< ADC1 STS_2: VS_UP_STS (Bit 17)                        */
#define ADC1_STS_2_VS_UP_STS_Msk          (0x20000UL)               /*!< ADC1 STS_2: VS_UP_STS (Bitfield-Mask: 0x01)           */
#define ADC1_STS_2_PP_CH0_UP_STS_Pos      (16UL)                    /*!< ADC1 STS_2: PP_CH0_UP_STS (Bit 16)                    */
#define ADC1_STS_2_PP_CH0_UP_STS_Msk      (0x10000UL)               /*!< ADC1 STS_2: PP_CH0_UP_STS (Bitfield-Mask: 0x01)       */
#define ADC1_STS_2_PP_CH7_LO_STS_Pos      (7UL)                     /*!< ADC1 STS_2: PP_CH7_LO_STS (Bit 7)                     */
#define ADC1_STS_2_PP_CH7_LO_STS_Msk      (0x80UL)                  /*!< ADC1 STS_2: PP_CH7_LO_STS (Bitfield-Mask: 0x01)       */
#define ADC1_STS_2_PP_CH6_LO_STS_Pos      (6UL)                     /*!< ADC1 STS_2: PP_CH6_LO_STS (Bit 6)                     */
#define ADC1_STS_2_PP_CH6_LO_STS_Msk      (0x40UL)                  /*!< ADC1 STS_2: PP_CH6_LO_STS (Bitfield-Mask: 0x01)       */
#define ADC1_STS_2_PP_CH5_LO_STS_Pos      (5UL)                     /*!< ADC1 STS_2: PP_CH5_LO_STS (Bit 5)                     */
#define ADC1_STS_2_PP_CH5_LO_STS_Msk      (0x20UL)                  /*!< ADC1 STS_2: PP_CH5_LO_STS (Bitfield-Mask: 0x01)       */
#define ADC1_STS_2_PP_CH4_LO_STS_Pos      (4UL)                     /*!< ADC1 STS_2: PP_CH4_LO_STS (Bit 4)                     */
#define ADC1_STS_2_PP_CH4_LO_STS_Msk      (0x10UL)                  /*!< ADC1 STS_2: PP_CH4_LO_STS (Bitfield-Mask: 0x01)       */
#define ADC1_STS_2_PP_CH3_LO_STS_Pos      (3UL)                     /*!< ADC1 STS_2: PP_CH3_LO_STS (Bit 3)                     */
#define ADC1_STS_2_PP_CH3_LO_STS_Msk      (0x8UL)                   /*!< ADC1 STS_2: PP_CH3_LO_STS (Bitfield-Mask: 0x01)       */
#define ADC1_STS_2_PP_CH2_LO_STS_Pos      (2UL)                     /*!< ADC1 STS_2: PP_CH2_LO_STS (Bit 2)                     */
#define ADC1_STS_2_PP_CH2_LO_STS_Msk      (0x4UL)                   /*!< ADC1 STS_2: PP_CH2_LO_STS (Bitfield-Mask: 0x01)       */
#define ADC1_STS_2_VS_LO_STS_Pos          (1UL)                     /*!< ADC1 STS_2: VS_LO_STS (Bit 1)                         */
#define ADC1_STS_2_VS_LO_STS_Msk          (0x2UL)                   /*!< ADC1 STS_2: VS_LO_STS (Bitfield-Mask: 0x01)           */
#define ADC1_STS_2_PP_CH0_LO_STS_Pos      (0UL)                     /*!< ADC1 STS_2: PP_CH0_LO_STS (Bit 0)                     */
#define ADC1_STS_2_PP_CH0_LO_STS_Msk      (0x1UL)                   /*!< ADC1 STS_2: PP_CH0_LO_STS (Bitfield-Mask: 0x01)       */
/* =======================================================  STSCLR_1  ======================================================== */
#define ADC1_STSCLR_1_DU1UP_SC_Pos        (25UL)                    /*!< ADC1 STSCLR_1: DU1UP_SC (Bit 25)                      */
#define ADC1_STSCLR_1_DU1UP_SC_Msk        (0x2000000UL)             /*!< ADC1 STSCLR_1: DU1UP_SC (Bitfield-Mask: 0x01)         */
#define ADC1_STSCLR_1_DU1LO_SC_Pos        (24UL)                    /*!< ADC1 STSCLR_1: DU1LO_SC (Bit 24)                      */
#define ADC1_STSCLR_1_DU1LO_SC_Msk        (0x1000000UL)             /*!< ADC1 STSCLR_1: DU1LO_SC (Bitfield-Mask: 0x01)         */
/* ======================================================  TH0_3_LOWER  ====================================================== */
#define ADC1_TH0_3_LOWER_PP_CH3_LOW_Pos   (24UL)                    /*!< ADC1 TH0_3_LOWER: PP_CH3_LOW (Bit 24)                 */
#define ADC1_TH0_3_LOWER_PP_CH3_LOW_Msk   (0xff000000UL)            /*!< ADC1 TH0_3_LOWER: PP_CH3_LOW (Bitfield-Mask: 0xff)    */
#define ADC1_TH0_3_LOWER_PP_CH2_LOW_Pos   (16UL)                    /*!< ADC1 TH0_3_LOWER: PP_CH2_LOW (Bit 16)                 */
#define ADC1_TH0_3_LOWER_PP_CH2_LOW_Msk   (0xff0000UL)              /*!< ADC1 TH0_3_LOWER: PP_CH2_LOW (Bitfield-Mask: 0xff)    */
#define ADC1_TH0_3_LOWER_PP_CH1_LOW_Pos   (8UL)                     /*!< ADC1 TH0_3_LOWER: PP_CH1_LOW (Bit 8)                  */
#define ADC1_TH0_3_LOWER_PP_CH1_LOW_Msk   (0xff00UL)                /*!< ADC1 TH0_3_LOWER: PP_CH1_LOW (Bitfield-Mask: 0xff)    */
#define ADC1_TH0_3_LOWER_PP_CH0_LOW_Pos   (0UL)                     /*!< ADC1 TH0_3_LOWER: PP_CH0_LOW (Bit 0)                  */
#define ADC1_TH0_3_LOWER_PP_CH0_LOW_Msk   (0xffUL)                  /*!< ADC1 TH0_3_LOWER: PP_CH0_LOW (Bitfield-Mask: 0xff)    */
/* ======================================================  TH0_3_UPPER  ====================================================== */
#define ADC1_TH0_3_UPPER_PP_CH3_UP_Pos    (24UL)                    /*!< ADC1 TH0_3_UPPER: PP_CH3_UP (Bit 24)                  */
#define ADC1_TH0_3_UPPER_PP_CH3_UP_Msk    (0xff000000UL)            /*!< ADC1 TH0_3_UPPER: PP_CH3_UP (Bitfield-Mask: 0xff)     */
#define ADC1_TH0_3_UPPER_PP_CH2_UP_Pos    (16UL)                    /*!< ADC1 TH0_3_UPPER: PP_CH2_UP (Bit 16)                  */
#define ADC1_TH0_3_UPPER_PP_CH2_UP_Msk    (0xff0000UL)              /*!< ADC1 TH0_3_UPPER: PP_CH2_UP (Bitfield-Mask: 0xff)     */
#define ADC1_TH0_3_UPPER_PP_CH1_UP_Pos    (8UL)                     /*!< ADC1 TH0_3_UPPER: PP_CH1_UP (Bit 8)                   */
#define ADC1_TH0_3_UPPER_PP_CH1_UP_Msk    (0xff00UL)                /*!< ADC1 TH0_3_UPPER: PP_CH1_UP (Bitfield-Mask: 0xff)     */
#define ADC1_TH0_3_UPPER_PP_CH0_UP_Pos    (0UL)                     /*!< ADC1 TH0_3_UPPER: PP_CH0_UP (Bit 0)                   */
#define ADC1_TH0_3_UPPER_PP_CH0_UP_Msk    (0xffUL)                  /*!< ADC1 TH0_3_UPPER: PP_CH0_UP (Bitfield-Mask: 0xff)     */
/* ======================================================  TH4_7_LOWER  ====================================================== */
#define ADC1_TH4_7_LOWER_PP_CH7_LOW_Pos   (24UL)                    /*!< ADC1 TH4_7_LOWER: PP_CH7_LOW (Bit 24)                 */
#define ADC1_TH4_7_LOWER_PP_CH7_LOW_Msk   (0xff000000UL)            /*!< ADC1 TH4_7_LOWER: PP_CH7_LOW (Bitfield-Mask: 0xff)    */
#define ADC1_TH4_7_LOWER_PP_CH6_LOW_Pos   (16UL)                    /*!< ADC1 TH4_7_LOWER: PP_CH6_LOW (Bit 16)                 */
#define ADC1_TH4_7_LOWER_PP_CH6_LOW_Msk   (0xff0000UL)              /*!< ADC1 TH4_7_LOWER: PP_CH6_LOW (Bitfield-Mask: 0xff)    */
#define ADC1_TH4_7_LOWER_PP_CH5_LOW_Pos   (8UL)                     /*!< ADC1 TH4_7_LOWER: PP_CH5_LOW (Bit 8)                  */
#define ADC1_TH4_7_LOWER_PP_CH5_LOW_Msk   (0xff00UL)                /*!< ADC1 TH4_7_LOWER: PP_CH5_LOW (Bitfield-Mask: 0xff)    */
#define ADC1_TH4_7_LOWER_PP_CH4_LOW_Pos   (0UL)                     /*!< ADC1 TH4_7_LOWER: PP_CH4_LOW (Bit 0)                  */
#define ADC1_TH4_7_LOWER_PP_CH4_LOW_Msk   (0xffUL)                  /*!< ADC1 TH4_7_LOWER: PP_CH4_LOW (Bitfield-Mask: 0xff)    */
/* ======================================================  TH4_7_UPPER  ====================================================== */
#define ADC1_TH4_7_UPPER_PP_CH7_UP_Pos    (24UL)                    /*!< ADC1 TH4_7_UPPER: PP_CH7_UP (Bit 24)                  */
#define ADC1_TH4_7_UPPER_PP_CH7_UP_Msk    (0xff000000UL)            /*!< ADC1 TH4_7_UPPER: PP_CH7_UP (Bitfield-Mask: 0xff)     */
#define ADC1_TH4_7_UPPER_PP_CH6_UP_Pos    (16UL)                    /*!< ADC1 TH4_7_UPPER: PP_CH6_UP (Bit 16)                  */
#define ADC1_TH4_7_UPPER_PP_CH6_UP_Msk    (0xff0000UL)              /*!< ADC1 TH4_7_UPPER: PP_CH6_UP (Bitfield-Mask: 0xff)     */
#define ADC1_TH4_7_UPPER_PP_CH5_UP_Pos    (8UL)                     /*!< ADC1 TH4_7_UPPER: PP_CH5_UP (Bit 8)                   */
#define ADC1_TH4_7_UPPER_PP_CH5_UP_Msk    (0xff00UL)                /*!< ADC1 TH4_7_UPPER: PP_CH5_UP (Bitfield-Mask: 0xff)     */
#define ADC1_TH4_7_UPPER_PP_CH4_UP_Pos    (0UL)                     /*!< ADC1 TH4_7_UPPER: PP_CH4_UP (Bit 0)                   */
#define ADC1_TH4_7_UPPER_PP_CH4_UP_Msk    (0xffUL)                  /*!< ADC1 TH4_7_UPPER: PP_CH4_UP (Bitfield-Mask: 0xff)     */


/* =========================================================================================================================== */
/* ================                                           ADC2                                            ================ */
/* =========================================================================================================================== */

