Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
/* =======================================================  CAL_CH0_1  ======================================================= */
#define ADC2_CAL_CH0_1_GAIN_CH1_Pos       (24UL)                    /*!< ADC2 CAL_CH0_1: GAIN_CH1 (Bit 24)                     */
#define ADC2_CAL_CH0_1_GAIN_CH1_Msk       (0xff000000UL)            /*!< ADC2 CAL_CH0_1: GAIN_CH1 (Bitfield-Mask: 0xff)        */
#define ADC2_CAL_CH0_1_OFFS_CH1_Pos       (16UL)                    /*!< ADC2 CAL_CH0_1: OFFS_CH1 (Bit 16)                     */
#define ADC2_CAL_CH0_1_OFFS_CH1_Msk       (0x1f0000UL)              /*!< ADC2 CAL_CH0_1: OFFS_CH1 (Bitfield-Mask: 0x1f)        */
#define ADC2_CAL_CH0_1_GAIN_CH0_Pos       (8UL)                     /*!< ADC2 CAL_CH0_1: GAIN_CH0 (Bit 8)                      */
#define ADC2_CAL_CH0_1_GAIN_CH0_Msk       (0xff00UL)                /*!< ADC2 CAL_CH0_1: GAIN_CH0 (Bitfield-Mask: 0xff)        */
#define ADC2_CAL_CH0_1_OFFS_CH0_Pos       (0UL)                     /*!< ADC2 CAL_CH0_1: OFFS_CH0 (Bit 0)                      */
#define ADC2_CAL_CH0_1_OFFS_CH0_Msk       (0x1fUL)                  /*!< ADC2 CAL_CH0_1: OFFS_CH0 (Bitfield-Mask: 0x1f)        */
/* =======================================================  CAL_CH2_3  ======================================================= */
#define ADC2_CAL_CH2_3_GAIN_CH3_Pos       (24UL)                    /*!< ADC2 CAL_CH2_3: GAIN_CH3 (Bit 24)                     */
#define ADC2_CAL_CH2_3_GAIN_CH3_Msk       (0xff000000UL)            /*!< ADC2 CAL_CH2_3: GAIN_CH3 (Bitfield-Mask: 0xff)        */
#define ADC2_CAL_CH2_3_OFFS_CH3_Pos       (16UL)                    /*!< ADC2 CAL_CH2_3: OFFS_CH3 (Bit 16)                     */
#define ADC2_CAL_CH2_3_OFFS_CH3_Msk       (0x1f0000UL)              /*!< ADC2 CAL_CH2_3: OFFS_CH3 (Bitfield-Mask: 0x1f)        */
#define ADC2_CAL_CH2_3_GAIN_CH2_Pos       (8UL)                     /*!< ADC2 CAL_CH2_3: GAIN_CH2 (Bit 8)                      */
#define ADC2_CAL_CH2_3_GAIN_CH2_Msk       (0xff00UL)                /*!< ADC2 CAL_CH2_3: GAIN_CH2 (Bitfield-Mask: 0xff)        */
#define ADC2_CAL_CH2_3_OFFS_CH2_Pos       (0UL)                     /*!< ADC2 CAL_CH2_3: OFFS_CH2 (Bit 0)                      */
#define ADC2_CAL_CH2_3_OFFS_CH2_Msk       (0x1fUL)                  /*!< ADC2 CAL_CH2_3: OFFS_CH2 (Bitfield-Mask: 0x1f)        */
/* =======================================================  CAL_CH4_5  ======================================================= */
#define ADC2_CAL_CH4_5_GAIN_CH5_Pos       (24UL)                    /*!< ADC2 CAL_CH4_5: GAIN_CH5 (Bit 24)                     */
#define ADC2_CAL_CH4_5_GAIN_CH5_Msk       (0xff000000UL)            /*!< ADC2 CAL_CH4_5: GAIN_CH5 (Bitfield-Mask: 0xff)        */
#define ADC2_CAL_CH4_5_OFFS_CH5_Pos       (16UL)                    /*!< ADC2 CAL_CH4_5: OFFS_CH5 (Bit 16)                     */
#define ADC2_CAL_CH4_5_OFFS_CH5_Msk       (0x1f0000UL)              /*!< ADC2 CAL_CH4_5: OFFS_CH5 (Bitfield-Mask: 0x1f)        */
#define ADC2_CAL_CH4_5_GAIN_CH4_Pos       (8UL)                     /*!< ADC2 CAL_CH4_5: GAIN_CH4 (Bit 8)                      */
#define ADC2_CAL_CH4_5_GAIN_CH4_Msk       (0xff00UL)                /*!< ADC2 CAL_CH4_5: GAIN_CH4 (Bitfield-Mask: 0xff)        */
#define ADC2_CAL_CH4_5_OFFS_CH4_Pos       (0UL)                     /*!< ADC2 CAL_CH4_5: OFFS_CH4 (Bit 0)                      */
#define ADC2_CAL_CH4_5_OFFS_CH4_Msk       (0x1fUL)                  /*!< ADC2 CAL_CH4_5: OFFS_CH4 (Bitfield-Mask: 0x1f)        */
/* =======================================================  CAL_CH6_7  ======================================================= */
#define ADC2_CAL_CH6_7_GAIN_CH7_Pos       (24UL)                    /*!< ADC2 CAL_CH6_7: GAIN_CH7 (Bit 24)                     */
#define ADC2_CAL_CH6_7_GAIN_CH7_Msk       (0xff000000UL)            /*!< ADC2 CAL_CH6_7: GAIN_CH7 (Bitfield-Mask: 0xff)        */
#define ADC2_CAL_CH6_7_OFFS_CH7_Pos       (16UL)                    /*!< ADC2 CAL_CH6_7: OFFS_CH7 (Bit 16)                     */
#define ADC2_CAL_CH6_7_OFFS_CH7_Msk       (0x1f0000UL)              /*!< ADC2 CAL_CH6_7: OFFS_CH7 (Bitfield-Mask: 0x1f)        */
#define ADC2_CAL_CH6_7_GAIN_CH6_Pos       (8UL)                     /*!< ADC2 CAL_CH6_7: GAIN_CH6 (Bit 8)                      */
#define ADC2_CAL_CH6_7_GAIN_CH6_Msk       (0xff00UL)                /*!< ADC2 CAL_CH6_7: GAIN_CH6 (Bitfield-Mask: 0xff)        */
#define ADC2_CAL_CH6_7_OFFS_CH6_Pos       (0UL)                     /*!< ADC2 CAL_CH6_7: OFFS_CH6 (Bit 0)                      */
#define ADC2_CAL_CH6_7_OFFS_CH6_Msk       (0x1fUL)                  /*!< ADC2 CAL_CH6_7: OFFS_CH6 (Bitfield-Mask: 0x1f)        */
/* =======================================================  CAL_CH8_9  ======================================================= */
#define ADC2_CAL_CH8_9_GAIN_CH8_Pos       (8UL)                     /*!< ADC2 CAL_CH8_9: GAIN_CH8 (Bit 8)                      */
#define ADC2_CAL_CH8_9_GAIN_CH8_Msk       (0xff00UL)                /*!< ADC2 CAL_CH8_9: GAIN_CH8 (Bitfield-Mask: 0xff)        */
#define ADC2_CAL_CH8_9_OFFS_CH8_Pos       (0UL)                     /*!< ADC2 CAL_CH8_9: OFFS_CH8 (Bit 0)                      */
#define ADC2_CAL_CH8_9_OFFS_CH8_Msk       (0x1fUL)                  /*!< ADC2 CAL_CH8_9: OFFS_CH8 (Bitfield-Mask: 0x1f)        */
/* ========================================================  CHx_EIM  ======================================================== */
#define ADC2_CHx_EIM_SEL_Pos              (12UL)                    /*!< ADC2 CHx_EIM: SEL (Bit 12)                            */
#define ADC2_CHx_EIM_SEL_Msk              (0x1000UL)                /*!< ADC2 CHx_EIM: SEL (Bitfield-Mask: 0x01)               */
#define ADC2_CHx_EIM_EN_Pos               (11UL)                    /*!< ADC2 CHx_EIM: EN (Bit 11)                             */
#define ADC2_CHx_EIM_EN_Msk               (0x800UL)                 /*!< ADC2 CHx_EIM: EN (Bitfield-Mask: 0x01)                */
#define ADC2_CHx_EIM_REP_Pos              (8UL)                     /*!< ADC2 CHx_EIM: REP (Bit 8)                             */
#define ADC2_CHx_EIM_REP_Msk              (0x700UL)                 /*!< ADC2 CHx_EIM: REP (Bitfield-Mask: 0x07)               */
#define ADC2_CHx_EIM_CHx_SEL_Pos          (0UL)                     /*!< ADC2 CHx_EIM: CHx_SEL (Bit 0)                         */
#define ADC2_CHx_EIM_CHx_SEL_Msk          (0xfUL)                   /*!< ADC2 CHx_EIM: CHx_SEL (Bitfield-Mask: 0x0f)           */
/* =====================================================  CNT0_3_LOWER  ====================================================== */
#define ADC2_CNT0_3_LOWER_HYST_LO_CH3_Pos (27UL)                    /*!< ADC2 CNT0_3_LOWER: HYST_LO_CH3 (Bit 27)               */
#define ADC2_CNT0_3_LOWER_HYST_LO_CH3_Msk (0x18000000UL)            /*!< ADC2 CNT0_3_LOWER: HYST_LO_CH3 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT0_3_LOWER_CNT_LO_CH3_Pos  (24UL)                    /*!< ADC2 CNT0_3_LOWER: CNT_LO_CH3 (Bit 24)                */
#define ADC2_CNT0_3_LOWER_CNT_LO_CH3_Msk  (0x3000000UL)             /*!< ADC2 CNT0_3_LOWER: CNT_LO_CH3 (Bitfield-Mask: 0x03)   */
#define ADC2_CNT0_3_LOWER_HYST_LO_CH2_Pos (19UL)                    /*!< ADC2 CNT0_3_LOWER: HYST_LO_CH2 (Bit 19)               */
#define ADC2_CNT0_3_LOWER_HYST_LO_CH2_Msk (0x180000UL)              /*!< ADC2 CNT0_3_LOWER: HYST_LO_CH2 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT0_3_LOWER_CNT_LO_CH2_Pos  (16UL)                    /*!< ADC2 CNT0_3_LOWER: CNT_LO_CH2 (Bit 16)                */
#define ADC2_CNT0_3_LOWER_CNT_LO_CH2_Msk  (0x30000UL)               /*!< ADC2 CNT0_3_LOWER: CNT_LO_CH2 (Bitfield-Mask: 0x03)   */
#define ADC2_CNT0_3_LOWER_HYST_LO_CH1_Pos (11UL)                    /*!< ADC2 CNT0_3_LOWER: HYST_LO_CH1 (Bit 11)               */
#define ADC2_CNT0_3_LOWER_HYST_LO_CH1_Msk (0x1800UL)                /*!< ADC2 CNT0_3_LOWER: HYST_LO_CH1 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT0_3_LOWER_CNT_LO_CH1_Pos  (8UL)                     /*!< ADC2 CNT0_3_LOWER: CNT_LO_CH1 (Bit 8)                 */
#define ADC2_CNT0_3_LOWER_CNT_LO_CH1_Msk  (0x300UL)                 /*!< ADC2 CNT0_3_LOWER: CNT_LO_CH1 (Bitfield-Mask: 0x03)   */
#define ADC2_CNT0_3_LOWER_HYST_LO_CH0_Pos (3UL)                     /*!< ADC2 CNT0_3_LOWER: HYST_LO_CH0 (Bit 3)                */
#define ADC2_CNT0_3_LOWER_HYST_LO_CH0_Msk (0x18UL)                  /*!< ADC2 CNT0_3_LOWER: HYST_LO_CH0 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT0_3_LOWER_CNT_LO_CH0_Pos  (0UL)                     /*!< ADC2 CNT0_3_LOWER: CNT_LO_CH0 (Bit 0)                 */
#define ADC2_CNT0_3_LOWER_CNT_LO_CH0_Msk  (0x3UL)                   /*!< ADC2 CNT0_3_LOWER: CNT_LO_CH0 (Bitfield-Mask: 0x03)   */
/* =====================================================  CNT0_3_UPPER  ====================================================== */
#define ADC2_CNT0_3_UPPER_HYST_UP_CH3_Pos (27UL)                    /*!< ADC2 CNT0_3_UPPER: HYST_UP_CH3 (Bit 27)               */
#define ADC2_CNT0_3_UPPER_HYST_UP_CH3_Msk (0x18000000UL)            /*!< ADC2 CNT0_3_UPPER: HYST_UP_CH3 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT0_3_UPPER_CNT_UP_CH3_Pos  (24UL)                    /*!< ADC2 CNT0_3_UPPER: CNT_UP_CH3 (Bit 24)                */
#define ADC2_CNT0_3_UPPER_CNT_UP_CH3_Msk  (0x3000000UL)             /*!< ADC2 CNT0_3_UPPER: CNT_UP_CH3 (Bitfield-Mask: 0x03)   */
#define ADC2_CNT0_3_UPPER_HYST_UP_CH2_Pos (19UL)                    /*!< ADC2 CNT0_3_UPPER: HYST_UP_CH2 (Bit 19)               */
#define ADC2_CNT0_3_UPPER_HYST_UP_CH2_Msk (0x180000UL)              /*!< ADC2 CNT0_3_UPPER: HYST_UP_CH2 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT0_3_UPPER_CNT_UP_CH2_Pos  (16UL)                    /*!< ADC2 CNT0_3_UPPER: CNT_UP_CH2 (Bit 16)                */
#define ADC2_CNT0_3_UPPER_CNT_UP_CH2_Msk  (0x30000UL)               /*!< ADC2 CNT0_3_UPPER: CNT_UP_CH2 (Bitfield-Mask: 0x03)   */
#define ADC2_CNT0_3_UPPER_HYST_UP_CH1_Pos (11UL)                    /*!< ADC2 CNT0_3_UPPER: HYST_UP_CH1 (Bit 11)               */
#define ADC2_CNT0_3_UPPER_HYST_UP_CH1_Msk (0x1800UL)                /*!< ADC2 CNT0_3_UPPER: HYST_UP_CH1 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT0_3_UPPER_CNT_UP_CH1_Pos  (8UL)                     /*!< ADC2 CNT0_3_UPPER: CNT_UP_CH1 (Bit 8)                 */
#define ADC2_CNT0_3_UPPER_CNT_UP_CH1_Msk  (0x300UL)                 /*!< ADC2 CNT0_3_UPPER: CNT_UP_CH1 (Bitfield-Mask: 0x03)   */
#define ADC2_CNT0_3_UPPER_HYST_UP_CH0_Pos (3UL)                     /*!< ADC2 CNT0_3_UPPER: HYST_UP_CH0 (Bit 3)                */
#define ADC2_CNT0_3_UPPER_HYST_UP_CH0_Msk (0x18UL)                  /*!< ADC2 CNT0_3_UPPER: HYST_UP_CH0 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT0_3_UPPER_CNT_UP_CH0_Pos  (0UL)                     /*!< ADC2 CNT0_3_UPPER: CNT_UP_CH0 (Bit 0)                 */
#define ADC2_CNT0_3_UPPER_CNT_UP_CH0_Msk  (0x3UL)                   /*!< ADC2 CNT0_3_UPPER: CNT_UP_CH0 (Bitfield-Mask: 0x03)   */
/* =====================================================  CNT4_7_LOWER  ====================================================== */
#define ADC2_CNT4_7_LOWER_HYST_LO_CH7_Pos (27UL)                    /*!< ADC2 CNT4_7_LOWER: HYST_LO_CH7 (Bit 27)               */
#define ADC2_CNT4_7_LOWER_HYST_LO_CH7_Msk (0x18000000UL)            /*!< ADC2 CNT4_7_LOWER: HYST_LO_CH7 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT4_7_LOWER_CNT_LO_CH7_Pos  (24UL)                    /*!< ADC2 CNT4_7_LOWER: CNT_LO_CH7 (Bit 24)                */
#define ADC2_CNT4_7_LOWER_CNT_LO_CH7_Msk  (0x3000000UL)             /*!< ADC2 CNT4_7_LOWER: CNT_LO_CH7 (Bitfield-Mask: 0x03)   */
#define ADC2_CNT4_7_LOWER_HYST_LO_CH6_Pos (19UL)                    /*!< ADC2 CNT4_7_LOWER: HYST_LO_CH6 (Bit 19)               */
#define ADC2_CNT4_7_LOWER_HYST_LO_CH6_Msk (0x180000UL)              /*!< ADC2 CNT4_7_LOWER: HYST_LO_CH6 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT4_7_LOWER_CNT_LO_CH6_Pos  (16UL)                    /*!< ADC2 CNT4_7_LOWER: CNT_LO_CH6 (Bit 16)                */
#define ADC2_CNT4_7_LOWER_CNT_LO_CH6_Msk  (0x30000UL)               /*!< ADC2 CNT4_7_LOWER: CNT_LO_CH6 (Bitfield-Mask: 0x03)   */
#define ADC2_CNT4_7_LOWER_HYST_LO_CH5_Pos (11UL)                    /*!< ADC2 CNT4_7_LOWER: HYST_LO_CH5 (Bit 11)               */
#define ADC2_CNT4_7_LOWER_HYST_LO_CH5_Msk (0x1800UL)                /*!< ADC2 CNT4_7_LOWER: HYST_LO_CH5 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT4_7_LOWER_CNT_LO_CH5_Pos  (8UL)                     /*!< ADC2 CNT4_7_LOWER: CNT_LO_CH5 (Bit 8)                 */
#define ADC2_CNT4_7_LOWER_CNT_LO_CH5_Msk  (0x300UL)                 /*!< ADC2 CNT4_7_LOWER: CNT_LO_CH5 (Bitfield-Mask: 0x03)   */
#define ADC2_CNT4_7_LOWER_HYST_LO_CH4_Pos (3UL)                     /*!< ADC2 CNT4_7_LOWER: HYST_LO_CH4 (Bit 3)                */
#define ADC2_CNT4_7_LOWER_HYST_LO_CH4_Msk (0x18UL)                  /*!< ADC2 CNT4_7_LOWER: HYST_LO_CH4 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT4_7_LOWER_CNT_LO_CH4_Pos  (0UL)                     /*!< ADC2 CNT4_7_LOWER: CNT_LO_CH4 (Bit 0)                 */
#define ADC2_CNT4_7_LOWER_CNT_LO_CH4_Msk  (0x3UL)                   /*!< ADC2 CNT4_7_LOWER: CNT_LO_CH4 (Bitfield-Mask: 0x03)   */
/* =====================================================  CNT4_7_UPPER  ====================================================== */
#define ADC2_CNT4_7_UPPER_HYST_UP_CH7_Pos (27UL)                    /*!< ADC2 CNT4_7_UPPER: HYST_UP_CH7 (Bit 27)               */
#define ADC2_CNT4_7_UPPER_HYST_UP_CH7_Msk (0x18000000UL)            /*!< ADC2 CNT4_7_UPPER: HYST_UP_CH7 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT4_7_UPPER_CNT_UP_CH7_Pos  (24UL)                    /*!< ADC2 CNT4_7_UPPER: CNT_UP_CH7 (Bit 24)                */
#define ADC2_CNT4_7_UPPER_CNT_UP_CH7_Msk  (0x3000000UL)             /*!< ADC2 CNT4_7_UPPER: CNT_UP_CH7 (Bitfield-Mask: 0x03)   */
#define ADC2_CNT4_7_UPPER_HYST_UP_CH6_Pos (19UL)                    /*!< ADC2 CNT4_7_UPPER: HYST_UP_CH6 (Bit 19)               */
#define ADC2_CNT4_7_UPPER_HYST_UP_CH6_Msk (0x180000UL)              /*!< ADC2 CNT4_7_UPPER: HYST_UP_CH6 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT4_7_UPPER_CNT_UP_CH6_Pos  (16UL)                    /*!< ADC2 CNT4_7_UPPER: CNT_UP_CH6 (Bit 16)                */
#define ADC2_CNT4_7_UPPER_CNT_UP_CH6_Msk  (0x30000UL)               /*!< ADC2 CNT4_7_UPPER: CNT_UP_CH6 (Bitfield-Mask: 0x03)   */
#define ADC2_CNT4_7_UPPER_HYST_UP_CH5_Pos (11UL)                    /*!< ADC2 CNT4_7_UPPER: HYST_UP_CH5 (Bit 11)               */
#define ADC2_CNT4_7_UPPER_HYST_UP_CH5_Msk (0x1800UL)                /*!< ADC2 CNT4_7_UPPER: HYST_UP_CH5 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT4_7_UPPER_CNT_UP_CH5_Pos  (8UL)                     /*!< ADC2 CNT4_7_UPPER: CNT_UP_CH5 (Bit 8)                 */
#define ADC2_CNT4_7_UPPER_CNT_UP_CH5_Msk  (0x300UL)                 /*!< ADC2 CNT4_7_UPPER: CNT_UP_CH5 (Bitfield-Mask: 0x03)   */
#define ADC2_CNT4_7_UPPER_HYST_UP_CH4_Pos (3UL)                     /*!< ADC2 CNT4_7_UPPER: HYST_UP_CH4 (Bit 3)                */
#define ADC2_CNT4_7_UPPER_HYST_UP_CH4_Msk (0x18UL)                  /*!< ADC2 CNT4_7_UPPER: HYST_UP_CH4 (Bitfield-Mask: 0x03)  */
#define ADC2_CNT4_7_UPPER_CNT_UP_CH4_Pos  (0UL)                     /*!< ADC2 CNT4_7_UPPER: CNT_UP_CH4 (Bit 0)                 */
#define ADC2_CNT4_7_UPPER_CNT_UP_CH4_Msk  (0x3UL)                   /*!< ADC2 CNT4_7_UPPER: CNT_UP_CH4 (Bitfield-Mask: 0x03)   */
/* =====================================================  CNT8_11_LOWER  ===================================================== */
#define ADC2_CNT8_11_LOWER_HYST_LO_CH8_Pos (3UL)                    /*!< ADC2 CNT8_11_LOWER: HYST_LO_CH8 (Bit 3)               */
#define ADC2_CNT8_11_LOWER_HYST_LO_CH8_Msk (0x18UL)                 /*!< ADC2 CNT8_11_LOWER: HYST_LO_CH8 (Bitfield-Mask: 0x03) */
#define ADC2_CNT8_11_LOWER_CNT_LO_CH8_Pos (0UL)                     /*!< ADC2 CNT8_11_LOWER: CNT_LO_CH8 (Bit 0)                */
#define ADC2_CNT8_11_LOWER_CNT_LO_CH8_Msk (0x3UL)                   /*!< ADC2 CNT8_11_LOWER: CNT_LO_CH8 (Bitfield-Mask: 0x03)  */
/* =====================================================  CNT8_11_UPPER  ===================================================== */
#define ADC2_CNT8_11_UPPER_HYST_UP_CH8_Pos (3UL)                    /*!< ADC2 CNT8_11_UPPER: HYST_UP_CH8 (Bit 3)               */
#define ADC2_CNT8_11_UPPER_HYST_UP_CH8_Msk (0x18UL)                 /*!< ADC2 CNT8_11_UPPER: HYST_UP_CH8 (Bitfield-Mask: 0x03) */
#define ADC2_CNT8_11_UPPER_CNT_UP_CH8_Pos (0UL)                     /*!< ADC2 CNT8_11_UPPER: CNT_UP_CH8 (Bit 0)                */
#define ADC2_CNT8_11_UPPER_CNT_UP_CH8_Msk (0x3UL)                   /*!< ADC2 CNT8_11_UPPER: CNT_UP_CH8 (Bitfield-Mask: 0x03)  */
/* =========================================================  CTRL1  ========================================================= */
#define ADC2_CTRL1_CALIB_EN_8_0_Pos       (0UL)                     /*!< ADC2 CTRL1: CALIB_EN_8_0 (Bit 0)                      */
#define ADC2_CTRL1_CALIB_EN_8_0_Msk       (0x1ffUL)                 /*!< ADC2 CTRL1: CALIB_EN_8_0 (Bitfield-Mask: 0x1ff)       */
/* =========================================================  CTRL2  ========================================================= */
#define ADC2_CTRL2_SAMPLE_TIME_int_Pos    (8UL)                     /*!< ADC2 CTRL2: SAMPLE_TIME_int (Bit 8)                   */
#define ADC2_CTRL2_SAMPLE_TIME_int_Msk    (0xf00UL)                 /*!< ADC2 CTRL2: SAMPLE_TIME_int (Bitfield-Mask: 0x0f)     */
#define ADC2_CTRL2_MCM_RDY_Pos            (7UL)                     /*!< ADC2 CTRL2: MCM_RDY (Bit 7)                           */
#define ADC2_CTRL2_MCM_RDY_Msk            (0x80UL)                  /*!< ADC2 CTRL2: MCM_RDY (Bitfield-Mask: 0x01)             */
#define ADC2_CTRL2_MCM_PD_N_Pos           (0UL)                     /*!< ADC2 CTRL2: MCM_PD_N (Bit 0)                          */
#define ADC2_CTRL2_MCM_PD_N_Msk           (0x1UL)                   /*!< ADC2 CTRL2: MCM_PD_N (Bitfield-Mask: 0x01)            */
/* =========================================================  CTRL4  ========================================================= */
#define ADC2_CTRL4_FILT_OUT_SEL_8_0_Pos   (0UL)                     /*!< ADC2 CTRL4: FILT_OUT_SEL_8_0 (Bit 0)                  */
#define ADC2_CTRL4_FILT_OUT_SEL_8_0_Msk   (0x1ffUL)                 /*!< ADC2 CTRL4: FILT_OUT_SEL_8_0 (Bitfield-Mask: 0x1ff)   */
/* =======================================================  CTRL_STS  ======================================================== */
#define ADC2_CTRL_STS_IN_MUX_SEL_Pos      (8UL)                     /*!< ADC2 CTRL_STS: IN_MUX_SEL (Bit 8)                     */
#define ADC2_CTRL_STS_IN_MUX_SEL_Msk      (0xf00UL)                 /*!< ADC2 CTRL_STS: IN_MUX_SEL (Bitfield-Mask: 0x0f)       */
#define ADC2_CTRL_STS_EOC_Pos             (3UL)                     /*!< ADC2 CTRL_STS: EOC (Bit 3)                            */
#define ADC2_CTRL_STS_EOC_Msk             (0x8UL)                   /*!< ADC2 CTRL_STS: EOC (Bitfield-Mask: 0x01)              */
#define ADC2_CTRL_STS_SOS_Pos             (2UL)                     /*!< ADC2 CTRL_STS: SOS (Bit 2)                            */
#define ADC2_CTRL_STS_SOS_Msk             (0x4UL)                   /*!< ADC2 CTRL_STS: SOS (Bitfield-Mask: 0x01)              */
#define ADC2_CTRL_STS_PD_N_Pos            (0UL)                     /*!< ADC2 CTRL_STS: PD_N (Bit 0)                           */
#define ADC2_CTRL_STS_PD_N_Msk            (0x1UL)                   /*!< ADC2 CTRL_STS: PD_N (Bitfield-Mask: 0x01)             */
/* =======================================================  FILT_OUT0  ======================================================= */
#define ADC2_FILT_OUT0_OUT_CH0_Pos        (0UL)                     /*!< ADC2 FILT_OUT0: OUT_CH0 (Bit 0)                       */
#define ADC2_FILT_OUT0_OUT_CH0_Msk        (0x3ffUL)                 /*!< ADC2 FILT_OUT0: OUT_CH0 (Bitfield-Mask: 0x3ff)        */
/* =======================================================  FILT_OUT1  ======================================================= */
#define ADC2_FILT_OUT1_OUT_CH1_Pos        (0UL)                     /*!< ADC2 FILT_OUT1: OUT_CH1 (Bit 0)                       */
#define ADC2_FILT_OUT1_OUT_CH1_Msk        (0x3ffUL)                 /*!< ADC2 FILT_OUT1: OUT_CH1 (Bitfield-Mask: 0x3ff)        */
/* =======================================================  FILT_OUT2  ======================================================= */
#define ADC2_FILT_OUT2_OUT_CH2_Pos        (0UL)                     /*!< ADC2 FILT_OUT2: OUT_CH2 (Bit 0)                       */
#define ADC2_FILT_OUT2_OUT_CH2_Msk        (0x3ffUL)                 /*!< ADC2 FILT_OUT2: OUT_CH2 (Bitfield-Mask: 0x3ff)        */
/* =======================================================  FILT_OUT3  ======================================================= */
#define ADC2_FILT_OUT3_OUT_CH3_Pos        (0UL)                     /*!< ADC2 FILT_OUT3: OUT_CH3 (Bit 0)                       */
#define ADC2_FILT_OUT3_OUT_CH3_Msk        (0x3ffUL)                 /*!< ADC2 FILT_OUT3: OUT_CH3 (Bitfield-Mask: 0x3ff)        */
/* =======================================================  FILT_OUT4  ======================================================= */
#define ADC2_FILT_OUT4_OUT_CH4_Pos        (0UL)                     /*!< ADC2 FILT_OUT4: OUT_CH4 (Bit 0)                       */
#define ADC2_FILT_OUT4_OUT_CH4_Msk        (0x3ffUL)                 /*!< ADC2 FILT_OUT4: OUT_CH4 (Bitfield-Mask: 0x3ff)        */
/* =======================================================  FILT_OUT5  ======================================================= */
#define ADC2_FILT_OUT5_OUT_CH5_Pos        (0UL)                     /*!< ADC2 FILT_OUT5: OUT_CH5 (Bit 0)                       */
#define ADC2_FILT_OUT5_OUT_CH5_Msk        (0x3ffUL)                 /*!< ADC2 FILT_OUT5: OUT_CH5 (Bitfield-Mask: 0x3ff)        */
/* =======================================================  FILT_OUT6  ======================================================= */
#define ADC2_FILT_OUT6_OUT_CH6_Pos        (0UL)                     /*!< ADC2 FILT_OUT6: OUT_CH6 (Bit 0)                       */
#define ADC2_FILT_OUT6_OUT_CH6_Msk        (0x3ffUL)                 /*!< ADC2 FILT_OUT6: OUT_CH6 (Bitfield-Mask: 0x3ff)        */
/* =======================================================  FILT_OUT7  ======================================================= */
#define ADC2_FILT_OUT7_OUT_CH7_Pos        (0UL)                     /*!< ADC2 FILT_OUT7: OUT_CH7 (Bit 0)                       */
#define ADC2_FILT_OUT7_OUT_CH7_Msk        (0x3ffUL)                 /*!< ADC2 FILT_OUT7: OUT_CH7 (Bitfield-Mask: 0x3ff)        */
/* =======================================================  FILT_OUT8  ======================================================= */
#define ADC2_FILT_OUT8_OUT_CH8_Pos        (0UL)                     /*!< ADC2 FILT_OUT8: OUT_CH8 (Bit 0)                       */
#define ADC2_FILT_OUT8_OUT_CH8_Msk        (0x3ffUL)                 /*!< ADC2 FILT_OUT8: OUT_CH8 (Bitfield-Mask: 0x3ff)        */
/* ====================================================  FILT_UPLO_CTRL  ===================================================== */
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch8_Pos (8UL)                    /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch8 (Bit 8)               */
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch8_Msk (0x100UL)                /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch8 (Bitfield-Mask: 0x01) */
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch7_Pos (7UL)                    /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch7 (Bit 7)               */
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch7_Msk (0x80UL)                 /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch7 (Bitfield-Mask: 0x01) */
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch6_Pos (6UL)                    /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch6 (Bit 6)               */
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch6_Msk (0x40UL)                 /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch6 (Bitfield-Mask: 0x01) */
