Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch5_Pos (5UL)                    /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch5 (Bit 5)               */
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch5_Msk (0x20UL)                 /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch5 (Bitfield-Mask: 0x01) */
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch4_Pos (4UL)                    /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch4 (Bit 4)               */
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch4_Msk (0x10UL)                 /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch4 (Bitfield-Mask: 0x01) */
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch3_Pos (3UL)                    /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch3 (Bit 3)               */
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch3_Msk (0x8UL)                  /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch3 (Bitfield-Mask: 0x01) */
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch2_Pos (2UL)                    /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch2 (Bit 2)               */
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch2_Msk (0x4UL)                  /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch2 (Bitfield-Mask: 0x01) */
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch1_Pos (1UL)                    /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch1 (Bit 1)               */
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch1_Msk (0x2UL)                  /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch1 (Bitfield-Mask: 0x01) */
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch0_Pos (0UL)                    /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch0 (Bit 0)               */
#define ADC2_FILT_UPLO_CTRL_UPLOEN_Ch0_Msk (0x1UL)                  /*!< ADC2 FILT_UPLO_CTRL: UPLOEN_Ch0 (Bitfield-Mask: 0x01) */
/* =====================================================  FILTCOEFF0_8  ====================================================== */
#define ADC2_FILTCOEFF0_8_A_CH8_Pos       (16UL)                    /*!< ADC2 FILTCOEFF0_8: A_CH8 (Bit 16)                     */
#define ADC2_FILTCOEFF0_8_A_CH8_Msk       (0x30000UL)               /*!< ADC2 FILTCOEFF0_8: A_CH8 (Bitfield-Mask: 0x03)        */
#define ADC2_FILTCOEFF0_8_A_CH7_Pos       (14UL)                    /*!< ADC2 FILTCOEFF0_8: A_CH7 (Bit 14)                     */
#define ADC2_FILTCOEFF0_8_A_CH7_Msk       (0xc000UL)                /*!< ADC2 FILTCOEFF0_8: A_CH7 (Bitfield-Mask: 0x03)        */
#define ADC2_FILTCOEFF0_8_A_CH6_Pos       (12UL)                    /*!< ADC2 FILTCOEFF0_8: A_CH6 (Bit 12)                     */
#define ADC2_FILTCOEFF0_8_A_CH6_Msk       (0x3000UL)                /*!< ADC2 FILTCOEFF0_8: A_CH6 (Bitfield-Mask: 0x03)        */
#define ADC2_FILTCOEFF0_8_A_CH5_Pos       (10UL)                    /*!< ADC2 FILTCOEFF0_8: A_CH5 (Bit 10)                     */
#define ADC2_FILTCOEFF0_8_A_CH5_Msk       (0xc00UL)                 /*!< ADC2 FILTCOEFF0_8: A_CH5 (Bitfield-Mask: 0x03)        */
#define ADC2_FILTCOEFF0_8_A_CH4_Pos       (8UL)                     /*!< ADC2 FILTCOEFF0_8: A_CH4 (Bit 8)                      */
#define ADC2_FILTCOEFF0_8_A_CH4_Msk       (0x300UL)                 /*!< ADC2 FILTCOEFF0_8: A_CH4 (Bitfield-Mask: 0x03)        */
#define ADC2_FILTCOEFF0_8_A_CH3_Pos       (6UL)                     /*!< ADC2 FILTCOEFF0_8: A_CH3 (Bit 6)                      */
#define ADC2_FILTCOEFF0_8_A_CH3_Msk       (0xc0UL)                  /*!< ADC2 FILTCOEFF0_8: A_CH3 (Bitfield-Mask: 0x03)        */
#define ADC2_FILTCOEFF0_8_A_CH2_Pos       (4UL)                     /*!< ADC2 FILTCOEFF0_8: A_CH2 (Bit 4)                      */
#define ADC2_FILTCOEFF0_8_A_CH2_Msk       (0x30UL)                  /*!< ADC2 FILTCOEFF0_8: A_CH2 (Bitfield-Mask: 0x03)        */
#define ADC2_FILTCOEFF0_8_A_CH1_Pos       (2UL)                     /*!< ADC2 FILTCOEFF0_8: A_CH1 (Bit 2)                      */
#define ADC2_FILTCOEFF0_8_A_CH1_Msk       (0xcUL)                   /*!< ADC2 FILTCOEFF0_8: A_CH1 (Bitfield-Mask: 0x03)        */
#define ADC2_FILTCOEFF0_8_A_CH0_Pos       (0UL)                     /*!< ADC2 FILTCOEFF0_8: A_CH0 (Bit 0)                      */
#define ADC2_FILTCOEFF0_8_A_CH0_Msk       (0x3UL)                   /*!< ADC2 FILTCOEFF0_8: A_CH0 (Bitfield-Mask: 0x03)        */
/* =======================================================  MAX_TIME  ======================================================== */
#define ADC2_MAX_TIME_MAX_TIME_Pos        (0UL)                     /*!< ADC2 MAX_TIME: MAX_TIME (Bit 0)                       */
#define ADC2_MAX_TIME_MAX_TIME_Msk        (0xffUL)                  /*!< ADC2 MAX_TIME: MAX_TIME (Bitfield-Mask: 0xff)         */
/* =======================================================  MMODE0_8  ======================================================== */
#define ADC2_MMODE0_8_MSEL_Ch8_Pos        (16UL)                    /*!< ADC2 MMODE0_8: MSEL_Ch8 (Bit 16)                      */
#define ADC2_MMODE0_8_MSEL_Ch8_Msk        (0x30000UL)               /*!< ADC2 MMODE0_8: MSEL_Ch8 (Bitfield-Mask: 0x03)         */
#define ADC2_MMODE0_8_MSEL_Ch7_Pos        (14UL)                    /*!< ADC2 MMODE0_8: MSEL_Ch7 (Bit 14)                      */
#define ADC2_MMODE0_8_MSEL_Ch7_Msk        (0xc000UL)                /*!< ADC2 MMODE0_8: MSEL_Ch7 (Bitfield-Mask: 0x03)         */
#define ADC2_MMODE0_8_MSEL_Ch6_Pos        (12UL)                    /*!< ADC2 MMODE0_8: MSEL_Ch6 (Bit 12)                      */
#define ADC2_MMODE0_8_MSEL_Ch6_Msk        (0x3000UL)                /*!< ADC2 MMODE0_8: MSEL_Ch6 (Bitfield-Mask: 0x03)         */
#define ADC2_MMODE0_8_MSEL_Ch5_Pos        (10UL)                    /*!< ADC2 MMODE0_8: MSEL_Ch5 (Bit 10)                      */
#define ADC2_MMODE0_8_MSEL_Ch5_Msk        (0xc00UL)                 /*!< ADC2 MMODE0_8: MSEL_Ch5 (Bitfield-Mask: 0x03)         */
#define ADC2_MMODE0_8_MSEL_Ch4_Pos        (8UL)                     /*!< ADC2 MMODE0_8: MSEL_Ch4 (Bit 8)                       */
#define ADC2_MMODE0_8_MSEL_Ch4_Msk        (0x300UL)                 /*!< ADC2 MMODE0_8: MSEL_Ch4 (Bitfield-Mask: 0x03)         */
#define ADC2_MMODE0_8_MSEL_Ch3_Pos        (6UL)                     /*!< ADC2 MMODE0_8: MSEL_Ch3 (Bit 6)                       */
#define ADC2_MMODE0_8_MSEL_Ch3_Msk        (0xc0UL)                  /*!< ADC2 MMODE0_8: MSEL_Ch3 (Bitfield-Mask: 0x03)         */
#define ADC2_MMODE0_8_MSEL_Ch2_Pos        (4UL)                     /*!< ADC2 MMODE0_8: MSEL_Ch2 (Bit 4)                       */
#define ADC2_MMODE0_8_MSEL_Ch2_Msk        (0x30UL)                  /*!< ADC2 MMODE0_8: MSEL_Ch2 (Bitfield-Mask: 0x03)         */
#define ADC2_MMODE0_8_MSEL_Ch1_Pos        (2UL)                     /*!< ADC2 MMODE0_8: MSEL_Ch1 (Bit 2)                       */
#define ADC2_MMODE0_8_MSEL_Ch1_Msk        (0xcUL)                   /*!< ADC2 MMODE0_8: MSEL_Ch1 (Bitfield-Mask: 0x03)         */
#define ADC2_MMODE0_8_MSEL_Ch0_Pos        (0UL)                     /*!< ADC2 MMODE0_8: MSEL_Ch0 (Bit 0)                       */
#define ADC2_MMODE0_8_MSEL_Ch0_Msk        (0x3UL)                   /*!< ADC2 MMODE0_8: MSEL_Ch0 (Bitfield-Mask: 0x03)         */
/* =========================================================  SQ0_1  ========================================================= */
#define ADC2_SQ0_1_SQ1_Pos                (16UL)                    /*!< ADC2 SQ0_1: SQ1 (Bit 16)                              */
#define ADC2_SQ0_1_SQ1_Msk                (0x1ff0000UL)             /*!< ADC2 SQ0_1: SQ1 (Bitfield-Mask: 0x1ff)                */
#define ADC2_SQ0_1_SQ0_Pos                (0UL)                     /*!< ADC2 SQ0_1: SQ0 (Bit 0)                               */
#define ADC2_SQ0_1_SQ0_Msk                (0x1ffUL)                 /*!< ADC2 SQ0_1: SQ0 (Bitfield-Mask: 0x1ff)                */
/* =========================================================  SQ2_3  ========================================================= */
#define ADC2_SQ2_3_SQ3_Pos                (16UL)                    /*!< ADC2 SQ2_3: SQ3 (Bit 16)                              */
#define ADC2_SQ2_3_SQ3_Msk                (0x1ff0000UL)             /*!< ADC2 SQ2_3: SQ3 (Bitfield-Mask: 0x1ff)                */
#define ADC2_SQ2_3_SQ2_Pos                (0UL)                     /*!< ADC2 SQ2_3: SQ2 (Bit 0)                               */
#define ADC2_SQ2_3_SQ2_Msk                (0x1ffUL)                 /*!< ADC2 SQ2_3: SQ2 (Bitfield-Mask: 0x1ff)                */
/* =========================================================  SQ4_5  ========================================================= */
#define ADC2_SQ4_5_SQ5_Pos                (16UL)                    /*!< ADC2 SQ4_5: SQ5 (Bit 16)                              */
#define ADC2_SQ4_5_SQ5_Msk                (0x1ff0000UL)             /*!< ADC2 SQ4_5: SQ5 (Bitfield-Mask: 0x1ff)                */
#define ADC2_SQ4_5_SQ4_Pos                (0UL)                     /*!< ADC2 SQ4_5: SQ4 (Bit 0)                               */
#define ADC2_SQ4_5_SQ4_Msk                (0x1ffUL)                 /*!< ADC2 SQ4_5: SQ4 (Bitfield-Mask: 0x1ff)                */
/* =========================================================  SQ6_7  ========================================================= */
#define ADC2_SQ6_7_SQ7_Pos                (16UL)                    /*!< ADC2 SQ6_7: SQ7 (Bit 16)                              */
#define ADC2_SQ6_7_SQ7_Msk                (0x1ff0000UL)             /*!< ADC2 SQ6_7: SQ7 (Bitfield-Mask: 0x1ff)                */
#define ADC2_SQ6_7_SQ6_Pos                (0UL)                     /*!< ADC2 SQ6_7: SQ6 (Bit 0)                               */
#define ADC2_SQ6_7_SQ6_Msk                (0x1ffUL)                 /*!< ADC2 SQ6_7: SQ6 (Bitfield-Mask: 0x1ff)                */
/* =========================================================  SQ8_9  ========================================================= */
#define ADC2_SQ8_9_SQ8_Pos                (0UL)                     /*!< ADC2 SQ8_9: SQ8 (Bit 0)                               */
#define ADC2_SQ8_9_SQ8_Msk                (0x1ffUL)                 /*!< ADC2 SQ8_9: SQ8 (Bitfield-Mask: 0x1ff)                */
/* =========================================================  SQ_FB  ========================================================= */
#define ADC2_SQ_FB_CHx_Pos                (16UL)                    /*!< ADC2 SQ_FB: CHx (Bit 16)                              */
#define ADC2_SQ_FB_CHx_Msk                (0xf0000UL)               /*!< ADC2 SQ_FB: CHx (Bitfield-Mask: 0x0f)                 */
#define ADC2_SQ_FB_SQx_Pos                (11UL)                    /*!< ADC2 SQ_FB: SQx (Bit 11)                              */
#define ADC2_SQ_FB_SQx_Msk                (0x7800UL)                /*!< ADC2 SQ_FB: SQx (Bitfield-Mask: 0x0f)                 */
#define ADC2_SQ_FB_EIM_ACTIVE_Pos         (9UL)                     /*!< ADC2 SQ_FB: EIM_ACTIVE (Bit 9)                        */
#define ADC2_SQ_FB_EIM_ACTIVE_Msk         (0x200UL)                 /*!< ADC2 SQ_FB: EIM_ACTIVE (Bitfield-Mask: 0x01)          */
#define ADC2_SQ_FB_SQ_STOP_Pos            (8UL)                     /*!< ADC2 SQ_FB: SQ_STOP (Bit 8)                           */
#define ADC2_SQ_FB_SQ_STOP_Msk            (0x100UL)                 /*!< ADC2 SQ_FB: SQ_STOP (Bitfield-Mask: 0x01)             */
#define ADC2_SQ_FB_SQ_FB_Pos              (0UL)                     /*!< ADC2 SQ_FB: SQ_FB (Bit 0)                             */
#define ADC2_SQ_FB_SQ_FB_Msk              (0xfUL)                   /*!< ADC2 SQ_FB: SQ_FB (Bitfield-Mask: 0x0f)               */
/* ========================================================  STATUS  ========================================================= */
#define ADC2_STATUS_READY_Pos             (1UL)                     /*!< ADC2 STATUS: READY (Bit 1)                            */
#define ADC2_STATUS_READY_Msk             (0x2UL)                   /*!< ADC2 STATUS: READY (Bitfield-Mask: 0x01)              */
/* ======================================================  TH0_3_LOWER  ====================================================== */
#define ADC2_TH0_3_LOWER_THLO_CH3_Pos     (24UL)                    /*!< ADC2 TH0_3_LOWER: THLO_CH3 (Bit 24)                   */
#define ADC2_TH0_3_LOWER_THLO_CH3_Msk     (0xff000000UL)            /*!< ADC2 TH0_3_LOWER: THLO_CH3 (Bitfield-Mask: 0xff)      */
#define ADC2_TH0_3_LOWER_THLO_CH2_Pos     (16UL)                    /*!< ADC2 TH0_3_LOWER: THLO_CH2 (Bit 16)                   */
#define ADC2_TH0_3_LOWER_THLO_CH2_Msk     (0xff0000UL)              /*!< ADC2 TH0_3_LOWER: THLO_CH2 (Bitfield-Mask: 0xff)      */
#define ADC2_TH0_3_LOWER_THLO_CH1_Pos     (8UL)                     /*!< ADC2 TH0_3_LOWER: THLO_CH1 (Bit 8)                    */
#define ADC2_TH0_3_LOWER_THLO_CH1_Msk     (0xff00UL)                /*!< ADC2 TH0_3_LOWER: THLO_CH1 (Bitfield-Mask: 0xff)      */
#define ADC2_TH0_3_LOWER_THLO_CH0_Pos     (0UL)                     /*!< ADC2 TH0_3_LOWER: THLO_CH0 (Bit 0)                    */
#define ADC2_TH0_3_LOWER_THLO_CH0_Msk     (0xffUL)                  /*!< ADC2 TH0_3_LOWER: THLO_CH0 (Bitfield-Mask: 0xff)      */
/* ======================================================  TH0_3_UPPER  ====================================================== */
#define ADC2_TH0_3_UPPER_THUP_CH3_Pos     (24UL)                    /*!< ADC2 TH0_3_UPPER: THUP_CH3 (Bit 24)                   */
#define ADC2_TH0_3_UPPER_THUP_CH3_Msk     (0xff000000UL)            /*!< ADC2 TH0_3_UPPER: THUP_CH3 (Bitfield-Mask: 0xff)      */
#define ADC2_TH0_3_UPPER_THUP_CH2_Pos     (16UL)                    /*!< ADC2 TH0_3_UPPER: THUP_CH2 (Bit 16)                   */
#define ADC2_TH0_3_UPPER_THUP_CH2_Msk     (0xff0000UL)              /*!< ADC2 TH0_3_UPPER: THUP_CH2 (Bitfield-Mask: 0xff)      */
#define ADC2_TH0_3_UPPER_THUP_CH1_Pos     (8UL)                     /*!< ADC2 TH0_3_UPPER: THUP_CH1 (Bit 8)                    */
#define ADC2_TH0_3_UPPER_THUP_CH1_Msk     (0xff00UL)                /*!< ADC2 TH0_3_UPPER: THUP_CH1 (Bitfield-Mask: 0xff)      */
#define ADC2_TH0_3_UPPER_THUP_CH0_Pos     (0UL)                     /*!< ADC2 TH0_3_UPPER: THUP_CH0 (Bit 0)                    */
#define ADC2_TH0_3_UPPER_THUP_CH0_Msk     (0xffUL)                  /*!< ADC2 TH0_3_UPPER: THUP_CH0 (Bitfield-Mask: 0xff)      */
/* ======================================================  TH4_7_LOWER  ====================================================== */
#define ADC2_TH4_7_LOWER_THLO_CH7_Pos     (24UL)                    /*!< ADC2 TH4_7_LOWER: THLO_CH7 (Bit 24)                   */
#define ADC2_TH4_7_LOWER_THLO_CH7_Msk     (0xff000000UL)            /*!< ADC2 TH4_7_LOWER: THLO_CH7 (Bitfield-Mask: 0xff)      */
#define ADC2_TH4_7_LOWER_THLO_CH6_Pos     (16UL)                    /*!< ADC2 TH4_7_LOWER: THLO_CH6 (Bit 16)                   */
#define ADC2_TH4_7_LOWER_THLO_CH6_Msk     (0xff0000UL)              /*!< ADC2 TH4_7_LOWER: THLO_CH6 (Bitfield-Mask: 0xff)      */
#define ADC2_TH4_7_LOWER_THLO_CH5_Pos     (8UL)                     /*!< ADC2 TH4_7_LOWER: THLO_CH5 (Bit 8)                    */
#define ADC2_TH4_7_LOWER_THLO_CH5_Msk     (0xff00UL)                /*!< ADC2 TH4_7_LOWER: THLO_CH5 (Bitfield-Mask: 0xff)      */
#define ADC2_TH4_7_LOWER_THLO_CH4_Pos     (0UL)                     /*!< ADC2 TH4_7_LOWER: THLO_CH4 (Bit 0)                    */
#define ADC2_TH4_7_LOWER_THLO_CH4_Msk     (0xffUL)                  /*!< ADC2 TH4_7_LOWER: THLO_CH4 (Bitfield-Mask: 0xff)      */
/* ======================================================  TH4_7_UPPER  ====================================================== */
#define ADC2_TH4_7_UPPER_THUP_CH7_Pos     (24UL)                    /*!< ADC2 TH4_7_UPPER: THUP_CH7 (Bit 24)                   */
#define ADC2_TH4_7_UPPER_THUP_CH7_Msk     (0xff000000UL)            /*!< ADC2 TH4_7_UPPER: THUP_CH7 (Bitfield-Mask: 0xff)      */
#define ADC2_TH4_7_UPPER_THUP_CH6_Pos     (16UL)                    /*!< ADC2 TH4_7_UPPER: THUP_CH6 (Bit 16)                   */
#define ADC2_TH4_7_UPPER_THUP_CH6_Msk     (0xff0000UL)              /*!< ADC2 TH4_7_UPPER: THUP_CH6 (Bitfield-Mask: 0xff)      */
#define ADC2_TH4_7_UPPER_THUP_CH5_Pos     (8UL)                     /*!< ADC2 TH4_7_UPPER: THUP_CH5 (Bit 8)                    */
#define ADC2_TH4_7_UPPER_THUP_CH5_Msk     (0xff00UL)                /*!< ADC2 TH4_7_UPPER: THUP_CH5 (Bitfield-Mask: 0xff)      */
#define ADC2_TH4_7_UPPER_THUP_CH4_Pos     (0UL)                     /*!< ADC2 TH4_7_UPPER: THUP_CH4 (Bit 0)                    */
#define ADC2_TH4_7_UPPER_THUP_CH4_Msk     (0xffUL)                  /*!< ADC2 TH4_7_UPPER: THUP_CH4 (Bitfield-Mask: 0xff)      */
/* =====================================================  TH8_11_LOWER  ====================================================== */
#define ADC2_TH8_11_LOWER_THLO_CH8_Pos    (0UL)                     /*!< ADC2 TH8_11_LOWER: THLO_CH8 (Bit 0)                   */
#define ADC2_TH8_11_LOWER_THLO_CH8_Msk    (0xffUL)                  /*!< ADC2 TH8_11_LOWER: THLO_CH8 (Bitfield-Mask: 0xff)     */
/* =====================================================  TH8_11_UPPER  ====================================================== */
#define ADC2_TH8_11_UPPER_THUP_CH8_Pos    (0UL)                     /*!< ADC2 TH8_11_UPPER: THUP_CH8 (Bit 0)                   */
#define ADC2_TH8_11_UPPER_THUP_CH8_Msk    (0xffUL)                  /*!< ADC2 TH8_11_UPPER: THUP_CH8 (Bitfield-Mask: 0xff)     */


/* =========================================================================================================================== */
/* ================                                           BDRV                                            ================ */
/* =========================================================================================================================== */

