Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
/* =========================================================  ASEQC  ========================================================= */
#define BDRV_ASEQC_HB2OFFHYSTEN_Pos       (23UL)                    /*!< BDRV ASEQC: HB2OFFHYSTEN (Bit 23)                     */
#define BDRV_ASEQC_HB2OFFHYSTEN_Msk       (0x800000UL)              /*!< BDRV ASEQC: HB2OFFHYSTEN (Bitfield-Mask: 0x01)        */
#define BDRV_ASEQC_HB2ONHYSTEN_Pos        (22UL)                    /*!< BDRV ASEQC: HB2ONHYSTEN (Bit 22)                      */
#define BDRV_ASEQC_HB2ONHYSTEN_Msk        (0x400000UL)              /*!< BDRV ASEQC: HB2ONHYSTEN (Bitfield-Mask: 0x01)         */
#define BDRV_ASEQC_HB2OPTOFFACT_Pos       (21UL)                    /*!< BDRV ASEQC: HB2OPTOFFACT (Bit 21)                     */
#define BDRV_ASEQC_HB2OPTOFFACT_Msk       (0x200000UL)              /*!< BDRV ASEQC: HB2OPTOFFACT (Bitfield-Mask: 0x01)        */
#define BDRV_ASEQC_HB2OPTONACT_Pos        (20UL)                    /*!< BDRV ASEQC: HB2OPTONACT (Bit 20)                      */
#define BDRV_ASEQC_HB2OPTONACT_Msk        (0x100000UL)              /*!< BDRV ASEQC: HB2OPTONACT (Bitfield-Mask: 0x01)         */
#define BDRV_ASEQC_HB2ASMOFFEN_Pos        (17UL)                    /*!< BDRV ASEQC: HB2ASMOFFEN (Bit 17)                      */
#define BDRV_ASEQC_HB2ASMOFFEN_Msk        (0x20000UL)               /*!< BDRV ASEQC: HB2ASMOFFEN (Bitfield-Mask: 0x01)         */
#define BDRV_ASEQC_HB2ASMONEN_Pos         (16UL)                    /*!< BDRV ASEQC: HB2ASMONEN (Bit 16)                       */
#define BDRV_ASEQC_HB2ASMONEN_Msk         (0x10000UL)               /*!< BDRV ASEQC: HB2ASMONEN (Bitfield-Mask: 0x01)          */
#define BDRV_ASEQC_HB1OFFHYSTEN_Pos       (7UL)                     /*!< BDRV ASEQC: HB1OFFHYSTEN (Bit 7)                      */
#define BDRV_ASEQC_HB1OFFHYSTEN_Msk       (0x80UL)                  /*!< BDRV ASEQC: HB1OFFHYSTEN (Bitfield-Mask: 0x01)        */
#define BDRV_ASEQC_HB1ONHYSTEN_Pos        (6UL)                     /*!< BDRV ASEQC: HB1ONHYSTEN (Bit 6)                       */
#define BDRV_ASEQC_HB1ONHYSTEN_Msk        (0x40UL)                  /*!< BDRV ASEQC: HB1ONHYSTEN (Bitfield-Mask: 0x01)         */
#define BDRV_ASEQC_HB1OPTOFFACT_Pos       (5UL)                     /*!< BDRV ASEQC: HB1OPTOFFACT (Bit 5)                      */
#define BDRV_ASEQC_HB1OPTOFFACT_Msk       (0x20UL)                  /*!< BDRV ASEQC: HB1OPTOFFACT (Bitfield-Mask: 0x01)        */
#define BDRV_ASEQC_HB1OPTONACT_Pos        (4UL)                     /*!< BDRV ASEQC: HB1OPTONACT (Bit 4)                       */
#define BDRV_ASEQC_HB1OPTONACT_Msk        (0x10UL)                  /*!< BDRV ASEQC: HB1OPTONACT (Bitfield-Mask: 0x01)         */
#define BDRV_ASEQC_HB1ASMOFFEN_Pos        (1UL)                     /*!< BDRV ASEQC: HB1ASMOFFEN (Bit 1)                       */
#define BDRV_ASEQC_HB1ASMOFFEN_Msk        (0x2UL)                   /*!< BDRV ASEQC: HB1ASMOFFEN (Bitfield-Mask: 0x01)         */
#define BDRV_ASEQC_HB1ASMONEN_Pos         (0UL)                     /*!< BDRV ASEQC: HB1ASMONEN (Bit 0)                        */
#define BDRV_ASEQC_HB1ASMONEN_Msk         (0x1UL)                   /*!< BDRV ASEQC: HB1ASMONEN (Bitfield-Mask: 0x01)          */
/* ======================================================  ASEQERRCNT  ======================================================= */
#define BDRV_ASEQERRCNT_HB2MFERRCNT_Pos   (20UL)                    /*!< BDRV ASEQERRCNT: HB2MFERRCNT (Bit 20)                 */
#define BDRV_ASEQERRCNT_HB2MFERRCNT_Msk   (0x300000UL)              /*!< BDRV ASEQERRCNT: HB2MFERRCNT (Bitfield-Mask: 0x03)    */
#define BDRV_ASEQERRCNT_HB2T12ONERRCNT_Pos (18UL)                   /*!< BDRV ASEQERRCNT: HB2T12ONERRCNT (Bit 18)              */
#define BDRV_ASEQERRCNT_HB2T12ONERRCNT_Msk (0xc0000UL)              /*!< BDRV ASEQERRCNT: HB2T12ONERRCNT (Bitfield-Mask: 0x03) */
#define BDRV_ASEQERRCNT_HB2T1OFFERRCNT_Pos (16UL)                   /*!< BDRV ASEQERRCNT: HB2T1OFFERRCNT (Bit 16)              */
#define BDRV_ASEQERRCNT_HB2T1OFFERRCNT_Msk (0x30000UL)              /*!< BDRV ASEQERRCNT: HB2T1OFFERRCNT (Bitfield-Mask: 0x03) */
#define BDRV_ASEQERRCNT_HB1MFERRCNT_Pos   (4UL)                     /*!< BDRV ASEQERRCNT: HB1MFERRCNT (Bit 4)                  */
#define BDRV_ASEQERRCNT_HB1MFERRCNT_Msk   (0x30UL)                  /*!< BDRV ASEQERRCNT: HB1MFERRCNT (Bitfield-Mask: 0x03)    */
#define BDRV_ASEQERRCNT_HB1T12ONERRCNT_Pos (2UL)                    /*!< BDRV ASEQERRCNT: HB1T12ONERRCNT (Bit 2)               */
#define BDRV_ASEQERRCNT_HB1T12ONERRCNT_Msk (0xcUL)                  /*!< BDRV ASEQERRCNT: HB1T12ONERRCNT (Bitfield-Mask: 0x03) */
#define BDRV_ASEQERRCNT_HB1T1OFFERRCNT_Pos (0UL)                    /*!< BDRV ASEQERRCNT: HB1T1OFFERRCNT (Bit 0)               */
#define BDRV_ASEQERRCNT_HB1T1OFFERRCNT_Msk (0x3UL)                  /*!< BDRV ASEQERRCNT: HB1T1OFFERRCNT (Bitfield-Mask: 0x03) */
/* ======================================================  ASEQIOFFMAX  ====================================================== */
#define BDRV_ASEQIOFFMAX_I1OFFMAX_Pos     (0UL)                     /*!< BDRV ASEQIOFFMAX: I1OFFMAX (Bit 0)                    */
#define BDRV_ASEQIOFFMAX_I1OFFMAX_Msk     (0x3fUL)                  /*!< BDRV ASEQIOFFMAX: I1OFFMAX (Bitfield-Mask: 0x3f)      */
/* ======================================================  ASEQIOFFMIN  ====================================================== */
#define BDRV_ASEQIOFFMIN_I1OFFMIN_Pos     (0UL)                     /*!< BDRV ASEQIOFFMIN: I1OFFMIN (Bit 0)                    */
#define BDRV_ASEQIOFFMIN_I1OFFMIN_Msk     (0x3fUL)                  /*!< BDRV ASEQIOFFMIN: I1OFFMIN (Bitfield-Mask: 0x3f)      */
/* ======================================================  ASEQIONMAX  ======================================================= */
#define BDRV_ASEQIONMAX_I1ONMAX_Pos       (0UL)                     /*!< BDRV ASEQIONMAX: I1ONMAX (Bit 0)                      */
#define BDRV_ASEQIONMAX_I1ONMAX_Msk       (0x3fUL)                  /*!< BDRV ASEQIONMAX: I1ONMAX (Bitfield-Mask: 0x3f)        */
/* ======================================================  ASEQIONMIN  ======================================================= */
#define BDRV_ASEQIONMIN_I1ONMIN_Pos       (0UL)                     /*!< BDRV ASEQIONMIN: I1ONMIN (Bit 0)                      */
#define BDRV_ASEQIONMIN_I1ONMIN_Msk       (0x3fUL)                  /*!< BDRV ASEQIONMIN: I1ONMIN (Bitfield-Mask: 0x3f)        */
/* ========================================================  ASEQSTS  ======================================================== */
#define BDRV_ASEQSTS_HB2ONMF_Pos          (31UL)                    /*!< BDRV ASEQSTS: HB2ONMF (Bit 31)                        */
#define BDRV_ASEQSTS_HB2ONMF_Msk          (0x80000000UL)            /*!< BDRV ASEQSTS: HB2ONMF (Bitfield-Mask: 0x01)           */
#define BDRV_ASEQSTS_HB2OFFMF_Pos         (30UL)                    /*!< BDRV ASEQSTS: HB2OFFMF (Bit 30)                       */
#define BDRV_ASEQSTS_HB2OFFMF_Msk         (0x40000000UL)            /*!< BDRV ASEQSTS: HB2OFFMF (Bitfield-Mask: 0x01)          */
#define BDRV_ASEQSTS_HB2I1ONMIN_Pos       (23UL)                    /*!< BDRV ASEQSTS: HB2I1ONMIN (Bit 23)                     */
#define BDRV_ASEQSTS_HB2I1ONMIN_Msk       (0x800000UL)              /*!< BDRV ASEQSTS: HB2I1ONMIN (Bitfield-Mask: 0x01)        */
#define BDRV_ASEQSTS_HB2T12ONMIN_Pos      (22UL)                    /*!< BDRV ASEQSTS: HB2T12ONMIN (Bit 22)                    */
#define BDRV_ASEQSTS_HB2T12ONMIN_Msk      (0x400000UL)              /*!< BDRV ASEQSTS: HB2T12ONMIN (Bitfield-Mask: 0x01)       */
#define BDRV_ASEQSTS_HB2I1ONMAX_Pos       (21UL)                    /*!< BDRV ASEQSTS: HB2I1ONMAX (Bit 21)                     */
#define BDRV_ASEQSTS_HB2I1ONMAX_Msk       (0x200000UL)              /*!< BDRV ASEQSTS: HB2I1ONMAX (Bitfield-Mask: 0x01)        */
#define BDRV_ASEQSTS_HB2T12ONMAX_Pos      (20UL)                    /*!< BDRV ASEQSTS: HB2T12ONMAX (Bit 20)                    */
#define BDRV_ASEQSTS_HB2T12ONMAX_Msk      (0x100000UL)              /*!< BDRV ASEQSTS: HB2T12ONMAX (Bitfield-Mask: 0x01)       */
#define BDRV_ASEQSTS_HB2I1OFFMIN_Pos      (19UL)                    /*!< BDRV ASEQSTS: HB2I1OFFMIN (Bit 19)                    */
#define BDRV_ASEQSTS_HB2I1OFFMIN_Msk      (0x80000UL)               /*!< BDRV ASEQSTS: HB2I1OFFMIN (Bitfield-Mask: 0x01)       */
#define BDRV_ASEQSTS_HB2T1OFFMIN_Pos      (18UL)                    /*!< BDRV ASEQSTS: HB2T1OFFMIN (Bit 18)                    */
#define BDRV_ASEQSTS_HB2T1OFFMIN_Msk      (0x40000UL)               /*!< BDRV ASEQSTS: HB2T1OFFMIN (Bitfield-Mask: 0x01)       */
#define BDRV_ASEQSTS_HB2I1OFFMAX_Pos      (17UL)                    /*!< BDRV ASEQSTS: HB2I1OFFMAX (Bit 17)                    */
#define BDRV_ASEQSTS_HB2I1OFFMAX_Msk      (0x20000UL)               /*!< BDRV ASEQSTS: HB2I1OFFMAX (Bitfield-Mask: 0x01)       */
#define BDRV_ASEQSTS_HB2T1OFFMAX_Pos      (16UL)                    /*!< BDRV ASEQSTS: HB2T1OFFMAX (Bit 16)                    */
#define BDRV_ASEQSTS_HB2T1OFFMAX_Msk      (0x10000UL)               /*!< BDRV ASEQSTS: HB2T1OFFMAX (Bitfield-Mask: 0x01)       */
#define BDRV_ASEQSTS_HB1ONMF_Pos          (15UL)                    /*!< BDRV ASEQSTS: HB1ONMF (Bit 15)                        */
#define BDRV_ASEQSTS_HB1ONMF_Msk          (0x8000UL)                /*!< BDRV ASEQSTS: HB1ONMF (Bitfield-Mask: 0x01)           */
#define BDRV_ASEQSTS_HB1OFFMF_Pos         (14UL)                    /*!< BDRV ASEQSTS: HB1OFFMF (Bit 14)                       */
#define BDRV_ASEQSTS_HB1OFFMF_Msk         (0x4000UL)                /*!< BDRV ASEQSTS: HB1OFFMF (Bitfield-Mask: 0x01)          */
#define BDRV_ASEQSTS_HB1I1ONMIN_Pos       (7UL)                     /*!< BDRV ASEQSTS: HB1I1ONMIN (Bit 7)                      */
#define BDRV_ASEQSTS_HB1I1ONMIN_Msk       (0x80UL)                  /*!< BDRV ASEQSTS: HB1I1ONMIN (Bitfield-Mask: 0x01)        */
#define BDRV_ASEQSTS_HB1T12ONMIN_Pos      (6UL)                     /*!< BDRV ASEQSTS: HB1T12ONMIN (Bit 6)                     */
#define BDRV_ASEQSTS_HB1T12ONMIN_Msk      (0x40UL)                  /*!< BDRV ASEQSTS: HB1T12ONMIN (Bitfield-Mask: 0x01)       */
#define BDRV_ASEQSTS_HB1I1ONMAX_Pos       (5UL)                     /*!< BDRV ASEQSTS: HB1I1ONMAX (Bit 5)                      */
#define BDRV_ASEQSTS_HB1I1ONMAX_Msk       (0x20UL)                  /*!< BDRV ASEQSTS: HB1I1ONMAX (Bitfield-Mask: 0x01)        */
#define BDRV_ASEQSTS_HB1T12ONMAX_Pos      (4UL)                     /*!< BDRV ASEQSTS: HB1T12ONMAX (Bit 4)                     */
#define BDRV_ASEQSTS_HB1T12ONMAX_Msk      (0x10UL)                  /*!< BDRV ASEQSTS: HB1T12ONMAX (Bitfield-Mask: 0x01)       */
#define BDRV_ASEQSTS_HB1I1OFFMIN_Pos      (3UL)                     /*!< BDRV ASEQSTS: HB1I1OFFMIN (Bit 3)                     */
#define BDRV_ASEQSTS_HB1I1OFFMIN_Msk      (0x8UL)                   /*!< BDRV ASEQSTS: HB1I1OFFMIN (Bitfield-Mask: 0x01)       */
#define BDRV_ASEQSTS_HB1T1OFFMIN_Pos      (2UL)                     /*!< BDRV ASEQSTS: HB1T1OFFMIN (Bit 2)                     */
#define BDRV_ASEQSTS_HB1T1OFFMIN_Msk      (0x4UL)                   /*!< BDRV ASEQSTS: HB1T1OFFMIN (Bitfield-Mask: 0x01)       */
#define BDRV_ASEQSTS_HB1I1OFFMAX_Pos      (1UL)                     /*!< BDRV ASEQSTS: HB1I1OFFMAX (Bit 1)                     */
#define BDRV_ASEQSTS_HB1I1OFFMAX_Msk      (0x2UL)                   /*!< BDRV ASEQSTS: HB1I1OFFMAX (Bitfield-Mask: 0x01)       */
#define BDRV_ASEQSTS_HB1T1OFFMAX_Pos      (0UL)                     /*!< BDRV ASEQSTS: HB1T1OFFMAX (Bit 0)                     */
#define BDRV_ASEQSTS_HB1T1OFFMAX_Msk      (0x1UL)                   /*!< BDRV ASEQSTS: HB1T1OFFMAX (Bitfield-Mask: 0x01)       */
/* ======================================================  CP_CLK_CTRL  ====================================================== */
#define BDRV_CP_CLK_CTRL_CPCLKDIS_SET_Pos (16UL)                    /*!< BDRV CP_CLK_CTRL: CPCLKDIS_SET (Bit 16)               */
#define BDRV_CP_CLK_CTRL_CPCLKDIS_SET_Msk (0x10000UL)               /*!< BDRV CP_CLK_CTRL: CPCLKDIS_SET (Bitfield-Mask: 0x01)  */
#define BDRV_CP_CLK_CTRL_CPCLK_EN_Pos     (15UL)                    /*!< BDRV CP_CLK_CTRL: CPCLK_EN (Bit 15)                   */
#define BDRV_CP_CLK_CTRL_CPCLK_EN_Msk     (0x8000UL)                /*!< BDRV CP_CLK_CTRL: CPCLK_EN (Bitfield-Mask: 0x01)      */
#define BDRV_CP_CLK_CTRL_F_CP_Pos         (13UL)                    /*!< BDRV CP_CLK_CTRL: F_CP (Bit 13)                       */
#define BDRV_CP_CLK_CTRL_F_CP_Msk         (0x6000UL)                /*!< BDRV CP_CLK_CTRL: F_CP (Bitfield-Mask: 0x03)          */
#define BDRV_CP_CLK_CTRL_DITH_UPPER_Pos   (8UL)                     /*!< BDRV CP_CLK_CTRL: DITH_UPPER (Bit 8)                  */
#define BDRV_CP_CLK_CTRL_DITH_UPPER_Msk   (0x1f00UL)                /*!< BDRV CP_CLK_CTRL: DITH_UPPER (Bitfield-Mask: 0x1f)    */
#define BDRV_CP_CLK_CTRL_DITH_LOWER_Pos   (0UL)                     /*!< BDRV CP_CLK_CTRL: DITH_LOWER (Bit 0)                  */
#define BDRV_CP_CLK_CTRL_DITH_LOWER_Msk   (0x1fUL)                  /*!< BDRV CP_CLK_CTRL: DITH_LOWER (Bitfield-Mask: 0x1f)    */
/* ========================================================  CP_CTRL  ======================================================== */
#define BDRV_CP_CTRL_CP_STAGE_SEL_Pos     (29UL)                    /*!< BDRV CP_CTRL: CP_STAGE_SEL (Bit 29)                   */
#define BDRV_CP_CTRL_CP_STAGE_SEL_Msk     (0x60000000UL)            /*!< BDRV CP_CTRL: CP_STAGE_SEL (Bitfield-Mask: 0x03)      */
#define BDRV_CP_CTRL_VCP14_15V_SEL_Pos    (28UL)                    /*!< BDRV CP_CTRL: VCP14_15V_SEL (Bit 28)                  */
#define BDRV_CP_CTRL_VCP14_15V_SEL_Msk    (0x10000000UL)            /*!< BDRV CP_CTRL: VCP14_15V_SEL (Bitfield-Mask: 0x01)     */
#define BDRV_CP_CTRL_VTHVCP_TRIM_Pos      (26UL)                    /*!< BDRV CP_CTRL: VTHVCP_TRIM (Bit 26)                    */
#define BDRV_CP_CTRL_VTHVCP_TRIM_Msk      (0xc000000UL)             /*!< BDRV CP_CTRL: VTHVCP_TRIM (Bitfield-Mask: 0x03)       */
#define BDRV_CP_CTRL_VCP9V_SET_Pos        (25UL)                    /*!< BDRV CP_CTRL: VCP9V_SET (Bit 25)                      */
#define BDRV_CP_CTRL_VCP9V_SET_Msk        (0x2000000UL)             /*!< BDRV CP_CTRL: VCP9V_SET (Bitfield-Mask: 0x01)         */
#define BDRV_CP_CTRL_CPLOPWRM_EN_Pos      (24UL)                    /*!< BDRV CP_CTRL: CPLOPWRM_EN (Bit 24)                    */
#define BDRV_CP_CTRL_CPLOPWRM_EN_Msk      (0x1000000UL)             /*!< BDRV CP_CTRL: CPLOPWRM_EN (Bitfield-Mask: 0x01)       */
#define BDRV_CP_CTRL_DRVx_VSDUP_DIS_Pos   (22UL)                    /*!< BDRV CP_CTRL: DRVx_VSDUP_DIS (Bit 22)                 */
#define BDRV_CP_CTRL_DRVx_VSDUP_DIS_Msk   (0x400000UL)              /*!< BDRV CP_CTRL: DRVx_VSDUP_DIS (Bitfield-Mask: 0x01)    */
#define BDRV_CP_CTRL_DRVx_VSDLO_DIS_Pos   (20UL)                    /*!< BDRV CP_CTRL: DRVx_VSDLO_DIS (Bit 20)                 */
#define BDRV_CP_CTRL_DRVx_VSDLO_DIS_Msk   (0x100000UL)              /*!< BDRV CP_CTRL: DRVx_VSDLO_DIS (Bitfield-Mask: 0x01)    */
#define BDRV_CP_CTRL_DRVx_VCPUP_DIS_Pos   (18UL)                    /*!< BDRV CP_CTRL: DRVx_VCPUP_DIS (Bit 18)                 */
#define BDRV_CP_CTRL_DRVx_VCPUP_DIS_Msk   (0x40000UL)               /*!< BDRV CP_CTRL: DRVx_VCPUP_DIS (Bitfield-Mask: 0x01)    */
#define BDRV_CP_CTRL_DRVx_VCPLO_SDEN_Pos  (17UL)                    /*!< BDRV CP_CTRL: DRVx_VCPLO_SDEN (Bit 17)                */
#define BDRV_CP_CTRL_DRVx_VCPLO_SDEN_Msk  (0x20000UL)               /*!< BDRV CP_CTRL: DRVx_VCPLO_SDEN (Bitfield-Mask: 0x01)   */
#define BDRV_CP_CTRL_DRVx_VCPLO_DIS_Pos   (16UL)                    /*!< BDRV CP_CTRL: DRVx_VCPLO_DIS (Bit 16)                 */
#define BDRV_CP_CTRL_DRVx_VCPLO_DIS_Msk   (0x10000UL)               /*!< BDRV CP_CTRL: DRVx_VCPLO_DIS (Bitfield-Mask: 0x01)    */
#define BDRV_CP_CTRL_VCP_LOWTH2_Pos       (8UL)                     /*!< BDRV CP_CTRL: VCP_LOWTH2 (Bit 8)                      */
#define BDRV_CP_CTRL_VCP_LOWTH2_Msk       (0x700UL)                 /*!< BDRV CP_CTRL: VCP_LOWTH2 (Bitfield-Mask: 0x07)        */
#define BDRV_CP_CTRL_CP_RDY_EN_Pos        (2UL)                     /*!< BDRV CP_CTRL: CP_RDY_EN (Bit 2)                       */
#define BDRV_CP_CTRL_CP_RDY_EN_Msk        (0x4UL)                   /*!< BDRV CP_CTRL: CP_RDY_EN (Bitfield-Mask: 0x01)         */
#define BDRV_CP_CTRL_CP_EN_Pos            (0UL)                     /*!< BDRV CP_CTRL: CP_EN (Bit 0)                           */
#define BDRV_CP_CTRL_CP_EN_Msk            (0x1UL)                   /*!< BDRV CP_CTRL: CP_EN (Bitfield-Mask: 0x01)             */
/* =======================================================  CP_IRQCLR  ======================================================= */
#define BDRV_CP_IRQCLR_VSD_UPTH_SC_Pos    (31UL)                    /*!< BDRV CP_IRQCLR: VSD_UPTH_SC (Bit 31)                  */
#define BDRV_CP_IRQCLR_VSD_UPTH_SC_Msk    (0x80000000UL)            /*!< BDRV CP_IRQCLR: VSD_UPTH_SC (Bitfield-Mask: 0x01)     */
#define BDRV_CP_IRQCLR_VSD_LOTH_SC_Pos    (29UL)                    /*!< BDRV CP_IRQCLR: VSD_LOTH_SC (Bit 29)                  */
#define BDRV_CP_IRQCLR_VSD_LOTH_SC_Msk    (0x20000000UL)            /*!< BDRV CP_IRQCLR: VSD_LOTH_SC (Bitfield-Mask: 0x01)     */
#define BDRV_CP_IRQCLR_VCP_UPTH_SC_Pos    (27UL)                    /*!< BDRV CP_IRQCLR: VCP_UPTH_SC (Bit 27)                  */
#define BDRV_CP_IRQCLR_VCP_UPTH_SC_Msk    (0x8000000UL)             /*!< BDRV CP_IRQCLR: VCP_UPTH_SC (Bitfield-Mask: 0x01)     */
#define BDRV_CP_IRQCLR_VCP_LOTH1_SC_Pos   (25UL)                    /*!< BDRV CP_IRQCLR: VCP_LOTH1_SC (Bit 25)                 */
#define BDRV_CP_IRQCLR_VCP_LOTH1_SC_Msk   (0x2000000UL)             /*!< BDRV CP_IRQCLR: VCP_LOTH1_SC (Bitfield-Mask: 0x01)    */
#define BDRV_CP_IRQCLR_VCP_LOTH2_SC_Pos   (24UL)                    /*!< BDRV CP_IRQCLR: VCP_LOTH2_SC (Bit 24)                 */
#define BDRV_CP_IRQCLR_VCP_LOTH2_SC_Msk   (0x1000000UL)             /*!< BDRV CP_IRQCLR: VCP_LOTH2_SC (Bitfield-Mask: 0x01)    */
#define BDRV_CP_IRQCLR_VCP_OTSD_SC_Pos    (20UL)                    /*!< BDRV CP_IRQCLR: VCP_OTSD_SC (Bit 20)                  */
#define BDRV_CP_IRQCLR_VCP_OTSD_SC_Msk    (0x100000UL)              /*!< BDRV CP_IRQCLR: VCP_OTSD_SC (Bitfield-Mask: 0x01)     */
#define BDRV_CP_IRQCLR_VCP_OTW_SC_Pos     (16UL)                    /*!< BDRV CP_IRQCLR: VCP_OTW_SC (Bit 16)                   */
#define BDRV_CP_IRQCLR_VCP_OTW_SC_Msk     (0x10000UL)               /*!< BDRV CP_IRQCLR: VCP_OTW_SC (Bitfield-Mask: 0x01)      */
#define BDRV_CP_IRQCLR_VSD_UPTH_ISC_Pos   (15UL)                    /*!< BDRV CP_IRQCLR: VSD_UPTH_ISC (Bit 15)                 */
#define BDRV_CP_IRQCLR_VSD_UPTH_ISC_Msk   (0x8000UL)                /*!< BDRV CP_IRQCLR: VSD_UPTH_ISC (Bitfield-Mask: 0x01)    */
#define BDRV_CP_IRQCLR_VSD_LOTH_ISC_Pos   (13UL)                    /*!< BDRV CP_IRQCLR: VSD_LOTH_ISC (Bit 13)                 */
#define BDRV_CP_IRQCLR_VSD_LOTH_ISC_Msk   (0x2000UL)                /*!< BDRV CP_IRQCLR: VSD_LOTH_ISC (Bitfield-Mask: 0x01)    */
#define BDRV_CP_IRQCLR_VCP_UPTH_ISC_Pos   (11UL)                    /*!< BDRV CP_IRQCLR: VCP_UPTH_ISC (Bit 11)                 */
#define BDRV_CP_IRQCLR_VCP_UPTH_ISC_Msk   (0x800UL)                 /*!< BDRV CP_IRQCLR: VCP_UPTH_ISC (Bitfield-Mask: 0x01)    */
#define BDRV_CP_IRQCLR_VCP_LOTH1_ISC_Pos  (9UL)                     /*!< BDRV CP_IRQCLR: VCP_LOTH1_ISC (Bit 9)                 */
#define BDRV_CP_IRQCLR_VCP_LOTH1_ISC_Msk  (0x200UL)                 /*!< BDRV CP_IRQCLR: VCP_LOTH1_ISC (Bitfield-Mask: 0x01)   */
#define BDRV_CP_IRQCLR_VCP_LOTH2_ISC_Pos  (8UL)                     /*!< BDRV CP_IRQCLR: VCP_LOTH2_ISC (Bit 8)                 */
#define BDRV_CP_IRQCLR_VCP_LOTH2_ISC_Msk  (0x100UL)                 /*!< BDRV CP_IRQCLR: VCP_LOTH2_ISC (Bitfield-Mask: 0x01)   */
#define BDRV_CP_IRQCLR_VCP_OTSD_ISC_Pos   (4UL)                     /*!< BDRV CP_IRQCLR: VCP_OTSD_ISC (Bit 4)                  */
#define BDRV_CP_IRQCLR_VCP_OTSD_ISC_Msk   (0x10UL)                  /*!< BDRV CP_IRQCLR: VCP_OTSD_ISC (Bitfield-Mask: 0x01)    */
#define BDRV_CP_IRQCLR_VCP_OTW_ISC_Pos    (0UL)                     /*!< BDRV CP_IRQCLR: VCP_OTW_ISC (Bit 0)                   */
#define BDRV_CP_IRQCLR_VCP_OTW_ISC_Msk    (0x1UL)                   /*!< BDRV CP_IRQCLR: VCP_OTW_ISC (Bitfield-Mask: 0x01)     */
/* =======================================================  CP_IRQEN  ======================================================== */
#define BDRV_CP_IRQEN_VSD_UPTH_IEN_Pos    (15UL)                    /*!< BDRV CP_IRQEN: VSD_UPTH_IEN (Bit 15)                  */
#define BDRV_CP_IRQEN_VSD_UPTH_IEN_Msk    (0x8000UL)                /*!< BDRV CP_IRQEN: VSD_UPTH_IEN (Bitfield-Mask: 0x01)     */
#define BDRV_CP_IRQEN_VSD_LOTH_IEN_Pos    (13UL)                    /*!< BDRV CP_IRQEN: VSD_LOTH_IEN (Bit 13)                  */
#define BDRV_CP_IRQEN_VSD_LOTH_IEN_Msk    (0x2000UL)                /*!< BDRV CP_IRQEN: VSD_LOTH_IEN (Bitfield-Mask: 0x01)     */
#define BDRV_CP_IRQEN_VCP_UPTH_IEN_Pos    (11UL)                    /*!< BDRV CP_IRQEN: VCP_UPTH_IEN (Bit 11)                  */
#define BDRV_CP_IRQEN_VCP_UPTH_IEN_Msk    (0x800UL)                 /*!< BDRV CP_IRQEN: VCP_UPTH_IEN (Bitfield-Mask: 0x01)     */
#define BDRV_CP_IRQEN_VCP_LOTH1_IEN_Pos   (9UL)                     /*!< BDRV CP_IRQEN: VCP_LOTH1_IEN (Bit 9)                  */
#define BDRV_CP_IRQEN_VCP_LOTH1_IEN_Msk   (0x200UL)                 /*!< BDRV CP_IRQEN: VCP_LOTH1_IEN (Bitfield-Mask: 0x01)    */
#define BDRV_CP_IRQEN_VCP_LOTH2_IEN_Pos   (8UL)                     /*!< BDRV CP_IRQEN: VCP_LOTH2_IEN (Bit 8)                  */
#define BDRV_CP_IRQEN_VCP_LOTH2_IEN_Msk   (0x100UL)                 /*!< BDRV CP_IRQEN: VCP_LOTH2_IEN (Bitfield-Mask: 0x01)    */
#define BDRV_CP_IRQEN_VCP_OTSD_IEN_Pos    (4UL)                     /*!< BDRV CP_IRQEN: VCP_OTSD_IEN (Bit 4)                   */
#define BDRV_CP_IRQEN_VCP_OTSD_IEN_Msk    (0x10UL)                  /*!< BDRV CP_IRQEN: VCP_OTSD_IEN (Bitfield-Mask: 0x01)     */
#define BDRV_CP_IRQEN_VCP_OTW_IEN_Pos     (0UL)                     /*!< BDRV CP_IRQEN: VCP_OTW_IEN (Bit 0)                    */
#define BDRV_CP_IRQEN_VCP_OTW_IEN_Msk     (0x1UL)                   /*!< BDRV CP_IRQEN: VCP_OTW_IEN (Bitfield-Mask: 0x01)      */
/* ========================================================  CP_IRQS  ======================================================== */
#define BDRV_CP_IRQS_VSD_UPTH_STS_Pos     (31UL)                    /*!< BDRV CP_IRQS: VSD_UPTH_STS (Bit 31)                   */
#define BDRV_CP_IRQS_VSD_UPTH_STS_Msk     (0x80000000UL)            /*!< BDRV CP_IRQS: VSD_UPTH_STS (Bitfield-Mask: 0x01)      */
#define BDRV_CP_IRQS_VSD_LOTH_STS_Pos     (29UL)                    /*!< BDRV CP_IRQS: VSD_LOTH_STS (Bit 29)                   */
#define BDRV_CP_IRQS_VSD_LOTH_STS_Msk     (0x20000000UL)            /*!< BDRV CP_IRQS: VSD_LOTH_STS (Bitfield-Mask: 0x01)      */
#define BDRV_CP_IRQS_VCP_UPTH_STS_Pos     (27UL)                    /*!< BDRV CP_IRQS: VCP_UPTH_STS (Bit 27)                   */
#define BDRV_CP_IRQS_VCP_UPTH_STS_Msk     (0x8000000UL)             /*!< BDRV CP_IRQS: VCP_UPTH_STS (Bitfield-Mask: 0x01)      */
#define BDRV_CP_IRQS_VCP_LOTH1_STS_Pos    (25UL)                    /*!< BDRV CP_IRQS: VCP_LOTH1_STS (Bit 25)                  */
#define BDRV_CP_IRQS_VCP_LOTH1_STS_Msk    (0x2000000UL)             /*!< BDRV CP_IRQS: VCP_LOTH1_STS (Bitfield-Mask: 0x01)     */
#define BDRV_CP_IRQS_VCP_LOTH2_STS_Pos    (24UL)                    /*!< BDRV CP_IRQS: VCP_LOTH2_STS (Bit 24)                  */
#define BDRV_CP_IRQS_VCP_LOTH2_STS_Msk    (0x1000000UL)             /*!< BDRV CP_IRQS: VCP_LOTH2_STS (Bitfield-Mask: 0x01)     */
