Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
#define BDRV_CP_IRQS_VCP_OTSD_STS_Pos     (20UL)                    /*!< BDRV CP_IRQS: VCP_OTSD_STS (Bit 20)                   */
#define BDRV_CP_IRQS_VCP_OTSD_STS_Msk     (0x100000UL)              /*!< BDRV CP_IRQS: VCP_OTSD_STS (Bitfield-Mask: 0x01)      */
#define BDRV_CP_IRQS_VCP_OTW_STS_Pos      (16UL)                    /*!< BDRV CP_IRQS: VCP_OTW_STS (Bit 16)                    */
#define BDRV_CP_IRQS_VCP_OTW_STS_Msk      (0x10000UL)               /*!< BDRV CP_IRQS: VCP_OTW_STS (Bitfield-Mask: 0x01)       */
#define BDRV_CP_IRQS_VSD_UPTH_IS_Pos      (15UL)                    /*!< BDRV CP_IRQS: VSD_UPTH_IS (Bit 15)                    */
#define BDRV_CP_IRQS_VSD_UPTH_IS_Msk      (0x8000UL)                /*!< BDRV CP_IRQS: VSD_UPTH_IS (Bitfield-Mask: 0x01)       */
#define BDRV_CP_IRQS_VSD_LOTH_IS_Pos      (13UL)                    /*!< BDRV CP_IRQS: VSD_LOTH_IS (Bit 13)                    */
#define BDRV_CP_IRQS_VSD_LOTH_IS_Msk      (0x2000UL)                /*!< BDRV CP_IRQS: VSD_LOTH_IS (Bitfield-Mask: 0x01)       */
#define BDRV_CP_IRQS_VCP_UPTH_IS_Pos      (11UL)                    /*!< BDRV CP_IRQS: VCP_UPTH_IS (Bit 11)                    */
#define BDRV_CP_IRQS_VCP_UPTH_IS_Msk      (0x800UL)                 /*!< BDRV CP_IRQS: VCP_UPTH_IS (Bitfield-Mask: 0x01)       */
#define BDRV_CP_IRQS_VCP_LOTH1_IS_Pos     (9UL)                     /*!< BDRV CP_IRQS: VCP_LOTH1_IS (Bit 9)                    */
#define BDRV_CP_IRQS_VCP_LOTH1_IS_Msk     (0x200UL)                 /*!< BDRV CP_IRQS: VCP_LOTH1_IS (Bitfield-Mask: 0x01)      */
#define BDRV_CP_IRQS_VCP_LOTH2_IS_Pos     (8UL)                     /*!< BDRV CP_IRQS: VCP_LOTH2_IS (Bit 8)                    */
#define BDRV_CP_IRQS_VCP_LOTH2_IS_Msk     (0x100UL)                 /*!< BDRV CP_IRQS: VCP_LOTH2_IS (Bitfield-Mask: 0x01)      */
#define BDRV_CP_IRQS_VCP_OTSD_IS_Pos      (4UL)                     /*!< BDRV CP_IRQS: VCP_OTSD_IS (Bit 4)                     */
#define BDRV_CP_IRQS_VCP_OTSD_IS_Msk      (0x10UL)                  /*!< BDRV CP_IRQS: VCP_OTSD_IS (Bitfield-Mask: 0x01)       */
#define BDRV_CP_IRQS_VCP_OTW_IS_Pos       (0UL)                     /*!< BDRV CP_IRQS: VCP_OTW_IS (Bit 0)                      */
#define BDRV_CP_IRQS_VCP_OTW_IS_Msk       (0x1UL)                   /*!< BDRV CP_IRQS: VCP_OTW_IS (Bitfield-Mask: 0x01)        */
/* =========================================================  CTRL1  ========================================================= */
#define BDRV_CTRL1_HS2_OC_DIS_Pos         (31UL)                    /*!< BDRV CTRL1: HS2_OC_DIS (Bit 31)                       */
#define BDRV_CTRL1_HS2_OC_DIS_Msk         (0x80000000UL)            /*!< BDRV CTRL1: HS2_OC_DIS (Bitfield-Mask: 0x01)          */
#define BDRV_CTRL1_HS2_SUPERR_STS_Pos     (29UL)                    /*!< BDRV CTRL1: HS2_SUPERR_STS (Bit 29)                   */
#define BDRV_CTRL1_HS2_SUPERR_STS_Msk     (0x20000000UL)            /*!< BDRV CTRL1: HS2_SUPERR_STS (Bitfield-Mask: 0x01)      */
#define BDRV_CTRL1_HS2_DCS_EN_Pos         (27UL)                    /*!< BDRV CTRL1: HS2_DCS_EN (Bit 27)                       */
#define BDRV_CTRL1_HS2_DCS_EN_Msk         (0x8000000UL)             /*!< BDRV CTRL1: HS2_DCS_EN (Bitfield-Mask: 0x01)          */
#define BDRV_CTRL1_HS2_ON_Pos             (26UL)                    /*!< BDRV CTRL1: HS2_ON (Bit 26)                           */
#define BDRV_CTRL1_HS2_ON_Msk             (0x4000000UL)             /*!< BDRV CTRL1: HS2_ON (Bitfield-Mask: 0x01)              */
#define BDRV_CTRL1_HS2_PWM_Pos            (25UL)                    /*!< BDRV CTRL1: HS2_PWM (Bit 25)                          */
#define BDRV_CTRL1_HS2_PWM_Msk            (0x2000000UL)             /*!< BDRV CTRL1: HS2_PWM (Bitfield-Mask: 0x01)             */
#define BDRV_CTRL1_HS2_EN_Pos             (24UL)                    /*!< BDRV CTRL1: HS2_EN (Bit 24)                           */
#define BDRV_CTRL1_HS2_EN_Msk             (0x1000000UL)             /*!< BDRV CTRL1: HS2_EN (Bitfield-Mask: 0x01)              */
#define BDRV_CTRL1_HS1_OC_DIS_Pos         (23UL)                    /*!< BDRV CTRL1: HS1_OC_DIS (Bit 23)                       */
#define BDRV_CTRL1_HS1_OC_DIS_Msk         (0x800000UL)              /*!< BDRV CTRL1: HS1_OC_DIS (Bitfield-Mask: 0x01)          */
#define BDRV_CTRL1_HS1_SUPERR_STS_Pos     (21UL)                    /*!< BDRV CTRL1: HS1_SUPERR_STS (Bit 21)                   */
#define BDRV_CTRL1_HS1_SUPERR_STS_Msk     (0x200000UL)              /*!< BDRV CTRL1: HS1_SUPERR_STS (Bitfield-Mask: 0x01)      */
#define BDRV_CTRL1_HS1_DCS_EN_Pos         (19UL)                    /*!< BDRV CTRL1: HS1_DCS_EN (Bit 19)                       */
#define BDRV_CTRL1_HS1_DCS_EN_Msk         (0x80000UL)               /*!< BDRV CTRL1: HS1_DCS_EN (Bitfield-Mask: 0x01)          */
#define BDRV_CTRL1_HS1_ON_Pos             (18UL)                    /*!< BDRV CTRL1: HS1_ON (Bit 18)                           */
#define BDRV_CTRL1_HS1_ON_Msk             (0x40000UL)               /*!< BDRV CTRL1: HS1_ON (Bitfield-Mask: 0x01)              */
#define BDRV_CTRL1_HS1_PWM_Pos            (17UL)                    /*!< BDRV CTRL1: HS1_PWM (Bit 17)                          */
#define BDRV_CTRL1_HS1_PWM_Msk            (0x20000UL)               /*!< BDRV CTRL1: HS1_PWM (Bitfield-Mask: 0x01)             */
#define BDRV_CTRL1_HS1_EN_Pos             (16UL)                    /*!< BDRV CTRL1: HS1_EN (Bit 16)                           */
#define BDRV_CTRL1_HS1_EN_Msk             (0x10000UL)               /*!< BDRV CTRL1: HS1_EN (Bitfield-Mask: 0x01)              */
#define BDRV_CTRL1_LS2_OC_DIS_Pos         (15UL)                    /*!< BDRV CTRL1: LS2_OC_DIS (Bit 15)                       */
#define BDRV_CTRL1_LS2_OC_DIS_Msk         (0x8000UL)                /*!< BDRV CTRL1: LS2_OC_DIS (Bitfield-Mask: 0x01)          */
#define BDRV_CTRL1_LS2_SUPERR_STS_Pos     (13UL)                    /*!< BDRV CTRL1: LS2_SUPERR_STS (Bit 13)                   */
#define BDRV_CTRL1_LS2_SUPERR_STS_Msk     (0x2000UL)                /*!< BDRV CTRL1: LS2_SUPERR_STS (Bitfield-Mask: 0x01)      */
#define BDRV_CTRL1_LS2_ON_Pos             (10UL)                    /*!< BDRV CTRL1: LS2_ON (Bit 10)                           */
#define BDRV_CTRL1_LS2_ON_Msk             (0x400UL)                 /*!< BDRV CTRL1: LS2_ON (Bitfield-Mask: 0x01)              */
#define BDRV_CTRL1_LS2_PWM_Pos            (9UL)                     /*!< BDRV CTRL1: LS2_PWM (Bit 9)                           */
#define BDRV_CTRL1_LS2_PWM_Msk            (0x200UL)                 /*!< BDRV CTRL1: LS2_PWM (Bitfield-Mask: 0x01)             */
#define BDRV_CTRL1_LS2_EN_Pos             (8UL)                     /*!< BDRV CTRL1: LS2_EN (Bit 8)                            */
#define BDRV_CTRL1_LS2_EN_Msk             (0x100UL)                 /*!< BDRV CTRL1: LS2_EN (Bitfield-Mask: 0x01)              */
#define BDRV_CTRL1_LS1_OC_DIS_Pos         (7UL)                     /*!< BDRV CTRL1: LS1_OC_DIS (Bit 7)                        */
#define BDRV_CTRL1_LS1_OC_DIS_Msk         (0x80UL)                  /*!< BDRV CTRL1: LS1_OC_DIS (Bitfield-Mask: 0x01)          */
#define BDRV_CTRL1_LS1_SUPERR_STS_Pos     (5UL)                     /*!< BDRV CTRL1: LS1_SUPERR_STS (Bit 5)                    */
#define BDRV_CTRL1_LS1_SUPERR_STS_Msk     (0x20UL)                  /*!< BDRV CTRL1: LS1_SUPERR_STS (Bitfield-Mask: 0x01)      */
#define BDRV_CTRL1_LS1_ON_Pos             (2UL)                     /*!< BDRV CTRL1: LS1_ON (Bit 2)                            */
#define BDRV_CTRL1_LS1_ON_Msk             (0x4UL)                   /*!< BDRV CTRL1: LS1_ON (Bitfield-Mask: 0x01)              */
#define BDRV_CTRL1_LS1_PWM_Pos            (1UL)                     /*!< BDRV CTRL1: LS1_PWM (Bit 1)                           */
#define BDRV_CTRL1_LS1_PWM_Msk            (0x2UL)                   /*!< BDRV CTRL1: LS1_PWM (Bitfield-Mask: 0x01)             */
#define BDRV_CTRL1_LS1_EN_Pos             (0UL)                     /*!< BDRV CTRL1: LS1_EN (Bit 0)                            */
#define BDRV_CTRL1_LS1_EN_Msk             (0x1UL)                   /*!< BDRV CTRL1: LS1_EN (Bitfield-Mask: 0x01)              */
/* =========================================================  CTRL2  ========================================================= */
#define BDRV_CTRL2_DLY_DIAG_DIRSEL_Pos    (31UL)                    /*!< BDRV CTRL2: DLY_DIAG_DIRSEL (Bit 31)                  */
#define BDRV_CTRL2_DLY_DIAG_DIRSEL_Msk    (0x80000000UL)            /*!< BDRV CTRL2: DLY_DIAG_DIRSEL (Bitfield-Mask: 0x01)     */
#define BDRV_CTRL2_DLY_DIAG_CHSEL_Pos     (28UL)                    /*!< BDRV CTRL2: DLY_DIAG_CHSEL (Bit 28)                   */
#define BDRV_CTRL2_DLY_DIAG_CHSEL_Msk     (0x70000000UL)            /*!< BDRV CTRL2: DLY_DIAG_CHSEL (Bitfield-Mask: 0x07)      */
#define BDRV_CTRL2_DLY_DIAG_STS_Pos       (27UL)                    /*!< BDRV CTRL2: DLY_DIAG_STS (Bit 27)                     */
#define BDRV_CTRL2_DLY_DIAG_STS_Msk       (0x8000000UL)             /*!< BDRV CTRL2: DLY_DIAG_STS (Bitfield-Mask: 0x01)        */
#define BDRV_CTRL2_DLY_DIAG_SCLR_Pos      (26UL)                    /*!< BDRV CTRL2: DLY_DIAG_SCLR (Bit 26)                    */
#define BDRV_CTRL2_DLY_DIAG_SCLR_Msk      (0x4000000UL)             /*!< BDRV CTRL2: DLY_DIAG_SCLR (Bitfield-Mask: 0x01)       */
#define BDRV_CTRL2_DLY_DIAG_TIM_Pos       (16UL)                    /*!< BDRV CTRL2: DLY_DIAG_TIM (Bit 16)                     */
#define BDRV_CTRL2_DLY_DIAG_TIM_Msk       (0x3ff0000UL)             /*!< BDRV CTRL2: DLY_DIAG_TIM (Bitfield-Mask: 0x3ff)       */
#define BDRV_CTRL2_HB2OFFSEQCNF_Pos       (3UL)                     /*!< BDRV CTRL2: HB2OFFSEQCNF (Bit 3)                      */
#define BDRV_CTRL2_HB2OFFSEQCNF_Msk       (0x8UL)                   /*!< BDRV CTRL2: HB2OFFSEQCNF (Bitfield-Mask: 0x01)        */
#define BDRV_CTRL2_HB1OFFSEQCNF_Pos       (2UL)                     /*!< BDRV CTRL2: HB1OFFSEQCNF (Bit 2)                      */
#define BDRV_CTRL2_HB1OFFSEQCNF_Msk       (0x4UL)                   /*!< BDRV CTRL2: HB1OFFSEQCNF (Bitfield-Mask: 0x01)        */
#define BDRV_CTRL2_HB2ONSEQCNF_Pos        (1UL)                     /*!< BDRV CTRL2: HB2ONSEQCNF (Bit 1)                       */
#define BDRV_CTRL2_HB2ONSEQCNF_Msk        (0x2UL)                   /*!< BDRV CTRL2: HB2ONSEQCNF (Bitfield-Mask: 0x01)         */
#define BDRV_CTRL2_HB1ONSEQCNF_Pos        (0UL)                     /*!< BDRV CTRL2: HB1ONSEQCNF (Bit 0)                       */
#define BDRV_CTRL2_HB1ONSEQCNF_Msk        (0x1UL)                   /*!< BDRV CTRL2: HB1ONSEQCNF (Bitfield-Mask: 0x01)         */
/* =========================================================  CTRL3  ========================================================= */
#define BDRV_CTRL3_DRV_CCP_DIS_Pos        (30UL)                    /*!< BDRV CTRL3: DRV_CCP_DIS (Bit 30)                      */
#define BDRV_CTRL3_DRV_CCP_DIS_Msk        (0x40000000UL)            /*!< BDRV CTRL3: DRV_CCP_DIS (Bitfield-Mask: 0x01)         */
#define BDRV_CTRL3_DRV_CCP_TMUL_Pos       (28UL)                    /*!< BDRV CTRL3: DRV_CCP_TMUL (Bit 28)                     */
#define BDRV_CTRL3_DRV_CCP_TMUL_Msk       (0x30000000UL)            /*!< BDRV CTRL3: DRV_CCP_TMUL (Bitfield-Mask: 0x03)        */
#define BDRV_CTRL3_DRV_CCP_TIMSEL_Pos     (24UL)                    /*!< BDRV CTRL3: DRV_CCP_TIMSEL (Bit 24)                   */
#define BDRV_CTRL3_DRV_CCP_TIMSEL_Msk     (0x3000000UL)             /*!< BDRV CTRL3: DRV_CCP_TIMSEL (Bitfield-Mask: 0x03)      */
#define BDRV_CTRL3_DSMONVTH_Pos           (16UL)                    /*!< BDRV CTRL3: DSMONVTH (Bit 16)                         */
#define BDRV_CTRL3_DSMONVTH_Msk           (0x70000UL)               /*!< BDRV CTRL3: DSMONVTH (Bitfield-Mask: 0x07)            */
/* ======================================================  DCTRIM_DRVx  ====================================================== */
#define BDRV_DCTRIM_DRVx_COMPENS_LS_Pos   (16UL)                    /*!< BDRV DCTRIM_DRVx: COMPENS_LS (Bit 16)                 */
#define BDRV_DCTRIM_DRVx_COMPENS_LS_Msk   (0x70000UL)               /*!< BDRV DCTRIM_DRVx: COMPENS_LS (Bitfield-Mask: 0x07)    */
#define BDRV_DCTRIM_DRVx_COMPENS_HS_Pos   (8UL)                     /*!< BDRV DCTRIM_DRVx: COMPENS_HS (Bit 8)                  */
#define BDRV_DCTRIM_DRVx_COMPENS_HS_Msk   (0x700UL)                 /*!< BDRV DCTRIM_DRVx: COMPENS_HS (Bitfield-Mask: 0x07)    */
/* =====================================================  HB1ASEQOFFVAL  ===================================================== */
#define BDRV_HB1ASEQOFFVAL_HB1_OFFVALVF_CLR_Pos (31UL)              /*!< BDRV HB1ASEQOFFVAL: HB1_OFFVALVF_CLR (Bit 31)         */
#define BDRV_HB1ASEQOFFVAL_HB1_OFFVALVF_CLR_Msk (0x80000000UL)      /*!< BDRV HB1ASEQOFFVAL: HB1_OFFVALVF_CLR (Bitfield-Mask: 0x01) */
#define BDRV_HB1ASEQOFFVAL_HB1_OFFVALVF_Pos (30UL)                  /*!< BDRV HB1ASEQOFFVAL: HB1_OFFVALVF (Bit 30)             */
#define BDRV_HB1ASEQOFFVAL_HB1_OFFVALVF_Msk (0x40000000UL)          /*!< BDRV HB1ASEQOFFVAL: HB1_OFFVALVF (Bitfield-Mask: 0x01) */
#define BDRV_HB1ASEQOFFVAL_HB1_T2MERR_Pos (22UL)                    /*!< BDRV HB1ASEQOFFVAL: HB1_T2MERR (Bit 22)               */
#define BDRV_HB1ASEQOFFVAL_HB1_T2MERR_Msk (0x400000UL)              /*!< BDRV HB1ASEQOFFVAL: HB1_T2MERR (Bitfield-Mask: 0x01)  */
#define BDRV_HB1ASEQOFFVAL_HB1_T2OFFCNT_Pos (16UL)                  /*!< BDRV HB1ASEQOFFVAL: HB1_T2OFFCNT (Bit 16)             */
#define BDRV_HB1ASEQOFFVAL_HB1_T2OFFCNT_Msk (0x3f0000UL)            /*!< BDRV HB1ASEQOFFVAL: HB1_T2OFFCNT (Bitfield-Mask: 0x3f) */
#define BDRV_HB1ASEQOFFVAL_HB1_I1OFFVAL_Pos (8UL)                   /*!< BDRV HB1ASEQOFFVAL: HB1_I1OFFVAL (Bit 8)              */
#define BDRV_HB1ASEQOFFVAL_HB1_I1OFFVAL_Msk (0x3f00UL)              /*!< BDRV HB1ASEQOFFVAL: HB1_I1OFFVAL (Bitfield-Mask: 0x3f) */
#define BDRV_HB1ASEQOFFVAL_HB1_T1OFFCNT_Pos (0UL)                   /*!< BDRV HB1ASEQOFFVAL: HB1_T1OFFCNT (Bit 0)              */
#define BDRV_HB1ASEQOFFVAL_HB1_T1OFFCNT_Msk (0xffUL)                /*!< BDRV HB1ASEQOFFVAL: HB1_T1OFFCNT (Bitfield-Mask: 0xff) */
/* =====================================================  HB1ASEQONVAL  ====================================================== */
#define BDRV_HB1ASEQONVAL_HB1_ONVALVF_CLR_Pos (31UL)                /*!< BDRV HB1ASEQONVAL: HB1_ONVALVF_CLR (Bit 31)           */
#define BDRV_HB1ASEQONVAL_HB1_ONVALVF_CLR_Msk (0x80000000UL)        /*!< BDRV HB1ASEQONVAL: HB1_ONVALVF_CLR (Bitfield-Mask: 0x01) */
#define BDRV_HB1ASEQONVAL_HB1_ONVALVF_Pos (30UL)                    /*!< BDRV HB1ASEQONVAL: HB1_ONVALVF (Bit 30)               */
#define BDRV_HB1ASEQONVAL_HB1_ONVALVF_Msk (0x40000000UL)            /*!< BDRV HB1ASEQONVAL: HB1_ONVALVF (Bitfield-Mask: 0x01)  */
#define BDRV_HB1ASEQONVAL_HB1_T3MERR_Pos  (22UL)                    /*!< BDRV HB1ASEQONVAL: HB1_T3MERR (Bit 22)                */
#define BDRV_HB1ASEQONVAL_HB1_T3MERR_Msk  (0x400000UL)              /*!< BDRV HB1ASEQONVAL: HB1_T3MERR (Bitfield-Mask: 0x01)   */
#define BDRV_HB1ASEQONVAL_HB1_T3ONCNT_Pos (16UL)                    /*!< BDRV HB1ASEQONVAL: HB1_T3ONCNT (Bit 16)               */
#define BDRV_HB1ASEQONVAL_HB1_T3ONCNT_Msk (0x3f0000UL)              /*!< BDRV HB1ASEQONVAL: HB1_T3ONCNT (Bitfield-Mask: 0x3f)  */
#define BDRV_HB1ASEQONVAL_HB1_I1ONVAL_Pos (8UL)                     /*!< BDRV HB1ASEQONVAL: HB1_I1ONVAL (Bit 8)                */
#define BDRV_HB1ASEQONVAL_HB1_I1ONVAL_Msk (0x3f00UL)                /*!< BDRV HB1ASEQONVAL: HB1_I1ONVAL (Bitfield-Mask: 0x3f)  */
#define BDRV_HB1ASEQONVAL_HB1_T12ONCNT_Pos (0UL)                    /*!< BDRV HB1ASEQONVAL: HB1_T12ONCNT (Bit 0)               */
#define BDRV_HB1ASEQONVAL_HB1_T12ONCNT_Msk (0xffUL)                 /*!< BDRV HB1ASEQONVAL: HB1_T12ONCNT (Bitfield-Mask: 0xff) */
/* =====================================================  HB2ASEQOFFVAL  ===================================================== */
#define BDRV_HB2ASEQOFFVAL_HB2_OFFVALVF_CLR_Pos (31UL)              /*!< BDRV HB2ASEQOFFVAL: HB2_OFFVALVF_CLR (Bit 31)         */
#define BDRV_HB2ASEQOFFVAL_HB2_OFFVALVF_CLR_Msk (0x80000000UL)      /*!< BDRV HB2ASEQOFFVAL: HB2_OFFVALVF_CLR (Bitfield-Mask: 0x01) */
#define BDRV_HB2ASEQOFFVAL_HB2_OFFVALVF_Pos (30UL)                  /*!< BDRV HB2ASEQOFFVAL: HB2_OFFVALVF (Bit 30)             */
#define BDRV_HB2ASEQOFFVAL_HB2_OFFVALVF_Msk (0x40000000UL)          /*!< BDRV HB2ASEQOFFVAL: HB2_OFFVALVF (Bitfield-Mask: 0x01) */
#define BDRV_HB2ASEQOFFVAL_HB2_T2MERR_Pos (22UL)                    /*!< BDRV HB2ASEQOFFVAL: HB2_T2MERR (Bit 22)               */
#define BDRV_HB2ASEQOFFVAL_HB2_T2MERR_Msk (0x400000UL)              /*!< BDRV HB2ASEQOFFVAL: HB2_T2MERR (Bitfield-Mask: 0x01)  */
#define BDRV_HB2ASEQOFFVAL_HB2_T2OFFCNT_Pos (16UL)                  /*!< BDRV HB2ASEQOFFVAL: HB2_T2OFFCNT (Bit 16)             */
#define BDRV_HB2ASEQOFFVAL_HB2_T2OFFCNT_Msk (0x3f0000UL)            /*!< BDRV HB2ASEQOFFVAL: HB2_T2OFFCNT (Bitfield-Mask: 0x3f) */
#define BDRV_HB2ASEQOFFVAL_HB2_I1OFFVAL_Pos (8UL)                   /*!< BDRV HB2ASEQOFFVAL: HB2_I1OFFVAL (Bit 8)              */
#define BDRV_HB2ASEQOFFVAL_HB2_I1OFFVAL_Msk (0x3f00UL)              /*!< BDRV HB2ASEQOFFVAL: HB2_I1OFFVAL (Bitfield-Mask: 0x3f) */
#define BDRV_HB2ASEQOFFVAL_HB2_T1OFFCNT_Pos (0UL)                   /*!< BDRV HB2ASEQOFFVAL: HB2_T1OFFCNT (Bit 0)              */
#define BDRV_HB2ASEQOFFVAL_HB2_T1OFFCNT_Msk (0xffUL)                /*!< BDRV HB2ASEQOFFVAL: HB2_T1OFFCNT (Bitfield-Mask: 0xff) */
/* =====================================================  HB2ASEQONVAL  ====================================================== */
#define BDRV_HB2ASEQONVAL_HB2_ONVALVF_CLR_Pos (31UL)                /*!< BDRV HB2ASEQONVAL: HB2_ONVALVF_CLR (Bit 31)           */
#define BDRV_HB2ASEQONVAL_HB2_ONVALVF_CLR_Msk (0x80000000UL)        /*!< BDRV HB2ASEQONVAL: HB2_ONVALVF_CLR (Bitfield-Mask: 0x01) */
#define BDRV_HB2ASEQONVAL_HB2_ONVALVF_Pos (30UL)                    /*!< BDRV HB2ASEQONVAL: HB2_ONVALVF (Bit 30)               */
#define BDRV_HB2ASEQONVAL_HB2_ONVALVF_Msk (0x40000000UL)            /*!< BDRV HB2ASEQONVAL: HB2_ONVALVF (Bitfield-Mask: 0x01)  */
#define BDRV_HB2ASEQONVAL_HB2_T3MERR_Pos  (22UL)                    /*!< BDRV HB2ASEQONVAL: HB2_T3MERR (Bit 22)                */
#define BDRV_HB2ASEQONVAL_HB2_T3MERR_Msk  (0x400000UL)              /*!< BDRV HB2ASEQONVAL: HB2_T3MERR (Bitfield-Mask: 0x01)   */
#define BDRV_HB2ASEQONVAL_HB2_T3ONCNT_Pos (16UL)                    /*!< BDRV HB2ASEQONVAL: HB2_T3ONCNT (Bit 16)               */
#define BDRV_HB2ASEQONVAL_HB2_T3ONCNT_Msk (0x3f0000UL)              /*!< BDRV HB2ASEQONVAL: HB2_T3ONCNT (Bitfield-Mask: 0x3f)  */
#define BDRV_HB2ASEQONVAL_HB2_I1ONVAL_Pos (8UL)                     /*!< BDRV HB2ASEQONVAL: HB2_I1ONVAL (Bit 8)                */
#define BDRV_HB2ASEQONVAL_HB2_I1ONVAL_Msk (0x3f00UL)                /*!< BDRV HB2ASEQONVAL: HB2_I1ONVAL (Bitfield-Mask: 0x3f)  */
#define BDRV_HB2ASEQONVAL_HB2_T12ONCNT_Pos (0UL)                    /*!< BDRV HB2ASEQONVAL: HB2_T12ONCNT (Bit 0)               */
#define BDRV_HB2ASEQONVAL_HB2_T12ONCNT_Msk (0xffUL)                 /*!< BDRV HB2ASEQONVAL: HB2_T12ONCNT (Bitfield-Mask: 0xff) */
/* =====================================================  IGATECLMPOFFC  ===================================================== */
#define BDRV_IGATECLMPOFFC_HB2AF_ICLMPOFF_Pos (24UL)                /*!< BDRV IGATECLMPOFFC: HB2AF_ICLMPOFF (Bit 24)           */
#define BDRV_IGATECLMPOFFC_HB2AF_ICLMPOFF_Msk (0x3f000000UL)        /*!< BDRV IGATECLMPOFFC: HB2AF_ICLMPOFF (Bitfield-Mask: 0x3f) */
#define BDRV_IGATECLMPOFFC_HB1AF_ICLMPOFF_Pos (16UL)                /*!< BDRV IGATECLMPOFFC: HB1AF_ICLMPOFF (Bit 16)           */
#define BDRV_IGATECLMPOFFC_HB1AF_ICLMPOFF_Msk (0x3f0000UL)          /*!< BDRV IGATECLMPOFFC: HB1AF_ICLMPOFF (Bitfield-Mask: 0x3f) */
#define BDRV_IGATECLMPOFFC_HB2_ICLMPOFF_Pos (8UL)                   /*!< BDRV IGATECLMPOFFC: HB2_ICLMPOFF (Bit 8)              */
#define BDRV_IGATECLMPOFFC_HB2_ICLMPOFF_Msk (0x3f00UL)              /*!< BDRV IGATECLMPOFFC: HB2_ICLMPOFF (Bitfield-Mask: 0x3f) */
#define BDRV_IGATECLMPOFFC_HB1_ICLMPOFF_Pos (0UL)                   /*!< BDRV IGATECLMPOFFC: HB1_ICLMPOFF (Bit 0)              */
#define BDRV_IGATECLMPOFFC_HB1_ICLMPOFF_Msk (0x3fUL)                /*!< BDRV IGATECLMPOFFC: HB1_ICLMPOFF (Bitfield-Mask: 0x3f) */
/* =====================================================  IGATECLMPONC  ====================================================== */
#define BDRV_IGATECLMPONC_HB2AF_ICLMPON_Pos (24UL)                  /*!< BDRV IGATECLMPONC: HB2AF_ICLMPON (Bit 24)             */
#define BDRV_IGATECLMPONC_HB2AF_ICLMPON_Msk (0x3f000000UL)          /*!< BDRV IGATECLMPONC: HB2AF_ICLMPON (Bitfield-Mask: 0x3f) */
#define BDRV_IGATECLMPONC_HB1AF_ICLMPON_Pos (16UL)                  /*!< BDRV IGATECLMPONC: HB1AF_ICLMPON (Bit 16)             */
#define BDRV_IGATECLMPONC_HB1AF_ICLMPON_Msk (0x3f0000UL)            /*!< BDRV IGATECLMPONC: HB1AF_ICLMPON (Bitfield-Mask: 0x3f) */
#define BDRV_IGATECLMPONC_HB2_ICLMPON_Pos (8UL)                     /*!< BDRV IGATECLMPONC: HB2_ICLMPON (Bit 8)                */
#define BDRV_IGATECLMPONC_HB2_ICLMPON_Msk (0x3f00UL)                /*!< BDRV IGATECLMPONC: HB2_ICLMPON (Bitfield-Mask: 0x3f)  */
#define BDRV_IGATECLMPONC_HB1_ICLMPON_Pos (0UL)                     /*!< BDRV IGATECLMPONC: HB1_ICLMPON (Bit 0)                */
#define BDRV_IGATECLMPONC_HB1_ICLMPON_Msk (0x3fUL)                  /*!< BDRV IGATECLMPONC: HB1_ICLMPON (Bitfield-Mask: 0x3f)  */
/* ========================================================  IRQCLR  ========================================================= */
#define BDRV_IRQCLR_SEQ_ERR_ISC_Pos       (31UL)                    /*!< BDRV IRQCLR: SEQ_ERR_ISC (Bit 31)                     */
#define BDRV_IRQCLR_SEQ_ERR_ISC_Msk       (0x80000000UL)            /*!< BDRV IRQCLR: SEQ_ERR_ISC (Bitfield-Mask: 0x01)        */
#define BDRV_IRQCLR_HS2_OC_ISC_Pos        (30UL)                    /*!< BDRV IRQCLR: HS2_OC_ISC (Bit 30)                      */
#define BDRV_IRQCLR_HS2_OC_ISC_Msk        (0x40000000UL)            /*!< BDRV IRQCLR: HS2_OC_ISC (Bitfield-Mask: 0x01)         */
#define BDRV_IRQCLR_HS2_DS_SC_Pos         (29UL)                    /*!< BDRV IRQCLR: HS2_DS_SC (Bit 29)                       */
#define BDRV_IRQCLR_HS2_DS_SC_Msk         (0x20000000UL)            /*!< BDRV IRQCLR: HS2_DS_SC (Bitfield-Mask: 0x01)          */
#define BDRV_IRQCLR_HS2_DS_ISC_Pos        (28UL)                    /*!< BDRV IRQCLR: HS2_DS_ISC (Bit 28)                      */
#define BDRV_IRQCLR_HS2_DS_ISC_Msk        (0x10000000UL)            /*!< BDRV IRQCLR: HS2_DS_ISC (Bitfield-Mask: 0x01)         */
#define BDRV_IRQCLR_HS1_OC_ISC_Pos        (22UL)                    /*!< BDRV IRQCLR: HS1_OC_ISC (Bit 22)                      */
#define BDRV_IRQCLR_HS1_OC_ISC_Msk        (0x400000UL)              /*!< BDRV IRQCLR: HS1_OC_ISC (Bitfield-Mask: 0x01)         */
#define BDRV_IRQCLR_HS1_DS_SC_Pos         (21UL)                    /*!< BDRV IRQCLR: HS1_DS_SC (Bit 21)                       */
#define BDRV_IRQCLR_HS1_DS_SC_Msk         (0x200000UL)              /*!< BDRV IRQCLR: HS1_DS_SC (Bitfield-Mask: 0x01)          */
#define BDRV_IRQCLR_HS1_DS_ISC_Pos        (20UL)                    /*!< BDRV IRQCLR: HS1_DS_ISC (Bit 20)                      */
#define BDRV_IRQCLR_HS1_DS_ISC_Msk        (0x100000UL)              /*!< BDRV IRQCLR: HS1_DS_ISC (Bitfield-Mask: 0x01)         */
#define BDRV_IRQCLR_LS2_OC_ISC_Pos        (14UL)                    /*!< BDRV IRQCLR: LS2_OC_ISC (Bit 14)                      */
#define BDRV_IRQCLR_LS2_OC_ISC_Msk        (0x4000UL)                /*!< BDRV IRQCLR: LS2_OC_ISC (Bitfield-Mask: 0x01)         */
#define BDRV_IRQCLR_LS2_DS_SC_Pos         (13UL)                    /*!< BDRV IRQCLR: LS2_DS_SC (Bit 13)                       */
