Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
#define BDRV_IRQCLR_LS2_DS_SC_Msk         (0x2000UL)                /*!< BDRV IRQCLR: LS2_DS_SC (Bitfield-Mask: 0x01)          */
#define BDRV_IRQCLR_LS2_DS_ISC_Pos        (12UL)                    /*!< BDRV IRQCLR: LS2_DS_ISC (Bit 12)                      */
#define BDRV_IRQCLR_LS2_DS_ISC_Msk        (0x1000UL)                /*!< BDRV IRQCLR: LS2_DS_ISC (Bitfield-Mask: 0x01)         */
#define BDRV_IRQCLR_LS1_OC_ISC_Pos        (6UL)                     /*!< BDRV IRQCLR: LS1_OC_ISC (Bit 6)                       */
#define BDRV_IRQCLR_LS1_OC_ISC_Msk        (0x40UL)                  /*!< BDRV IRQCLR: LS1_OC_ISC (Bitfield-Mask: 0x01)         */
#define BDRV_IRQCLR_LS1_DS_SC_Pos         (5UL)                     /*!< BDRV IRQCLR: LS1_DS_SC (Bit 5)                        */
#define BDRV_IRQCLR_LS1_DS_SC_Msk         (0x20UL)                  /*!< BDRV IRQCLR: LS1_DS_SC (Bitfield-Mask: 0x01)          */
#define BDRV_IRQCLR_LS1_DS_ISC_Pos        (4UL)                     /*!< BDRV IRQCLR: LS1_DS_ISC (Bit 4)                       */
#define BDRV_IRQCLR_LS1_DS_ISC_Msk        (0x10UL)                  /*!< BDRV IRQCLR: LS1_DS_ISC (Bitfield-Mask: 0x01)         */
#define BDRV_IRQCLR_HB2_ASEQ_ISC_Pos      (1UL)                     /*!< BDRV IRQCLR: HB2_ASEQ_ISC (Bit 1)                     */
#define BDRV_IRQCLR_HB2_ASEQ_ISC_Msk      (0x2UL)                   /*!< BDRV IRQCLR: HB2_ASEQ_ISC (Bitfield-Mask: 0x01)       */
#define BDRV_IRQCLR_HB1_ASEQ_ISC_Pos      (0UL)                     /*!< BDRV IRQCLR: HB1_ASEQ_ISC (Bit 0)                     */
#define BDRV_IRQCLR_HB1_ASEQ_ISC_Msk      (0x1UL)                   /*!< BDRV IRQCLR: HB1_ASEQ_ISC (Bitfield-Mask: 0x01)       */
/* =========================================================  IRQEN  ========================================================= */
#define BDRV_IRQEN_SEQ_ERR_IEN_Pos        (31UL)                    /*!< BDRV IRQEN: SEQ_ERR_IEN (Bit 31)                      */
#define BDRV_IRQEN_SEQ_ERR_IEN_Msk        (0x80000000UL)            /*!< BDRV IRQEN: SEQ_ERR_IEN (Bitfield-Mask: 0x01)         */
#define BDRV_IRQEN_HS2_OC_IEN_Pos         (30UL)                    /*!< BDRV IRQEN: HS2_OC_IEN (Bit 30)                       */
#define BDRV_IRQEN_HS2_OC_IEN_Msk         (0x40000000UL)            /*!< BDRV IRQEN: HS2_OC_IEN (Bitfield-Mask: 0x01)          */
#define BDRV_IRQEN_HS2_DS_IEN_Pos         (28UL)                    /*!< BDRV IRQEN: HS2_DS_IEN (Bit 28)                       */
#define BDRV_IRQEN_HS2_DS_IEN_Msk         (0x10000000UL)            /*!< BDRV IRQEN: HS2_DS_IEN (Bitfield-Mask: 0x01)          */
#define BDRV_IRQEN_HS1_OC_IEN_Pos         (22UL)                    /*!< BDRV IRQEN: HS1_OC_IEN (Bit 22)                       */
#define BDRV_IRQEN_HS1_OC_IEN_Msk         (0x400000UL)              /*!< BDRV IRQEN: HS1_OC_IEN (Bitfield-Mask: 0x01)          */
#define BDRV_IRQEN_HS1_DS_IEN_Pos         (20UL)                    /*!< BDRV IRQEN: HS1_DS_IEN (Bit 20)                       */
#define BDRV_IRQEN_HS1_DS_IEN_Msk         (0x100000UL)              /*!< BDRV IRQEN: HS1_DS_IEN (Bitfield-Mask: 0x01)          */
#define BDRV_IRQEN_LS2_OC_IEN_Pos         (14UL)                    /*!< BDRV IRQEN: LS2_OC_IEN (Bit 14)                       */
#define BDRV_IRQEN_LS2_OC_IEN_Msk         (0x4000UL)                /*!< BDRV IRQEN: LS2_OC_IEN (Bitfield-Mask: 0x01)          */
#define BDRV_IRQEN_LS2_DS_IEN_Pos         (12UL)                    /*!< BDRV IRQEN: LS2_DS_IEN (Bit 12)                       */
#define BDRV_IRQEN_LS2_DS_IEN_Msk         (0x1000UL)                /*!< BDRV IRQEN: LS2_DS_IEN (Bitfield-Mask: 0x01)          */
#define BDRV_IRQEN_LS1_OC_IEN_Pos         (6UL)                     /*!< BDRV IRQEN: LS1_OC_IEN (Bit 6)                        */
#define BDRV_IRQEN_LS1_OC_IEN_Msk         (0x40UL)                  /*!< BDRV IRQEN: LS1_OC_IEN (Bitfield-Mask: 0x01)          */
#define BDRV_IRQEN_LS1_DS_IEN_Pos         (4UL)                     /*!< BDRV IRQEN: LS1_DS_IEN (Bit 4)                        */
#define BDRV_IRQEN_LS1_DS_IEN_Msk         (0x10UL)                  /*!< BDRV IRQEN: LS1_DS_IEN (Bitfield-Mask: 0x01)          */
#define BDRV_IRQEN_HB2_ASEQ_IEN_Pos       (1UL)                     /*!< BDRV IRQEN: HB2_ASEQ_IEN (Bit 1)                      */
#define BDRV_IRQEN_HB2_ASEQ_IEN_Msk       (0x2UL)                   /*!< BDRV IRQEN: HB2_ASEQ_IEN (Bitfield-Mask: 0x01)        */
#define BDRV_IRQEN_HB1_ASEQ_IEN_Pos       (0UL)                     /*!< BDRV IRQEN: HB1_ASEQ_IEN (Bit 0)                      */
#define BDRV_IRQEN_HB1_ASEQ_IEN_Msk       (0x1UL)                   /*!< BDRV IRQEN: HB1_ASEQ_IEN (Bitfield-Mask: 0x01)        */
/* =========================================================  IRQS  ========================================================== */
#define BDRV_IRQS_SEQ_ERR_IS_Pos          (31UL)                    /*!< BDRV IRQS: SEQ_ERR_IS (Bit 31)                        */
#define BDRV_IRQS_SEQ_ERR_IS_Msk          (0x80000000UL)            /*!< BDRV IRQS: SEQ_ERR_IS (Bitfield-Mask: 0x01)           */
#define BDRV_IRQS_HS2_OC_IS_Pos           (30UL)                    /*!< BDRV IRQS: HS2_OC_IS (Bit 30)                         */
#define BDRV_IRQS_HS2_OC_IS_Msk           (0x40000000UL)            /*!< BDRV IRQS: HS2_OC_IS (Bitfield-Mask: 0x01)            */
#define BDRV_IRQS_HS2_DS_STS_Pos          (29UL)                    /*!< BDRV IRQS: HS2_DS_STS (Bit 29)                        */
#define BDRV_IRQS_HS2_DS_STS_Msk          (0x20000000UL)            /*!< BDRV IRQS: HS2_DS_STS (Bitfield-Mask: 0x01)           */
#define BDRV_IRQS_HS2_DS_IS_Pos           (28UL)                    /*!< BDRV IRQS: HS2_DS_IS (Bit 28)                         */
#define BDRV_IRQS_HS2_DS_IS_Msk           (0x10000000UL)            /*!< BDRV IRQS: HS2_DS_IS (Bitfield-Mask: 0x01)            */
#define BDRV_IRQS_HS1_OC_IS_Pos           (22UL)                    /*!< BDRV IRQS: HS1_OC_IS (Bit 22)                         */
#define BDRV_IRQS_HS1_OC_IS_Msk           (0x400000UL)              /*!< BDRV IRQS: HS1_OC_IS (Bitfield-Mask: 0x01)            */
#define BDRV_IRQS_HS1_DS_STS_Pos          (21UL)                    /*!< BDRV IRQS: HS1_DS_STS (Bit 21)                        */
#define BDRV_IRQS_HS1_DS_STS_Msk          (0x200000UL)              /*!< BDRV IRQS: HS1_DS_STS (Bitfield-Mask: 0x01)           */
#define BDRV_IRQS_HS1_DS_IS_Pos           (20UL)                    /*!< BDRV IRQS: HS1_DS_IS (Bit 20)                         */
#define BDRV_IRQS_HS1_DS_IS_Msk           (0x100000UL)              /*!< BDRV IRQS: HS1_DS_IS (Bitfield-Mask: 0x01)            */
#define BDRV_IRQS_LS2_OC_IS_Pos           (14UL)                    /*!< BDRV IRQS: LS2_OC_IS (Bit 14)                         */
#define BDRV_IRQS_LS2_OC_IS_Msk           (0x4000UL)                /*!< BDRV IRQS: LS2_OC_IS (Bitfield-Mask: 0x01)            */
#define BDRV_IRQS_LS2_DS_STS_Pos          (13UL)                    /*!< BDRV IRQS: LS2_DS_STS (Bit 13)                        */
#define BDRV_IRQS_LS2_DS_STS_Msk          (0x2000UL)                /*!< BDRV IRQS: LS2_DS_STS (Bitfield-Mask: 0x01)           */
#define BDRV_IRQS_LS2_DS_IS_Pos           (12UL)                    /*!< BDRV IRQS: LS2_DS_IS (Bit 12)                         */
#define BDRV_IRQS_LS2_DS_IS_Msk           (0x1000UL)                /*!< BDRV IRQS: LS2_DS_IS (Bitfield-Mask: 0x01)            */
#define BDRV_IRQS_LS1_OC_IS_Pos           (6UL)                     /*!< BDRV IRQS: LS1_OC_IS (Bit 6)                          */
#define BDRV_IRQS_LS1_OC_IS_Msk           (0x40UL)                  /*!< BDRV IRQS: LS1_OC_IS (Bitfield-Mask: 0x01)            */
#define BDRV_IRQS_LS1_DS_STS_Pos          (5UL)                     /*!< BDRV IRQS: LS1_DS_STS (Bit 5)                         */
#define BDRV_IRQS_LS1_DS_STS_Msk          (0x20UL)                  /*!< BDRV IRQS: LS1_DS_STS (Bitfield-Mask: 0x01)           */
#define BDRV_IRQS_LS1_DS_IS_Pos           (4UL)                     /*!< BDRV IRQS: LS1_DS_IS (Bit 4)                          */
#define BDRV_IRQS_LS1_DS_IS_Msk           (0x10UL)                  /*!< BDRV IRQS: LS1_DS_IS (Bitfield-Mask: 0x01)            */
#define BDRV_IRQS_HB2_ASEQ_IS_Pos         (1UL)                     /*!< BDRV IRQS: HB2_ASEQ_IS (Bit 1)                        */
#define BDRV_IRQS_HB2_ASEQ_IS_Msk         (0x2UL)                   /*!< BDRV IRQS: HB2_ASEQ_IS (Bitfield-Mask: 0x01)          */
#define BDRV_IRQS_HB1_ASEQ_IS_Pos         (0UL)                     /*!< BDRV IRQS: HB1_ASEQ_IS (Bit 0)                        */
#define BDRV_IRQS_HB1_ASEQ_IS_Msk         (0x1UL)                   /*!< BDRV IRQS: HB1_ASEQ_IS (Bitfield-Mask: 0x01)          */
/* ======================================================  OFFASEQTMAX  ====================================================== */
#define BDRV_OFFASEQTMAX_T1OFFMAX_Pos     (0UL)                     /*!< BDRV OFFASEQTMAX: T1OFFMAX (Bit 0)                    */
#define BDRV_OFFASEQTMAX_T1OFFMAX_Msk     (0xffUL)                  /*!< BDRV OFFASEQTMAX: T1OFFMAX (Bitfield-Mask: 0xff)      */
/* ======================================================  OFFASEQTMIN  ====================================================== */
#define BDRV_OFFASEQTMIN_HB2T1OFFADDDLY_Pos (12UL)                  /*!< BDRV OFFASEQTMIN: HB2T1OFFADDDLY (Bit 12)             */
#define BDRV_OFFASEQTMIN_HB2T1OFFADDDLY_Msk (0xf000UL)              /*!< BDRV OFFASEQTMIN: HB2T1OFFADDDLY (Bitfield-Mask: 0x0f) */
#define BDRV_OFFASEQTMIN_HB1T1OFFADDDLY_Pos (8UL)                   /*!< BDRV OFFASEQTMIN: HB1T1OFFADDDLY (Bit 8)              */
#define BDRV_OFFASEQTMIN_HB1T1OFFADDDLY_Msk (0xf00UL)               /*!< BDRV OFFASEQTMIN: HB1T1OFFADDDLY (Bitfield-Mask: 0x0f) */
#define BDRV_OFFASEQTMIN_T1OFFMIN_Pos     (0UL)                     /*!< BDRV OFFASEQTMIN: T1OFFMIN (Bit 0)                    */
#define BDRV_OFFASEQTMIN_T1OFFMIN_Msk     (0xffUL)                  /*!< BDRV OFFASEQTMIN: T1OFFMIN (Bitfield-Mask: 0xff)      */
/* ======================================================  OFFSEQHB1IC  ====================================================== */
#define BDRV_OFFSEQHB1IC_HB1_I4OFF_Pos    (24UL)                    /*!< BDRV OFFSEQHB1IC: HB1_I4OFF (Bit 24)                  */
#define BDRV_OFFSEQHB1IC_HB1_I4OFF_Msk    (0x3f000000UL)            /*!< BDRV OFFSEQHB1IC: HB1_I4OFF (Bitfield-Mask: 0x3f)     */
#define BDRV_OFFSEQHB1IC_HB1_I3OFF_Pos    (16UL)                    /*!< BDRV OFFSEQHB1IC: HB1_I3OFF (Bit 16)                  */
#define BDRV_OFFSEQHB1IC_HB1_I3OFF_Msk    (0x3f0000UL)              /*!< BDRV OFFSEQHB1IC: HB1_I3OFF (Bitfield-Mask: 0x3f)     */
#define BDRV_OFFSEQHB1IC_HB1_I2OFF_Pos    (8UL)                     /*!< BDRV OFFSEQHB1IC: HB1_I2OFF (Bit 8)                   */
#define BDRV_OFFSEQHB1IC_HB1_I2OFF_Msk    (0x3f00UL)                /*!< BDRV OFFSEQHB1IC: HB1_I2OFF (Bitfield-Mask: 0x3f)     */
#define BDRV_OFFSEQHB1IC_HB1_I1OFF_Pos    (0UL)                     /*!< BDRV OFFSEQHB1IC: HB1_I1OFF (Bit 0)                   */
#define BDRV_OFFSEQHB1IC_HB1_I1OFF_Msk    (0x3fUL)                  /*!< BDRV OFFSEQHB1IC: HB1_I1OFF (Bitfield-Mask: 0x3f)     */
/* ======================================================  OFFSEQHB1TC  ====================================================== */
#define BDRV_OFFSEQHB1TC_HB1_T4OFF_Pos    (24UL)                    /*!< BDRV OFFSEQHB1TC: HB1_T4OFF (Bit 24)                  */
#define BDRV_OFFSEQHB1TC_HB1_T4OFF_Msk    (0xff000000UL)            /*!< BDRV OFFSEQHB1TC: HB1_T4OFF (Bitfield-Mask: 0xff)     */
#define BDRV_OFFSEQHB1TC_HB1_T3OFF_Pos    (16UL)                    /*!< BDRV OFFSEQHB1TC: HB1_T3OFF (Bit 16)                  */
#define BDRV_OFFSEQHB1TC_HB1_T3OFF_Msk    (0x3f0000UL)              /*!< BDRV OFFSEQHB1TC: HB1_T3OFF (Bitfield-Mask: 0x3f)     */
#define BDRV_OFFSEQHB1TC_HB1_T2OFF_Pos    (8UL)                     /*!< BDRV OFFSEQHB1TC: HB1_T2OFF (Bit 8)                   */
#define BDRV_OFFSEQHB1TC_HB1_T2OFF_Msk    (0x3f00UL)                /*!< BDRV OFFSEQHB1TC: HB1_T2OFF (Bitfield-Mask: 0x3f)     */
#define BDRV_OFFSEQHB1TC_HB1_T1OFF_Pos    (0UL)                     /*!< BDRV OFFSEQHB1TC: HB1_T1OFF (Bit 0)                   */
#define BDRV_OFFSEQHB1TC_HB1_T1OFF_Msk    (0xffUL)                  /*!< BDRV OFFSEQHB1TC: HB1_T1OFF (Bitfield-Mask: 0xff)     */
/* ======================================================  OFFSEQHB2IC  ====================================================== */
#define BDRV_OFFSEQHB2IC_HB2_I4OFF_Pos    (24UL)                    /*!< BDRV OFFSEQHB2IC: HB2_I4OFF (Bit 24)                  */
#define BDRV_OFFSEQHB2IC_HB2_I4OFF_Msk    (0x3f000000UL)            /*!< BDRV OFFSEQHB2IC: HB2_I4OFF (Bitfield-Mask: 0x3f)     */
#define BDRV_OFFSEQHB2IC_HB2_I3OFF_Pos    (16UL)                    /*!< BDRV OFFSEQHB2IC: HB2_I3OFF (Bit 16)                  */
#define BDRV_OFFSEQHB2IC_HB2_I3OFF_Msk    (0x3f0000UL)              /*!< BDRV OFFSEQHB2IC: HB2_I3OFF (Bitfield-Mask: 0x3f)     */
#define BDRV_OFFSEQHB2IC_HB2_I2OFF_Pos    (8UL)                     /*!< BDRV OFFSEQHB2IC: HB2_I2OFF (Bit 8)                   */
#define BDRV_OFFSEQHB2IC_HB2_I2OFF_Msk    (0x3f00UL)                /*!< BDRV OFFSEQHB2IC: HB2_I2OFF (Bitfield-Mask: 0x3f)     */
#define BDRV_OFFSEQHB2IC_HB2_I1OFF_Pos    (0UL)                     /*!< BDRV OFFSEQHB2IC: HB2_I1OFF (Bit 0)                   */
#define BDRV_OFFSEQHB2IC_HB2_I1OFF_Msk    (0x3fUL)                  /*!< BDRV OFFSEQHB2IC: HB2_I1OFF (Bitfield-Mask: 0x3f)     */
/* ======================================================  OFFSEQHB2TC  ====================================================== */
#define BDRV_OFFSEQHB2TC_HB2_T4OFF_Pos    (24UL)                    /*!< BDRV OFFSEQHB2TC: HB2_T4OFF (Bit 24)                  */
#define BDRV_OFFSEQHB2TC_HB2_T4OFF_Msk    (0xff000000UL)            /*!< BDRV OFFSEQHB2TC: HB2_T4OFF (Bitfield-Mask: 0xff)     */
#define BDRV_OFFSEQHB2TC_HB2_T3OFF_Pos    (16UL)                    /*!< BDRV OFFSEQHB2TC: HB2_T3OFF (Bit 16)                  */
#define BDRV_OFFSEQHB2TC_HB2_T3OFF_Msk    (0x3f0000UL)              /*!< BDRV OFFSEQHB2TC: HB2_T3OFF (Bitfield-Mask: 0x3f)     */
#define BDRV_OFFSEQHB2TC_HB2_T2OFF_Pos    (8UL)                     /*!< BDRV OFFSEQHB2TC: HB2_T2OFF (Bit 8)                   */
#define BDRV_OFFSEQHB2TC_HB2_T2OFF_Msk    (0x3f00UL)                /*!< BDRV OFFSEQHB2TC: HB2_T2OFF (Bitfield-Mask: 0x3f)     */
#define BDRV_OFFSEQHB2TC_HB2_T1OFF_Pos    (0UL)                     /*!< BDRV OFFSEQHB2TC: HB2_T1OFF (Bit 0)                   */
#define BDRV_OFFSEQHB2TC_HB2_T1OFF_Msk    (0xffUL)                  /*!< BDRV OFFSEQHB2TC: HB2_T1OFF (Bitfield-Mask: 0xff)     */
/* ======================================================  ONASEQTMAX  ======================================================= */
#define BDRV_ONASEQTMAX_T12ONMAX_Pos      (0UL)                     /*!< BDRV ONASEQTMAX: T12ONMAX (Bit 0)                     */
#define BDRV_ONASEQTMAX_T12ONMAX_Msk      (0xffUL)                  /*!< BDRV ONASEQTMAX: T12ONMAX (Bitfield-Mask: 0xff)       */
/* ======================================================  ONASEQTMIN  ======================================================= */
#define BDRV_ONASEQTMIN_T12ONMIN_Pos      (0UL)                     /*!< BDRV ONASEQTMIN: T12ONMIN (Bit 0)                     */
#define BDRV_ONASEQTMIN_T12ONMIN_Msk      (0xffUL)                  /*!< BDRV ONASEQTMIN: T12ONMIN (Bitfield-Mask: 0xff)       */
/* ======================================================  ONSEQHB1IC  ======================================================= */
#define BDRV_ONSEQHB1IC_HB1_I4ON_Pos      (24UL)                    /*!< BDRV ONSEQHB1IC: HB1_I4ON (Bit 24)                    */
#define BDRV_ONSEQHB1IC_HB1_I4ON_Msk      (0x3f000000UL)            /*!< BDRV ONSEQHB1IC: HB1_I4ON (Bitfield-Mask: 0x3f)       */
#define BDRV_ONSEQHB1IC_HB1_I3ON_Pos      (16UL)                    /*!< BDRV ONSEQHB1IC: HB1_I3ON (Bit 16)                    */
#define BDRV_ONSEQHB1IC_HB1_I3ON_Msk      (0x3f0000UL)              /*!< BDRV ONSEQHB1IC: HB1_I3ON (Bitfield-Mask: 0x3f)       */
#define BDRV_ONSEQHB1IC_HB1_I2ON_Pos      (8UL)                     /*!< BDRV ONSEQHB1IC: HB1_I2ON (Bit 8)                     */
#define BDRV_ONSEQHB1IC_HB1_I2ON_Msk      (0x3f00UL)                /*!< BDRV ONSEQHB1IC: HB1_I2ON (Bitfield-Mask: 0x3f)       */
#define BDRV_ONSEQHB1IC_HB1_I1ON_Pos      (0UL)                     /*!< BDRV ONSEQHB1IC: HB1_I1ON (Bit 0)                     */
#define BDRV_ONSEQHB1IC_HB1_I1ON_Msk      (0x3fUL)                  /*!< BDRV ONSEQHB1IC: HB1_I1ON (Bitfield-Mask: 0x3f)       */
/* ======================================================  ONSEQHB1TC  ======================================================= */
#define BDRV_ONSEQHB1TC_HB1_T4ON_Pos      (24UL)                    /*!< BDRV ONSEQHB1TC: HB1_T4ON (Bit 24)                    */
#define BDRV_ONSEQHB1TC_HB1_T4ON_Msk      (0xff000000UL)            /*!< BDRV ONSEQHB1TC: HB1_T4ON (Bitfield-Mask: 0xff)       */
#define BDRV_ONSEQHB1TC_HB1_T3ON_Pos      (16UL)                    /*!< BDRV ONSEQHB1TC: HB1_T3ON (Bit 16)                    */
#define BDRV_ONSEQHB1TC_HB1_T3ON_Msk      (0x3f0000UL)              /*!< BDRV ONSEQHB1TC: HB1_T3ON (Bitfield-Mask: 0x3f)       */
#define BDRV_ONSEQHB1TC_HB1_T2ON_Pos      (8UL)                     /*!< BDRV ONSEQHB1TC: HB1_T2ON (Bit 8)                     */
#define BDRV_ONSEQHB1TC_HB1_T2ON_Msk      (0x3f00UL)                /*!< BDRV ONSEQHB1TC: HB1_T2ON (Bitfield-Mask: 0x3f)       */
#define BDRV_ONSEQHB1TC_HB1_T1ON_Pos      (0UL)                     /*!< BDRV ONSEQHB1TC: HB1_T1ON (Bit 0)                     */
#define BDRV_ONSEQHB1TC_HB1_T1ON_Msk      (0xffUL)                  /*!< BDRV ONSEQHB1TC: HB1_T1ON (Bitfield-Mask: 0xff)       */
/* ======================================================  ONSEQHB2IC  ======================================================= */
#define BDRV_ONSEQHB2IC_HB2_I4ON_Pos      (24UL)                    /*!< BDRV ONSEQHB2IC: HB2_I4ON (Bit 24)                    */
#define BDRV_ONSEQHB2IC_HB2_I4ON_Msk      (0x3f000000UL)            /*!< BDRV ONSEQHB2IC: HB2_I4ON (Bitfield-Mask: 0x3f)       */
#define BDRV_ONSEQHB2IC_HB2_I3ON_Pos      (16UL)                    /*!< BDRV ONSEQHB2IC: HB2_I3ON (Bit 16)                    */
#define BDRV_ONSEQHB2IC_HB2_I3ON_Msk      (0x3f0000UL)              /*!< BDRV ONSEQHB2IC: HB2_I3ON (Bitfield-Mask: 0x3f)       */
#define BDRV_ONSEQHB2IC_HB2_I2ON_Pos      (8UL)                     /*!< BDRV ONSEQHB2IC: HB2_I2ON (Bit 8)                     */
#define BDRV_ONSEQHB2IC_HB2_I2ON_Msk      (0x3f00UL)                /*!< BDRV ONSEQHB2IC: HB2_I2ON (Bitfield-Mask: 0x3f)       */
#define BDRV_ONSEQHB2IC_HB2_I1ON_Pos      (0UL)                     /*!< BDRV ONSEQHB2IC: HB2_I1ON (Bit 0)                     */
#define BDRV_ONSEQHB2IC_HB2_I1ON_Msk      (0x3fUL)                  /*!< BDRV ONSEQHB2IC: HB2_I1ON (Bitfield-Mask: 0x3f)       */
/* ======================================================  ONSEQHB2TC  ======================================================= */
#define BDRV_ONSEQHB2TC_HB2_T4ON_Pos      (24UL)                    /*!< BDRV ONSEQHB2TC: HB2_T4ON (Bit 24)                    */
#define BDRV_ONSEQHB2TC_HB2_T4ON_Msk      (0xff000000UL)            /*!< BDRV ONSEQHB2TC: HB2_T4ON (Bitfield-Mask: 0xff)       */
#define BDRV_ONSEQHB2TC_HB2_T3ON_Pos      (16UL)                    /*!< BDRV ONSEQHB2TC: HB2_T3ON (Bit 16)                    */
#define BDRV_ONSEQHB2TC_HB2_T3ON_Msk      (0x3f0000UL)              /*!< BDRV ONSEQHB2TC: HB2_T3ON (Bitfield-Mask: 0x3f)       */
#define BDRV_ONSEQHB2TC_HB2_T2ON_Pos      (8UL)                     /*!< BDRV ONSEQHB2TC: HB2_T2ON (Bit 8)                     */
#define BDRV_ONSEQHB2TC_HB2_T2ON_Msk      (0x3f00UL)                /*!< BDRV ONSEQHB2TC: HB2_T2ON (Bitfield-Mask: 0x3f)       */
#define BDRV_ONSEQHB2TC_HB2_T1ON_Pos      (0UL)                     /*!< BDRV ONSEQHB2TC: HB2_T1ON (Bit 0)                     */
#define BDRV_ONSEQHB2TC_HB2_T1ON_Msk      (0xffUL)                  /*!< BDRV ONSEQHB2TC: HB2_T1ON (Bitfield-Mask: 0xff)       */
/* =======================================================  PWMSRCSEL  ======================================================= */
#define BDRV_PWMSRCSEL_HS2_SRC_SEL_Pos    (19UL)                    /*!< BDRV PWMSRCSEL: HS2_SRC_SEL (Bit 19)                  */
#define BDRV_PWMSRCSEL_HS2_SRC_SEL_Msk    (0x180000UL)              /*!< BDRV PWMSRCSEL: HS2_SRC_SEL (Bitfield-Mask: 0x03)     */
#define BDRV_PWMSRCSEL_HS1_SRC_SEL_Pos    (16UL)                    /*!< BDRV PWMSRCSEL: HS1_SRC_SEL (Bit 16)                  */
#define BDRV_PWMSRCSEL_HS1_SRC_SEL_Msk    (0x30000UL)               /*!< BDRV PWMSRCSEL: HS1_SRC_SEL (Bitfield-Mask: 0x03)     */
#define BDRV_PWMSRCSEL_LS2_SRC_SEL_Pos    (3UL)                     /*!< BDRV PWMSRCSEL: LS2_SRC_SEL (Bit 3)                   */
#define BDRV_PWMSRCSEL_LS2_SRC_SEL_Msk    (0x18UL)                  /*!< BDRV PWMSRCSEL: LS2_SRC_SEL (Bitfield-Mask: 0x03)     */
#define BDRV_PWMSRCSEL_LS1_SRC_SEL_Pos    (0UL)                     /*!< BDRV PWMSRCSEL: LS1_SRC_SEL (Bit 0)                   */
#define BDRV_PWMSRCSEL_LS1_SRC_SEL_Msk    (0x3UL)                   /*!< BDRV PWMSRCSEL: LS1_SRC_SEL (Bitfield-Mask: 0x03)     */
/* ======================================================  SEQAFHB1CD  ======================================================= */
#define BDRV_SEQAFHB1CD_HB1AF_TDICLMPON_Pos (8UL)                   /*!< BDRV SEQAFHB1CD: HB1AF_TDICLMPON (Bit 8)              */
#define BDRV_SEQAFHB1CD_HB1AF_TDICLMPON_Msk (0xff00UL)              /*!< BDRV SEQAFHB1CD: HB1AF_TDICLMPON (Bitfield-Mask: 0xff) */
#define BDRV_SEQAFHB1CD_HB1AF_TDICLMPOFF_Pos (0UL)                  /*!< BDRV SEQAFHB1CD: HB1AF_TDICLMPOFF (Bit 0)             */
#define BDRV_SEQAFHB1CD_HB1AF_TDICLMPOFF_Msk (0xffUL)               /*!< BDRV SEQAFHB1CD: HB1AF_TDICLMPOFF (Bitfield-Mask: 0xff) */
/* ======================================================  SEQAFHB1IC  ======================================================= */
#define BDRV_SEQAFHB1IC_HB1AF_ION_Pos     (16UL)                    /*!< BDRV SEQAFHB1IC: HB1AF_ION (Bit 16)                   */
#define BDRV_SEQAFHB1IC_HB1AF_ION_Msk     (0x3f0000UL)              /*!< BDRV SEQAFHB1IC: HB1AF_ION (Bitfield-Mask: 0x3f)      */
#define BDRV_SEQAFHB1IC_HB1AF_IOFF_Pos    (0UL)                     /*!< BDRV SEQAFHB1IC: HB1AF_IOFF (Bit 0)                   */
#define BDRV_SEQAFHB1IC_HB1AF_IOFF_Msk    (0x3fUL)                  /*!< BDRV SEQAFHB1IC: HB1AF_IOFF (Bitfield-Mask: 0x3f)     */
/* ======================================================  SEQAFHB2CD  ======================================================= */
#define BDRV_SEQAFHB2CD_HB2AF_TDICLMPON_Pos (8UL)                   /*!< BDRV SEQAFHB2CD: HB2AF_TDICLMPON (Bit 8)              */
#define BDRV_SEQAFHB2CD_HB2AF_TDICLMPON_Msk (0xff00UL)              /*!< BDRV SEQAFHB2CD: HB2AF_TDICLMPON (Bitfield-Mask: 0xff) */
#define BDRV_SEQAFHB2CD_HB2AF_TDICLMPOFF_Pos (0UL)                  /*!< BDRV SEQAFHB2CD: HB2AF_TDICLMPOFF (Bit 0)             */
#define BDRV_SEQAFHB2CD_HB2AF_TDICLMPOFF_Msk (0xffUL)               /*!< BDRV SEQAFHB2CD: HB2AF_TDICLMPOFF (Bitfield-Mask: 0xff) */
/* ======================================================  SEQAFHB2IC  ======================================================= */
#define BDRV_SEQAFHB2IC_HB2AF_ION_Pos     (16UL)                    /*!< BDRV SEQAFHB2IC: HB2AF_ION (Bit 16)                   */
#define BDRV_SEQAFHB2IC_HB2AF_ION_Msk     (0x3f0000UL)              /*!< BDRV SEQAFHB2IC: HB2AF_ION (Bitfield-Mask: 0x3f)      */
#define BDRV_SEQAFHB2IC_HB2AF_IOFF_Pos    (0UL)                     /*!< BDRV SEQAFHB2IC: HB2AF_IOFF (Bit 0)                   */
#define BDRV_SEQAFHB2IC_HB2AF_IOFF_Msk    (0x3fUL)                  /*!< BDRV SEQAFHB2IC: HB2AF_IOFF (Bitfield-Mask: 0x3f)     */
