Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
/* =========================================================  AIRCR  ========================================================= */
#define CPU_AIRCR_VECTKEY_Pos             (16UL)                    /*!< CPU AIRCR: VECTKEY (Bit 16)                           */
#define CPU_AIRCR_VECTKEY_Msk             (0xffff0000UL)            /*!< CPU AIRCR: VECTKEY (Bitfield-Mask: 0xffff)            */
#define CPU_AIRCR_ENDIANNESS_Pos          (15UL)                    /*!< CPU AIRCR: ENDIANNESS (Bit 15)                        */
#define CPU_AIRCR_ENDIANNESS_Msk          (0x8000UL)                /*!< CPU AIRCR: ENDIANNESS (Bitfield-Mask: 0x01)           */
#define CPU_AIRCR_SYSRESETREQ_Pos         (2UL)                     /*!< CPU AIRCR: SYSRESETREQ (Bit 2)                        */
#define CPU_AIRCR_SYSRESETREQ_Msk         (0x4UL)                   /*!< CPU AIRCR: SYSRESETREQ (Bitfield-Mask: 0x01)          */
#define CPU_AIRCR_VECTCLRACTIVE_Pos       (1UL)                     /*!< CPU AIRCR: VECTCLRACTIVE (Bit 1)                      */
#define CPU_AIRCR_VECTCLRACTIVE_Msk       (0x2UL)                   /*!< CPU AIRCR: VECTCLRACTIVE (Bitfield-Mask: 0x01)        */
/* ==========================================================  CCR  ========================================================== */
#define CPU_CCR_STKALIGN_Pos              (9UL)                     /*!< CPU CCR: STKALIGN (Bit 9)                             */
#define CPU_CCR_STKALIGN_Msk              (0x200UL)                 /*!< CPU CCR: STKALIGN (Bitfield-Mask: 0x01)               */
#define CPU_CCR_UNALIGN_TRP_Pos           (3UL)                     /*!< CPU CCR: UNALIGN_TRP (Bit 3)                          */
#define CPU_CCR_UNALIGN_TRP_Msk           (0x8UL)                   /*!< CPU CCR: UNALIGN_TRP (Bitfield-Mask: 0x01)            */
/* =========================================================  CPUID  ========================================================= */
#define CPU_CPUID_IMPLEMENTER_Pos         (24UL)                    /*!< CPU CPUID: IMPLEMENTER (Bit 24)                       */
#define CPU_CPUID_IMPLEMENTER_Msk         (0xff000000UL)            /*!< CPU CPUID: IMPLEMENTER (Bitfield-Mask: 0xff)          */
#define CPU_CPUID_VARIANT_Pos             (20UL)                    /*!< CPU CPUID: VARIANT (Bit 20)                           */
#define CPU_CPUID_VARIANT_Msk             (0xf00000UL)              /*!< CPU CPUID: VARIANT (Bitfield-Mask: 0x0f)              */
#define CPU_CPUID_CONSTANT_Pos            (16UL)                    /*!< CPU CPUID: CONSTANT (Bit 16)                          */
#define CPU_CPUID_CONSTANT_Msk            (0xf0000UL)               /*!< CPU CPUID: CONSTANT (Bitfield-Mask: 0x0f)             */
#define CPU_CPUID_PARTNO_Pos              (4UL)                     /*!< CPU CPUID: PARTNO (Bit 4)                             */
#define CPU_CPUID_PARTNO_Msk              (0xfff0UL)                /*!< CPU CPUID: PARTNO (Bitfield-Mask: 0xfff)              */
#define CPU_CPUID_REVISION_Pos            (0UL)                     /*!< CPU CPUID: REVISION (Bit 0)                           */
#define CPU_CPUID_REVISION_Msk            (0xfUL)                   /*!< CPU CPUID: REVISION (Bitfield-Mask: 0x0f)             */
/* =========================================================  ICSR  ========================================================== */
#define CPU_ICSR_NMIPENDSET_Pos           (31UL)                    /*!< CPU ICSR: NMIPENDSET (Bit 31)                         */
#define CPU_ICSR_NMIPENDSET_Msk           (0x80000000UL)            /*!< CPU ICSR: NMIPENDSET (Bitfield-Mask: 0x01)            */
#define CPU_ICSR_PENDSVSET_Pos            (28UL)                    /*!< CPU ICSR: PENDSVSET (Bit 28)                          */
#define CPU_ICSR_PENDSVSET_Msk            (0x10000000UL)            /*!< CPU ICSR: PENDSVSET (Bitfield-Mask: 0x01)             */
#define CPU_ICSR_PENDSVCLR_Pos            (27UL)                    /*!< CPU ICSR: PENDSVCLR (Bit 27)                          */
#define CPU_ICSR_PENDSVCLR_Msk            (0x8000000UL)             /*!< CPU ICSR: PENDSVCLR (Bitfield-Mask: 0x01)             */
#define CPU_ICSR_PENDSTSET_Pos            (26UL)                    /*!< CPU ICSR: PENDSTSET (Bit 26)                          */
#define CPU_ICSR_PENDSTSET_Msk            (0x4000000UL)             /*!< CPU ICSR: PENDSTSET (Bitfield-Mask: 0x01)             */
#define CPU_ICSR_PENDSTCLR_Pos            (25UL)                    /*!< CPU ICSR: PENDSTCLR (Bit 25)                          */
#define CPU_ICSR_PENDSTCLR_Msk            (0x2000000UL)             /*!< CPU ICSR: PENDSTCLR (Bitfield-Mask: 0x01)             */
#define CPU_ICSR_ISRPENDING_Pos           (22UL)                    /*!< CPU ICSR: ISRPENDING (Bit 22)                         */
#define CPU_ICSR_ISRPENDING_Msk           (0x400000UL)              /*!< CPU ICSR: ISRPENDING (Bitfield-Mask: 0x01)            */
#define CPU_ICSR_VECTPENDING_Pos          (12UL)                    /*!< CPU ICSR: VECTPENDING (Bit 12)                        */
#define CPU_ICSR_VECTPENDING_Msk          (0x3f000UL)               /*!< CPU ICSR: VECTPENDING (Bitfield-Mask: 0x3f)           */
#define CPU_ICSR_VECTACTIVE_Pos           (0UL)                     /*!< CPU ICSR: VECTACTIVE (Bit 0)                          */
#define CPU_ICSR_VECTACTIVE_Msk           (0x3fUL)                  /*!< CPU ICSR: VECTACTIVE (Bitfield-Mask: 0x3f)            */
/* =======================================================  NVIC_ICER  ======================================================= */
#define CPU_NVIC_ICER_Int_PORT2_Pos       (23UL)                    /*!< CPU NVIC_ICER: Int_PORT2 (Bit 23)                     */
#define CPU_NVIC_ICER_Int_PORT2_Msk       (0x800000UL)              /*!< CPU NVIC_ICER: Int_PORT2 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ICER_Int_MON_Pos         (22UL)                    /*!< CPU NVIC_ICER: Int_MON (Bit 22)                       */
#define CPU_NVIC_ICER_Int_MON_Msk         (0x400000UL)              /*!< CPU NVIC_ICER: Int_MON (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ICER_Int_DU_Pos          (21UL)                    /*!< CPU NVIC_ICER: Int_DU (Bit 21)                        */
#define CPU_NVIC_ICER_Int_DU_Msk          (0x200000UL)              /*!< CPU NVIC_ICER: Int_DU (Bitfield-Mask: 0x01)           */
#define CPU_NVIC_ICER_Int_OPA_Pos         (20UL)                    /*!< CPU NVIC_ICER: Int_OPA (Bit 20)                       */
#define CPU_NVIC_ICER_Int_OPA_Msk         (0x100000UL)              /*!< CPU NVIC_ICER: Int_OPA (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ICER_Int_HS_Pos          (19UL)                    /*!< CPU NVIC_ICER: Int_HS (Bit 19)                        */
#define CPU_NVIC_ICER_Int_HS_Msk          (0x80000UL)               /*!< CPU NVIC_ICER: Int_HS (Bitfield-Mask: 0x01)           */
#define CPU_NVIC_ICER_Int_BDRV_Pos        (18UL)                    /*!< CPU NVIC_ICER: Int_BDRV (Bit 18)                      */
#define CPU_NVIC_ICER_Int_BDRV_Msk        (0x40000UL)               /*!< CPU NVIC_ICER: Int_BDRV (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ICER_Int_CP_Pos          (17UL)                    /*!< CPU NVIC_ICER: Int_CP (Bit 17)                        */
#define CPU_NVIC_ICER_Int_CP_Msk          (0x20000UL)               /*!< CPU NVIC_ICER: Int_CP (Bitfield-Mask: 0x01)           */
#define CPU_NVIC_ICER_Int_MATHDIV_Pos     (15UL)                    /*!< CPU NVIC_ICER: Int_MATHDIV (Bit 15)                   */
#define CPU_NVIC_ICER_Int_MATHDIV_Msk     (0x8000UL)                /*!< CPU NVIC_ICER: Int_MATHDIV (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ICER_Int_WAKEUP_Pos      (14UL)                    /*!< CPU NVIC_ICER: Int_WAKEUP (Bit 14)                    */
#define CPU_NVIC_ICER_Int_WAKEUP_Msk      (0x4000UL)                /*!< CPU NVIC_ICER: Int_WAKEUP (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ICER_Int_EXINT1_Pos      (13UL)                    /*!< CPU NVIC_ICER: Int_EXINT1 (Bit 13)                    */
#define CPU_NVIC_ICER_Int_EXINT1_Msk      (0x2000UL)                /*!< CPU NVIC_ICER: Int_EXINT1 (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ICER_Int_EXINT0_Pos      (12UL)                    /*!< CPU NVIC_ICER: Int_EXINT0 (Bit 12)                    */
#define CPU_NVIC_ICER_Int_EXINT0_Msk      (0x1000UL)                /*!< CPU NVIC_ICER: Int_EXINT0 (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ICER_Int_UART2_Pos       (11UL)                    /*!< CPU NVIC_ICER: Int_UART2 (Bit 11)                     */
#define CPU_NVIC_ICER_Int_UART2_Msk       (0x800UL)                 /*!< CPU NVIC_ICER: Int_UART2 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ICER_Int_UART1_Pos       (10UL)                    /*!< CPU NVIC_ICER: Int_UART1 (Bit 10)                     */
#define CPU_NVIC_ICER_Int_UART1_Msk       (0x400UL)                 /*!< CPU NVIC_ICER: Int_UART1 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ICER_Int_SSC2_Pos        (9UL)                     /*!< CPU NVIC_ICER: Int_SSC2 (Bit 9)                       */
#define CPU_NVIC_ICER_Int_SSC2_Msk        (0x200UL)                 /*!< CPU NVIC_ICER: Int_SSC2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ICER_Int_SSC1_Pos        (8UL)                     /*!< CPU NVIC_ICER: Int_SSC1 (Bit 8)                       */
#define CPU_NVIC_ICER_Int_SSC1_Msk        (0x100UL)                 /*!< CPU NVIC_ICER: Int_SSC1 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ICER_Int_CCU6SR3_Pos     (7UL)                     /*!< CPU NVIC_ICER: Int_CCU6SR3 (Bit 7)                    */
#define CPU_NVIC_ICER_Int_CCU6SR3_Msk     (0x80UL)                  /*!< CPU NVIC_ICER: Int_CCU6SR3 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ICER_Int_CCU6SR2_Pos     (6UL)                     /*!< CPU NVIC_ICER: Int_CCU6SR2 (Bit 6)                    */
#define CPU_NVIC_ICER_Int_CCU6SR2_Msk     (0x40UL)                  /*!< CPU NVIC_ICER: Int_CCU6SR2 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ICER_Int_CCU6SR1_Pos     (5UL)                     /*!< CPU NVIC_ICER: Int_CCU6SR1 (Bit 5)                    */
#define CPU_NVIC_ICER_Int_CCU6SR1_Msk     (0x20UL)                  /*!< CPU NVIC_ICER: Int_CCU6SR1 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ICER_Int_CCU6SR0_Pos     (4UL)                     /*!< CPU NVIC_ICER: Int_CCU6SR0 (Bit 4)                    */
#define CPU_NVIC_ICER_Int_CCU6SR0_Msk     (0x10UL)                  /*!< CPU NVIC_ICER: Int_CCU6SR0 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ICER_Int_ADC1_Pos        (3UL)                     /*!< CPU NVIC_ICER: Int_ADC1 (Bit 3)                       */
#define CPU_NVIC_ICER_Int_ADC1_Msk        (0x8UL)                   /*!< CPU NVIC_ICER: Int_ADC1 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ICER_Int_ADC2_Pos        (2UL)                     /*!< CPU NVIC_ICER: Int_ADC2 (Bit 2)                       */
#define CPU_NVIC_ICER_Int_ADC2_Msk        (0x4UL)                   /*!< CPU NVIC_ICER: Int_ADC2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ICER_Int_GPT2_Pos        (1UL)                     /*!< CPU NVIC_ICER: Int_GPT2 (Bit 1)                       */
#define CPU_NVIC_ICER_Int_GPT2_Msk        (0x2UL)                   /*!< CPU NVIC_ICER: Int_GPT2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ICER_Int_GPT1_Pos        (0UL)                     /*!< CPU NVIC_ICER: Int_GPT1 (Bit 0)                       */
#define CPU_NVIC_ICER_Int_GPT1_Msk        (0x1UL)                   /*!< CPU NVIC_ICER: Int_GPT1 (Bitfield-Mask: 0x01)         */
/* =======================================================  NVIC_ICPR  ======================================================= */
#define CPU_NVIC_ICPR_Int_PORT2_Pos       (23UL)                    /*!< CPU NVIC_ICPR: Int_PORT2 (Bit 23)                     */
#define CPU_NVIC_ICPR_Int_PORT2_Msk       (0x800000UL)              /*!< CPU NVIC_ICPR: Int_PORT2 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ICPR_Int_MON_Pos         (22UL)                    /*!< CPU NVIC_ICPR: Int_MON (Bit 22)                       */
#define CPU_NVIC_ICPR_Int_MON_Msk         (0x400000UL)              /*!< CPU NVIC_ICPR: Int_MON (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ICPR_Int_DU_Pos          (21UL)                    /*!< CPU NVIC_ICPR: Int_DU (Bit 21)                        */
#define CPU_NVIC_ICPR_Int_DU_Msk          (0x200000UL)              /*!< CPU NVIC_ICPR: Int_DU (Bitfield-Mask: 0x01)           */
#define CPU_NVIC_ICPR_Int_OPA_Pos         (20UL)                    /*!< CPU NVIC_ICPR: Int_OPA (Bit 20)                       */
#define CPU_NVIC_ICPR_Int_OPA_Msk         (0x100000UL)              /*!< CPU NVIC_ICPR: Int_OPA (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ICPR_Int_HS_Pos          (19UL)                    /*!< CPU NVIC_ICPR: Int_HS (Bit 19)                        */
#define CPU_NVIC_ICPR_Int_HS_Msk          (0x80000UL)               /*!< CPU NVIC_ICPR: Int_HS (Bitfield-Mask: 0x01)           */
#define CPU_NVIC_ICPR_Int_BDRV_Pos        (18UL)                    /*!< CPU NVIC_ICPR: Int_BDRV (Bit 18)                      */
#define CPU_NVIC_ICPR_Int_BDRV_Msk        (0x40000UL)               /*!< CPU NVIC_ICPR: Int_BDRV (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ICPR_Int_CP_Pos          (17UL)                    /*!< CPU NVIC_ICPR: Int_CP (Bit 17)                        */
#define CPU_NVIC_ICPR_Int_CP_Msk          (0x20000UL)               /*!< CPU NVIC_ICPR: Int_CP (Bitfield-Mask: 0x01)           */
#define CPU_NVIC_ICPR_Int_MATHDIV_Pos     (15UL)                    /*!< CPU NVIC_ICPR: Int_MATHDIV (Bit 15)                   */
#define CPU_NVIC_ICPR_Int_MATHDIV_Msk     (0x8000UL)                /*!< CPU NVIC_ICPR: Int_MATHDIV (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ICPR_Int_WAKEUP_Pos      (14UL)                    /*!< CPU NVIC_ICPR: Int_WAKEUP (Bit 14)                    */
#define CPU_NVIC_ICPR_Int_WAKEUP_Msk      (0x4000UL)                /*!< CPU NVIC_ICPR: Int_WAKEUP (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ICPR_Int_EXINT1_Pos      (13UL)                    /*!< CPU NVIC_ICPR: Int_EXINT1 (Bit 13)                    */
#define CPU_NVIC_ICPR_Int_EXINT1_Msk      (0x2000UL)                /*!< CPU NVIC_ICPR: Int_EXINT1 (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ICPR_Int_EXINT0_Pos      (12UL)                    /*!< CPU NVIC_ICPR: Int_EXINT0 (Bit 12)                    */
#define CPU_NVIC_ICPR_Int_EXINT0_Msk      (0x1000UL)                /*!< CPU NVIC_ICPR: Int_EXINT0 (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ICPR_Int_UART2_Pos       (11UL)                    /*!< CPU NVIC_ICPR: Int_UART2 (Bit 11)                     */
#define CPU_NVIC_ICPR_Int_UART2_Msk       (0x800UL)                 /*!< CPU NVIC_ICPR: Int_UART2 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ICPR_Int_UART1_Pos       (10UL)                    /*!< CPU NVIC_ICPR: Int_UART1 (Bit 10)                     */
#define CPU_NVIC_ICPR_Int_UART1_Msk       (0x400UL)                 /*!< CPU NVIC_ICPR: Int_UART1 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ICPR_Int_SSC2_Pos        (9UL)                     /*!< CPU NVIC_ICPR: Int_SSC2 (Bit 9)                       */
#define CPU_NVIC_ICPR_Int_SSC2_Msk        (0x200UL)                 /*!< CPU NVIC_ICPR: Int_SSC2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ICPR_Int_SSC1_Pos        (8UL)                     /*!< CPU NVIC_ICPR: Int_SSC1 (Bit 8)                       */
#define CPU_NVIC_ICPR_Int_SSC1_Msk        (0x100UL)                 /*!< CPU NVIC_ICPR: Int_SSC1 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ICPR_Int_CCU6SR3_Pos     (7UL)                     /*!< CPU NVIC_ICPR: Int_CCU6SR3 (Bit 7)                    */
#define CPU_NVIC_ICPR_Int_CCU6SR3_Msk     (0x80UL)                  /*!< CPU NVIC_ICPR: Int_CCU6SR3 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ICPR_Int_CCU6SR2_Pos     (6UL)                     /*!< CPU NVIC_ICPR: Int_CCU6SR2 (Bit 6)                    */
#define CPU_NVIC_ICPR_Int_CCU6SR2_Msk     (0x40UL)                  /*!< CPU NVIC_ICPR: Int_CCU6SR2 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ICPR_Int_CCU6SR1_Pos     (5UL)                     /*!< CPU NVIC_ICPR: Int_CCU6SR1 (Bit 5)                    */
#define CPU_NVIC_ICPR_Int_CCU6SR1_Msk     (0x20UL)                  /*!< CPU NVIC_ICPR: Int_CCU6SR1 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ICPR_Int_CCU6SR0_Pos     (4UL)                     /*!< CPU NVIC_ICPR: Int_CCU6SR0 (Bit 4)                    */
#define CPU_NVIC_ICPR_Int_CCU6SR0_Msk     (0x10UL)                  /*!< CPU NVIC_ICPR: Int_CCU6SR0 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ICPR_Int_ADC1_Pos        (3UL)                     /*!< CPU NVIC_ICPR: Int_ADC1 (Bit 3)                       */
#define CPU_NVIC_ICPR_Int_ADC1_Msk        (0x8UL)                   /*!< CPU NVIC_ICPR: Int_ADC1 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ICPR_Int_ADC2_Pos        (2UL)                     /*!< CPU NVIC_ICPR: Int_ADC2 (Bit 2)                       */
#define CPU_NVIC_ICPR_Int_ADC2_Msk        (0x4UL)                   /*!< CPU NVIC_ICPR: Int_ADC2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ICPR_Int_GPT2_Pos        (1UL)                     /*!< CPU NVIC_ICPR: Int_GPT2 (Bit 1)                       */
#define CPU_NVIC_ICPR_Int_GPT2_Msk        (0x2UL)                   /*!< CPU NVIC_ICPR: Int_GPT2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ICPR_Int_GPT1_Pos        (0UL)                     /*!< CPU NVIC_ICPR: Int_GPT1 (Bit 0)                       */
#define CPU_NVIC_ICPR_Int_GPT1_Msk        (0x1UL)                   /*!< CPU NVIC_ICPR: Int_GPT1 (Bitfield-Mask: 0x01)         */
/* =======================================================  NVIC_IPR0  ======================================================= */
#define CPU_NVIC_IPR0_PRI_ADC1_Pos        (30UL)                    /*!< CPU NVIC_IPR0: PRI_ADC1 (Bit 30)                      */
#define CPU_NVIC_IPR0_PRI_ADC1_Msk        (0xc0000000UL)            /*!< CPU NVIC_IPR0: PRI_ADC1 (Bitfield-Mask: 0x03)         */
#define CPU_NVIC_IPR0_PRI_ADC2_Pos        (22UL)                    /*!< CPU NVIC_IPR0: PRI_ADC2 (Bit 22)                      */
#define CPU_NVIC_IPR0_PRI_ADC2_Msk        (0xc00000UL)              /*!< CPU NVIC_IPR0: PRI_ADC2 (Bitfield-Mask: 0x03)         */
#define CPU_NVIC_IPR0_PRI_GPT2_Pos        (14UL)                    /*!< CPU NVIC_IPR0: PRI_GPT2 (Bit 14)                      */
#define CPU_NVIC_IPR0_PRI_GPT2_Msk        (0xc000UL)                /*!< CPU NVIC_IPR0: PRI_GPT2 (Bitfield-Mask: 0x03)         */
#define CPU_NVIC_IPR0_PRI_GPT1_Pos        (6UL)                     /*!< CPU NVIC_IPR0: PRI_GPT1 (Bit 6)                       */
#define CPU_NVIC_IPR0_PRI_GPT1_Msk        (0xc0UL)                  /*!< CPU NVIC_IPR0: PRI_GPT1 (Bitfield-Mask: 0x03)         */
/* =======================================================  NVIC_IPR1  ======================================================= */
#define CPU_NVIC_IPR1_PRI_CCU6SR3_Pos     (30UL)                    /*!< CPU NVIC_IPR1: PRI_CCU6SR3 (Bit 30)                   */
#define CPU_NVIC_IPR1_PRI_CCU6SR3_Msk     (0xc0000000UL)            /*!< CPU NVIC_IPR1: PRI_CCU6SR3 (Bitfield-Mask: 0x03)      */
#define CPU_NVIC_IPR1_PRI_CCU6SR2_Pos     (22UL)                    /*!< CPU NVIC_IPR1: PRI_CCU6SR2 (Bit 22)                   */
#define CPU_NVIC_IPR1_PRI_CCU6SR2_Msk     (0xc00000UL)              /*!< CPU NVIC_IPR1: PRI_CCU6SR2 (Bitfield-Mask: 0x03)      */
#define CPU_NVIC_IPR1_PRI_CCU6SR1_Pos     (14UL)                    /*!< CPU NVIC_IPR1: PRI_CCU6SR1 (Bit 14)                   */
#define CPU_NVIC_IPR1_PRI_CCU6SR1_Msk     (0xc000UL)                /*!< CPU NVIC_IPR1: PRI_CCU6SR1 (Bitfield-Mask: 0x03)      */
#define CPU_NVIC_IPR1_PRI_CCU6SR0_Pos     (6UL)                     /*!< CPU NVIC_IPR1: PRI_CCU6SR0 (Bit 6)                    */
#define CPU_NVIC_IPR1_PRI_CCU6SR0_Msk     (0xc0UL)                  /*!< CPU NVIC_IPR1: PRI_CCU6SR0 (Bitfield-Mask: 0x03)      */
/* =======================================================  NVIC_IPR2  ======================================================= */
#define CPU_NVIC_IPR2_PRI_UART2_Pos       (30UL)                    /*!< CPU NVIC_IPR2: PRI_UART2 (Bit 30)                     */
#define CPU_NVIC_IPR2_PRI_UART2_Msk       (0xc0000000UL)            /*!< CPU NVIC_IPR2: PRI_UART2 (Bitfield-Mask: 0x03)        */
#define CPU_NVIC_IPR2_PRI_UART1_Pos       (22UL)                    /*!< CPU NVIC_IPR2: PRI_UART1 (Bit 22)                     */
#define CPU_NVIC_IPR2_PRI_UART1_Msk       (0xc00000UL)              /*!< CPU NVIC_IPR2: PRI_UART1 (Bitfield-Mask: 0x03)        */
#define CPU_NVIC_IPR2_PRI_SSC2_Pos        (14UL)                    /*!< CPU NVIC_IPR2: PRI_SSC2 (Bit 14)                      */
#define CPU_NVIC_IPR2_PRI_SSC2_Msk        (0xc000UL)                /*!< CPU NVIC_IPR2: PRI_SSC2 (Bitfield-Mask: 0x03)         */
#define CPU_NVIC_IPR2_PRI_SSC1_Pos        (6UL)                     /*!< CPU NVIC_IPR2: PRI_SSC1 (Bit 6)                       */
#define CPU_NVIC_IPR2_PRI_SSC1_Msk        (0xc0UL)                  /*!< CPU NVIC_IPR2: PRI_SSC1 (Bitfield-Mask: 0x03)         */
/* =======================================================  NVIC_IPR3  ======================================================= */
#define CPU_NVIC_IPR3_PRI_MATHDIV_Pos     (30UL)                    /*!< CPU NVIC_IPR3: PRI_MATHDIV (Bit 30)                   */
#define CPU_NVIC_IPR3_PRI_MATHDIV_Msk     (0xc0000000UL)            /*!< CPU NVIC_IPR3: PRI_MATHDIV (Bitfield-Mask: 0x03)      */
#define CPU_NVIC_IPR3_PRI_WAKEUP_Pos      (22UL)                    /*!< CPU NVIC_IPR3: PRI_WAKEUP (Bit 22)                    */
#define CPU_NVIC_IPR3_PRI_WAKEUP_Msk      (0xc00000UL)              /*!< CPU NVIC_IPR3: PRI_WAKEUP (Bitfield-Mask: 0x03)       */
#define CPU_NVIC_IPR3_PRI_EXINT1_Pos      (14UL)                    /*!< CPU NVIC_IPR3: PRI_EXINT1 (Bit 14)                    */
#define CPU_NVIC_IPR3_PRI_EXINT1_Msk      (0xc000UL)                /*!< CPU NVIC_IPR3: PRI_EXINT1 (Bitfield-Mask: 0x03)       */
#define CPU_NVIC_IPR3_PRI_EXINT0_Pos      (6UL)                     /*!< CPU NVIC_IPR3: PRI_EXINT0 (Bit 6)                     */
#define CPU_NVIC_IPR3_PRI_EXINT0_Msk      (0xc0UL)                  /*!< CPU NVIC_IPR3: PRI_EXINT0 (Bitfield-Mask: 0x03)       */
/* =======================================================  NVIC_IPR4  ======================================================= */
#define CPU_NVIC_IPR4_PRI_HS_Pos          (30UL)                    /*!< CPU NVIC_IPR4: PRI_HS (Bit 30)                        */
#define CPU_NVIC_IPR4_PRI_HS_Msk          (0xc0000000UL)            /*!< CPU NVIC_IPR4: PRI_HS (Bitfield-Mask: 0x03)           */
#define CPU_NVIC_IPR4_PRI_BDRV_Pos        (22UL)                    /*!< CPU NVIC_IPR4: PRI_BDRV (Bit 22)                      */
#define CPU_NVIC_IPR4_PRI_BDRV_Msk        (0xc00000UL)              /*!< CPU NVIC_IPR4: PRI_BDRV (Bitfield-Mask: 0x03)         */
#define CPU_NVIC_IPR4_PRI_CP_Pos          (14UL)                    /*!< CPU NVIC_IPR4: PRI_CP (Bit 14)                        */
#define CPU_NVIC_IPR4_PRI_CP_Msk          (0xc000UL)                /*!< CPU NVIC_IPR4: PRI_CP (Bitfield-Mask: 0x03)           */
/* =======================================================  NVIC_IPR5  ======================================================= */
#define CPU_NVIC_IPR5_PRI_PORT2_Pos       (30UL)                    /*!< CPU NVIC_IPR5: PRI_PORT2 (Bit 30)                     */
#define CPU_NVIC_IPR5_PRI_PORT2_Msk       (0xc0000000UL)            /*!< CPU NVIC_IPR5: PRI_PORT2 (Bitfield-Mask: 0x03)        */
#define CPU_NVIC_IPR5_PRI_MON_Pos         (22UL)                    /*!< CPU NVIC_IPR5: PRI_MON (Bit 22)                       */
#define CPU_NVIC_IPR5_PRI_MON_Msk         (0xc00000UL)              /*!< CPU NVIC_IPR5: PRI_MON (Bitfield-Mask: 0x03)          */
