Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
#define CPU_NVIC_IPR5_PRI_DU_Pos          (14UL)                    /*!< CPU NVIC_IPR5: PRI_DU (Bit 14)                        */
#define CPU_NVIC_IPR5_PRI_DU_Msk          (0xc000UL)                /*!< CPU NVIC_IPR5: PRI_DU (Bitfield-Mask: 0x03)           */
#define CPU_NVIC_IPR5_PRI_OPA_Pos         (6UL)                     /*!< CPU NVIC_IPR5: PRI_OPA (Bit 6)                        */
#define CPU_NVIC_IPR5_PRI_OPA_Msk         (0xc0UL)                  /*!< CPU NVIC_IPR5: PRI_OPA (Bitfield-Mask: 0x03)          */
/* =======================================================  NVIC_ISER  ======================================================= */
#define CPU_NVIC_ISER_Int_PORT2_Pos       (23UL)                    /*!< CPU NVIC_ISER: Int_PORT2 (Bit 23)                     */
#define CPU_NVIC_ISER_Int_PORT2_Msk       (0x800000UL)              /*!< CPU NVIC_ISER: Int_PORT2 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ISER_Int_MON_Pos         (22UL)                    /*!< CPU NVIC_ISER: Int_MON (Bit 22)                       */
#define CPU_NVIC_ISER_Int_MON_Msk         (0x400000UL)              /*!< CPU NVIC_ISER: Int_MON (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ISER_Int_DU_Pos          (21UL)                    /*!< CPU NVIC_ISER: Int_DU (Bit 21)                        */
#define CPU_NVIC_ISER_Int_DU_Msk          (0x200000UL)              /*!< CPU NVIC_ISER: Int_DU (Bitfield-Mask: 0x01)           */
#define CPU_NVIC_ISER_Int_OPA_Pos         (20UL)                    /*!< CPU NVIC_ISER: Int_OPA (Bit 20)                       */
#define CPU_NVIC_ISER_Int_OPA_Msk         (0x100000UL)              /*!< CPU NVIC_ISER: Int_OPA (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ISER_Int_HS_Pos          (19UL)                    /*!< CPU NVIC_ISER: Int_HS (Bit 19)                        */
#define CPU_NVIC_ISER_Int_HS_Msk          (0x80000UL)               /*!< CPU NVIC_ISER: Int_HS (Bitfield-Mask: 0x01)           */
#define CPU_NVIC_ISER_Int_BDRV_Pos        (18UL)                    /*!< CPU NVIC_ISER: Int_BDRV (Bit 18)                      */
#define CPU_NVIC_ISER_Int_BDRV_Msk        (0x40000UL)               /*!< CPU NVIC_ISER: Int_BDRV (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISER_Int_CP_Pos          (17UL)                    /*!< CPU NVIC_ISER: Int_CP (Bit 17)                        */
#define CPU_NVIC_ISER_Int_CP_Msk          (0x20000UL)               /*!< CPU NVIC_ISER: Int_CP (Bitfield-Mask: 0x01)           */
#define CPU_NVIC_ISER_Int_MATHDIV_Pos     (15UL)                    /*!< CPU NVIC_ISER: Int_MATHDIV (Bit 15)                   */
#define CPU_NVIC_ISER_Int_MATHDIV_Msk     (0x8000UL)                /*!< CPU NVIC_ISER: Int_MATHDIV (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISER_Int_WAKEUP_Pos      (14UL)                    /*!< CPU NVIC_ISER: Int_WAKEUP (Bit 14)                    */
#define CPU_NVIC_ISER_Int_WAKEUP_Msk      (0x4000UL)                /*!< CPU NVIC_ISER: Int_WAKEUP (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ISER_Int_EXINT1_Pos      (13UL)                    /*!< CPU NVIC_ISER: Int_EXINT1 (Bit 13)                    */
#define CPU_NVIC_ISER_Int_EXINT1_Msk      (0x2000UL)                /*!< CPU NVIC_ISER: Int_EXINT1 (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ISER_Int_EXINT0_Pos      (12UL)                    /*!< CPU NVIC_ISER: Int_EXINT0 (Bit 12)                    */
#define CPU_NVIC_ISER_Int_EXINT0_Msk      (0x1000UL)                /*!< CPU NVIC_ISER: Int_EXINT0 (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ISER_Int_UART2_Pos       (11UL)                    /*!< CPU NVIC_ISER: Int_UART2 (Bit 11)                     */
#define CPU_NVIC_ISER_Int_UART2_Msk       (0x800UL)                 /*!< CPU NVIC_ISER: Int_UART2 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ISER_Int_UART1_Pos       (10UL)                    /*!< CPU NVIC_ISER: Int_UART1 (Bit 10)                     */
#define CPU_NVIC_ISER_Int_UART1_Msk       (0x400UL)                 /*!< CPU NVIC_ISER: Int_UART1 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ISER_Int_SSC2_Pos        (9UL)                     /*!< CPU NVIC_ISER: Int_SSC2 (Bit 9)                       */
#define CPU_NVIC_ISER_Int_SSC2_Msk        (0x200UL)                 /*!< CPU NVIC_ISER: Int_SSC2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISER_Int_SSC1_Pos        (8UL)                     /*!< CPU NVIC_ISER: Int_SSC1 (Bit 8)                       */
#define CPU_NVIC_ISER_Int_SSC1_Msk        (0x100UL)                 /*!< CPU NVIC_ISER: Int_SSC1 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISER_Int_CCU6SR3_Pos     (7UL)                     /*!< CPU NVIC_ISER: Int_CCU6SR3 (Bit 7)                    */
#define CPU_NVIC_ISER_Int_CCU6SR3_Msk     (0x80UL)                  /*!< CPU NVIC_ISER: Int_CCU6SR3 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISER_Int_CCU6SR2_Pos     (6UL)                     /*!< CPU NVIC_ISER: Int_CCU6SR2 (Bit 6)                    */
#define CPU_NVIC_ISER_Int_CCU6SR2_Msk     (0x40UL)                  /*!< CPU NVIC_ISER: Int_CCU6SR2 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISER_Int_CCU6SR1_Pos     (5UL)                     /*!< CPU NVIC_ISER: Int_CCU6SR1 (Bit 5)                    */
#define CPU_NVIC_ISER_Int_CCU6SR1_Msk     (0x20UL)                  /*!< CPU NVIC_ISER: Int_CCU6SR1 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISER_Int_CCU6SR0_Pos     (4UL)                     /*!< CPU NVIC_ISER: Int_CCU6SR0 (Bit 4)                    */
#define CPU_NVIC_ISER_Int_CCU6SR0_Msk     (0x10UL)                  /*!< CPU NVIC_ISER: Int_CCU6SR0 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISER_Int_ADC1_Pos        (3UL)                     /*!< CPU NVIC_ISER: Int_ADC1 (Bit 3)                       */
#define CPU_NVIC_ISER_Int_ADC1_Msk        (0x8UL)                   /*!< CPU NVIC_ISER: Int_ADC1 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISER_Int_ADC2_Pos        (2UL)                     /*!< CPU NVIC_ISER: Int_ADC2 (Bit 2)                       */
#define CPU_NVIC_ISER_Int_ADC2_Msk        (0x4UL)                   /*!< CPU NVIC_ISER: Int_ADC2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISER_Int_GPT2_Pos        (1UL)                     /*!< CPU NVIC_ISER: Int_GPT2 (Bit 1)                       */
#define CPU_NVIC_ISER_Int_GPT2_Msk        (0x2UL)                   /*!< CPU NVIC_ISER: Int_GPT2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISER_Int_GPT1_Pos        (0UL)                     /*!< CPU NVIC_ISER: Int_GPT1 (Bit 0)                       */
#define CPU_NVIC_ISER_Int_GPT1_Msk        (0x1UL)                   /*!< CPU NVIC_ISER: Int_GPT1 (Bitfield-Mask: 0x01)         */
/* =======================================================  NVIC_ISPR  ======================================================= */
#define CPU_NVIC_ISPR_Int_PORT2_Pos       (23UL)                    /*!< CPU NVIC_ISPR: Int_PORT2 (Bit 23)                     */
#define CPU_NVIC_ISPR_Int_PORT2_Msk       (0x800000UL)              /*!< CPU NVIC_ISPR: Int_PORT2 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ISPR_Int_MON_Pos         (22UL)                    /*!< CPU NVIC_ISPR: Int_MON (Bit 22)                       */
#define CPU_NVIC_ISPR_Int_MON_Msk         (0x400000UL)              /*!< CPU NVIC_ISPR: Int_MON (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ISPR_Int_DU_Pos          (21UL)                    /*!< CPU NVIC_ISPR: Int_DU (Bit 21)                        */
#define CPU_NVIC_ISPR_Int_DU_Msk          (0x200000UL)              /*!< CPU NVIC_ISPR: Int_DU (Bitfield-Mask: 0x01)           */
#define CPU_NVIC_ISPR_Int_OPA_Pos         (20UL)                    /*!< CPU NVIC_ISPR: Int_OPA (Bit 20)                       */
#define CPU_NVIC_ISPR_Int_OPA_Msk         (0x100000UL)              /*!< CPU NVIC_ISPR: Int_OPA (Bitfield-Mask: 0x01)          */
#define CPU_NVIC_ISPR_Int_HS_Pos          (19UL)                    /*!< CPU NVIC_ISPR: Int_HS (Bit 19)                        */
#define CPU_NVIC_ISPR_Int_HS_Msk          (0x80000UL)               /*!< CPU NVIC_ISPR: Int_HS (Bitfield-Mask: 0x01)           */
#define CPU_NVIC_ISPR_Int_BDRV_Pos        (18UL)                    /*!< CPU NVIC_ISPR: Int_BDRV (Bit 18)                      */
#define CPU_NVIC_ISPR_Int_BDRV_Msk        (0x40000UL)               /*!< CPU NVIC_ISPR: Int_BDRV (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISPR_Int_CP_Pos          (17UL)                    /*!< CPU NVIC_ISPR: Int_CP (Bit 17)                        */
#define CPU_NVIC_ISPR_Int_CP_Msk          (0x20000UL)               /*!< CPU NVIC_ISPR: Int_CP (Bitfield-Mask: 0x01)           */
#define CPU_NVIC_ISPR_Int_MATHDIV_Pos     (15UL)                    /*!< CPU NVIC_ISPR: Int_MATHDIV (Bit 15)                   */
#define CPU_NVIC_ISPR_Int_MATHDIV_Msk     (0x8000UL)                /*!< CPU NVIC_ISPR: Int_MATHDIV (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISPR_Int_WAKEUP_Pos      (14UL)                    /*!< CPU NVIC_ISPR: Int_WAKEUP (Bit 14)                    */
#define CPU_NVIC_ISPR_Int_WAKEUP_Msk      (0x4000UL)                /*!< CPU NVIC_ISPR: Int_WAKEUP (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ISPR_Int_EXINT1_Pos      (13UL)                    /*!< CPU NVIC_ISPR: Int_EXINT1 (Bit 13)                    */
#define CPU_NVIC_ISPR_Int_EXINT1_Msk      (0x2000UL)                /*!< CPU NVIC_ISPR: Int_EXINT1 (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ISPR_Int_EXINT0_Pos      (12UL)                    /*!< CPU NVIC_ISPR: Int_EXINT0 (Bit 12)                    */
#define CPU_NVIC_ISPR_Int_EXINT0_Msk      (0x1000UL)                /*!< CPU NVIC_ISPR: Int_EXINT0 (Bitfield-Mask: 0x01)       */
#define CPU_NVIC_ISPR_Int_UART2_Pos       (11UL)                    /*!< CPU NVIC_ISPR: Int_UART2 (Bit 11)                     */
#define CPU_NVIC_ISPR_Int_UART2_Msk       (0x800UL)                 /*!< CPU NVIC_ISPR: Int_UART2 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ISPR_Int_UART1_Pos       (10UL)                    /*!< CPU NVIC_ISPR: Int_UART1 (Bit 10)                     */
#define CPU_NVIC_ISPR_Int_UART1_Msk       (0x400UL)                 /*!< CPU NVIC_ISPR: Int_UART1 (Bitfield-Mask: 0x01)        */
#define CPU_NVIC_ISPR_Int_SSC2_Pos        (9UL)                     /*!< CPU NVIC_ISPR: Int_SSC2 (Bit 9)                       */
#define CPU_NVIC_ISPR_Int_SSC2_Msk        (0x200UL)                 /*!< CPU NVIC_ISPR: Int_SSC2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISPR_Int_SSC1_Pos        (8UL)                     /*!< CPU NVIC_ISPR: Int_SSC1 (Bit 8)                       */
#define CPU_NVIC_ISPR_Int_SSC1_Msk        (0x100UL)                 /*!< CPU NVIC_ISPR: Int_SSC1 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISPR_Int_CCU6SR3_Pos     (7UL)                     /*!< CPU NVIC_ISPR: Int_CCU6SR3 (Bit 7)                    */
#define CPU_NVIC_ISPR_Int_CCU6SR3_Msk     (0x80UL)                  /*!< CPU NVIC_ISPR: Int_CCU6SR3 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISPR_Int_CCU6SR2_Pos     (6UL)                     /*!< CPU NVIC_ISPR: Int_CCU6SR2 (Bit 6)                    */
#define CPU_NVIC_ISPR_Int_CCU6SR2_Msk     (0x40UL)                  /*!< CPU NVIC_ISPR: Int_CCU6SR2 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISPR_Int_CCU6SR1_Pos     (5UL)                     /*!< CPU NVIC_ISPR: Int_CCU6SR1 (Bit 5)                    */
#define CPU_NVIC_ISPR_Int_CCU6SR1_Msk     (0x20UL)                  /*!< CPU NVIC_ISPR: Int_CCU6SR1 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISPR_Int_CCU6SR0_Pos     (4UL)                     /*!< CPU NVIC_ISPR: Int_CCU6SR0 (Bit 4)                    */
#define CPU_NVIC_ISPR_Int_CCU6SR0_Msk     (0x10UL)                  /*!< CPU NVIC_ISPR: Int_CCU6SR0 (Bitfield-Mask: 0x01)      */
#define CPU_NVIC_ISPR_Int_ADC1_Pos        (3UL)                     /*!< CPU NVIC_ISPR: Int_ADC1 (Bit 3)                       */
#define CPU_NVIC_ISPR_Int_ADC1_Msk        (0x8UL)                   /*!< CPU NVIC_ISPR: Int_ADC1 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISPR_Int_ADC2_Pos        (2UL)                     /*!< CPU NVIC_ISPR: Int_ADC2 (Bit 2)                       */
#define CPU_NVIC_ISPR_Int_ADC2_Msk        (0x4UL)                   /*!< CPU NVIC_ISPR: Int_ADC2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISPR_Int_GPT2_Pos        (1UL)                     /*!< CPU NVIC_ISPR: Int_GPT2 (Bit 1)                       */
#define CPU_NVIC_ISPR_Int_GPT2_Msk        (0x2UL)                   /*!< CPU NVIC_ISPR: Int_GPT2 (Bitfield-Mask: 0x01)         */
#define CPU_NVIC_ISPR_Int_GPT1_Pos        (0UL)                     /*!< CPU NVIC_ISPR: Int_GPT1 (Bit 0)                       */
#define CPU_NVIC_ISPR_Int_GPT1_Msk        (0x1UL)                   /*!< CPU NVIC_ISPR: Int_GPT1 (Bitfield-Mask: 0x01)         */
/* ==========================================================  SCR  ========================================================== */
#define CPU_SCR_SEVONPEND_Pos             (4UL)                     /*!< CPU SCR: SEVONPEND (Bit 4)                            */
#define CPU_SCR_SEVONPEND_Msk             (0x10UL)                  /*!< CPU SCR: SEVONPEND (Bitfield-Mask: 0x01)              */
#define CPU_SCR_SLEEPDEEP_Pos             (2UL)                     /*!< CPU SCR: SLEEPDEEP (Bit 2)                            */
#define CPU_SCR_SLEEPDEEP_Msk             (0x4UL)                   /*!< CPU SCR: SLEEPDEEP (Bitfield-Mask: 0x01)              */
#define CPU_SCR_SLEEPONEXIT_Pos           (1UL)                     /*!< CPU SCR: SLEEPONEXIT (Bit 1)                          */
#define CPU_SCR_SLEEPONEXIT_Msk           (0x2UL)                   /*!< CPU SCR: SLEEPONEXIT (Bitfield-Mask: 0x01)            */
/* =========================================================  SHCSR  ========================================================= */
#define CPU_SHCSR_SVCALLPENDED_Pos        (15UL)                    /*!< CPU SHCSR: SVCALLPENDED (Bit 15)                      */
#define CPU_SHCSR_SVCALLPENDED_Msk        (0x8000UL)                /*!< CPU SHCSR: SVCALLPENDED (Bitfield-Mask: 0x01)         */
/* =========================================================  SHPR2  ========================================================= */
#define CPU_SHPR2_PRI_11_Pos              (30UL)                    /*!< CPU SHPR2: PRI_11 (Bit 30)                            */
#define CPU_SHPR2_PRI_11_Msk              (0xc0000000UL)            /*!< CPU SHPR2: PRI_11 (Bitfield-Mask: 0x03)               */
/* =========================================================  SHPR3  ========================================================= */
#define CPU_SHPR3_PRI_15_Pos              (30UL)                    /*!< CPU SHPR3: PRI_15 (Bit 30)                            */
#define CPU_SHPR3_PRI_15_Msk              (0xc0000000UL)            /*!< CPU SHPR3: PRI_15 (Bitfield-Mask: 0x03)               */
#define CPU_SHPR3_PRI_14_Pos              (22UL)                    /*!< CPU SHPR3: PRI_14 (Bit 22)                            */
#define CPU_SHPR3_PRI_14_Msk              (0xc00000UL)              /*!< CPU SHPR3: PRI_14 (Bitfield-Mask: 0x03)               */
/* =====================================================  SYSTICK_CALIB  ===================================================== */
#define CPU_SYSTICK_CALIB_NOREF_Pos       (31UL)                    /*!< CPU SYSTICK_CALIB: NOREF (Bit 31)                     */
#define CPU_SYSTICK_CALIB_NOREF_Msk       (0x80000000UL)            /*!< CPU SYSTICK_CALIB: NOREF (Bitfield-Mask: 0x01)        */
#define CPU_SYSTICK_CALIB_SKEW_Pos        (30UL)                    /*!< CPU SYSTICK_CALIB: SKEW (Bit 30)                      */
#define CPU_SYSTICK_CALIB_SKEW_Msk        (0x40000000UL)            /*!< CPU SYSTICK_CALIB: SKEW (Bitfield-Mask: 0x01)         */
#define CPU_SYSTICK_CALIB_TENMS_Pos       (0UL)                     /*!< CPU SYSTICK_CALIB: TENMS (Bit 0)                      */
#define CPU_SYSTICK_CALIB_TENMS_Msk       (0xffffffUL)              /*!< CPU SYSTICK_CALIB: TENMS (Bitfield-Mask: 0xffffff)    */
/* ======================================================  SYSTICK_CSR  ====================================================== */
#define CPU_SYSTICK_CSR_COUNTFLAG_Pos     (16UL)                    /*!< CPU SYSTICK_CSR: COUNTFLAG (Bit 16)                   */
#define CPU_SYSTICK_CSR_COUNTFLAG_Msk     (0x10000UL)               /*!< CPU SYSTICK_CSR: COUNTFLAG (Bitfield-Mask: 0x01)      */
#define CPU_SYSTICK_CSR_CLKSOURCE_Pos     (2UL)                     /*!< CPU SYSTICK_CSR: CLKSOURCE (Bit 2)                    */
#define CPU_SYSTICK_CSR_CLKSOURCE_Msk     (0x4UL)                   /*!< CPU SYSTICK_CSR: CLKSOURCE (Bitfield-Mask: 0x01)      */
#define CPU_SYSTICK_CSR_TICKINT_Pos       (1UL)                     /*!< CPU SYSTICK_CSR: TICKINT (Bit 1)                      */
#define CPU_SYSTICK_CSR_TICKINT_Msk       (0x2UL)                   /*!< CPU SYSTICK_CSR: TICKINT (Bitfield-Mask: 0x01)        */
#define CPU_SYSTICK_CSR_ENABLE_Pos        (0UL)                     /*!< CPU SYSTICK_CSR: ENABLE (Bit 0)                       */
#define CPU_SYSTICK_CSR_ENABLE_Msk        (0x1UL)                   /*!< CPU SYSTICK_CSR: ENABLE (Bitfield-Mask: 0x01)         */
/* ======================================================  SYSTICK_CVR  ====================================================== */
#define CPU_SYSTICK_CVR_CURRENT_Pos       (0UL)                     /*!< CPU SYSTICK_CVR: CURRENT (Bit 0)                      */
#define CPU_SYSTICK_CVR_CURRENT_Msk       (0xffffffUL)              /*!< CPU SYSTICK_CVR: CURRENT (Bitfield-Mask: 0xffffff)    */
/* ======================================================  SYSTICK_RVR  ====================================================== */
#define CPU_SYSTICK_RVR_RELOAD_Pos        (0UL)                     /*!< CPU SYSTICK_RVR: RELOAD (Bit 0)                       */
#define CPU_SYSTICK_RVR_RELOAD_Msk        (0xffffffUL)              /*!< CPU SYSTICK_RVR: RELOAD (Bitfield-Mask: 0xffffff)     */


/* =========================================================================================================================== */
/* ================                                          GPT12E                                           ================ */
/* =========================================================================================================================== */

