Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
/* =========================================================  CTRL  ========================================================== */
#define HS_CTRL_HS1_OC_SEL_Pos            (12UL)                    /*!< HS CTRL: HS1_OC_SEL (Bit 12)                          */
#define HS_CTRL_HS1_OC_SEL_Msk            (0x3000UL)                /*!< HS CTRL: HS1_OC_SEL (Bitfield-Mask: 0x03)             */
#define HS_CTRL_HS1_SR_CTRL_SEL_Pos       (8UL)                     /*!< HS CTRL: HS1_SR_CTRL_SEL (Bit 8)                      */
#define HS_CTRL_HS1_SR_CTRL_SEL_Msk       (0x300UL)                 /*!< HS CTRL: HS1_SR_CTRL_SEL (Bitfield-Mask: 0x03)        */
#define HS_CTRL_HS1_OL_EN_Pos             (3UL)                     /*!< HS CTRL: HS1_OL_EN (Bit 3)                            */
#define HS_CTRL_HS1_OL_EN_Msk             (0x8UL)                   /*!< HS CTRL: HS1_OL_EN (Bitfield-Mask: 0x01)              */
#define HS_CTRL_HS1_ON_Pos                (2UL)                     /*!< HS CTRL: HS1_ON (Bit 2)                               */
#define HS_CTRL_HS1_ON_Msk                (0x4UL)                   /*!< HS CTRL: HS1_ON (Bitfield-Mask: 0x01)                 */
#define HS_CTRL_HS1_PWM_Pos               (1UL)                     /*!< HS CTRL: HS1_PWM (Bit 1)                              */
#define HS_CTRL_HS1_PWM_Msk               (0x2UL)                   /*!< HS CTRL: HS1_PWM (Bitfield-Mask: 0x01)                */
#define HS_CTRL_HS1_EN_Pos                (0UL)                     /*!< HS CTRL: HS1_EN (Bit 0)                               */
#define HS_CTRL_HS1_EN_Msk                (0x1UL)                   /*!< HS CTRL: HS1_EN (Bitfield-Mask: 0x01)                 */
/* ========================================================  IRQCLR  ========================================================= */
#define HS_IRQCLR_HS1_OL_SC_Pos           (14UL)                    /*!< HS IRQCLR: HS1_OL_SC (Bit 14)                         */
#define HS_IRQCLR_HS1_OL_SC_Msk           (0x4000UL)                /*!< HS IRQCLR: HS1_OL_SC (Bitfield-Mask: 0x01)            */
#define HS_IRQCLR_HS1_OT_SC_Pos           (13UL)                    /*!< HS IRQCLR: HS1_OT_SC (Bit 13)                         */
#define HS_IRQCLR_HS1_OT_SC_Msk           (0x2000UL)                /*!< HS IRQCLR: HS1_OT_SC (Bitfield-Mask: 0x01)            */
#define HS_IRQCLR_HS1_OC_ISC_Pos          (7UL)                     /*!< HS IRQCLR: HS1_OC_ISC (Bit 7)                         */
#define HS_IRQCLR_HS1_OC_ISC_Msk          (0x80UL)                  /*!< HS IRQCLR: HS1_OC_ISC (Bitfield-Mask: 0x01)           */
#define HS_IRQCLR_HS1_OL_ISC_Pos          (6UL)                     /*!< HS IRQCLR: HS1_OL_ISC (Bit 6)                         */
#define HS_IRQCLR_HS1_OL_ISC_Msk          (0x40UL)                  /*!< HS IRQCLR: HS1_OL_ISC (Bitfield-Mask: 0x01)           */
#define HS_IRQCLR_HS1_OT_ISC_Pos          (5UL)                     /*!< HS IRQCLR: HS1_OT_ISC (Bit 5)                         */
#define HS_IRQCLR_HS1_OT_ISC_Msk          (0x20UL)                  /*!< HS IRQCLR: HS1_OT_ISC (Bitfield-Mask: 0x01)           */
/* =========================================================  IRQEN  ========================================================= */
#define HS_IRQEN_HS1_OC_IEN_Pos           (7UL)                     /*!< HS IRQEN: HS1_OC_IEN (Bit 7)                          */
#define HS_IRQEN_HS1_OC_IEN_Msk           (0x80UL)                  /*!< HS IRQEN: HS1_OC_IEN (Bitfield-Mask: 0x01)            */
#define HS_IRQEN_HS1_OL_IEN_Pos           (6UL)                     /*!< HS IRQEN: HS1_OL_IEN (Bit 6)                          */
#define HS_IRQEN_HS1_OL_IEN_Msk           (0x40UL)                  /*!< HS IRQEN: HS1_OL_IEN (Bitfield-Mask: 0x01)            */
#define HS_IRQEN_HS1_OT_IEN_Pos           (5UL)                     /*!< HS IRQEN: HS1_OT_IEN (Bit 5)                          */
#define HS_IRQEN_HS1_OT_IEN_Msk           (0x20UL)                  /*!< HS IRQEN: HS1_OT_IEN (Bitfield-Mask: 0x01)            */
/* =========================================================  IRQS  ========================================================== */
#define HS_IRQS_HS1_OL_STS_Pos            (14UL)                    /*!< HS IRQS: HS1_OL_STS (Bit 14)                          */
#define HS_IRQS_HS1_OL_STS_Msk            (0x4000UL)                /*!< HS IRQS: HS1_OL_STS (Bitfield-Mask: 0x01)             */
#define HS_IRQS_HS1_OT_STS_Pos            (13UL)                    /*!< HS IRQS: HS1_OT_STS (Bit 13)                          */
#define HS_IRQS_HS1_OT_STS_Msk            (0x2000UL)                /*!< HS IRQS: HS1_OT_STS (Bitfield-Mask: 0x01)             */
#define HS_IRQS_HS1_OC_IS_Pos             (7UL)                     /*!< HS IRQS: HS1_OC_IS (Bit 7)                            */
#define HS_IRQS_HS1_OC_IS_Msk             (0x80UL)                  /*!< HS IRQS: HS1_OC_IS (Bitfield-Mask: 0x01)              */
#define HS_IRQS_HS1_OL_IS_Pos             (6UL)                     /*!< HS IRQS: HS1_OL_IS (Bit 6)                            */
#define HS_IRQS_HS1_OL_IS_Msk             (0x40UL)                  /*!< HS IRQS: HS1_OL_IS (Bitfield-Mask: 0x01)              */
#define HS_IRQS_HS1_OT_IS_Pos             (5UL)                     /*!< HS IRQS: HS1_OT_IS (Bit 5)                            */
#define HS_IRQS_HS1_OT_IS_Msk             (0x20UL)                  /*!< HS IRQS: HS1_OT_IS (Bitfield-Mask: 0x01)              */
/* =======================================================  PWMSRCSEL  ======================================================= */
#define HS_PWMSRCSEL_HS1_SRC_SEL_Pos      (3UL)                     /*!< HS PWMSRCSEL: HS1_SRC_SEL (Bit 3)                     */
#define HS_PWMSRCSEL_HS1_SRC_SEL_Msk      (0x38UL)                  /*!< HS PWMSRCSEL: HS1_SRC_SEL (Bitfield-Mask: 0x07)       */
/* =========================================================  TRIM  ========================================================== */
#define HS_TRIM_HS1_OC_OT_BTFILT_SEL_Pos  (8UL)                     /*!< HS TRIM: HS1_OC_OT_BTFILT_SEL (Bit 8)                 */
#define HS_TRIM_HS1_OC_OT_BTFILT_SEL_Msk  (0x300UL)                 /*!< HS TRIM: HS1_OC_OT_BTFILT_SEL (Bitfield-Mask: 0x03)   */
#define HS_TRIM_HS1_OL_BTFILT_SEL_Pos     (0UL)                     /*!< HS TRIM: HS1_OL_BTFILT_SEL (Bit 0)                    */
#define HS_TRIM_HS1_OL_BTFILT_SEL_Msk     (0x3UL)                   /*!< HS TRIM: HS1_OL_BTFILT_SEL (Bitfield-Mask: 0x03)      */


/* =========================================================================================================================== */
/* ================                                            LIN                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
#define LIN_CTRL_HV_MODE_Pos              (21UL)                    /*!< LIN CTRL: HV_MODE (Bit 21)                            */
#define LIN_CTRL_HV_MODE_Msk              (0x200000UL)              /*!< LIN CTRL: HV_MODE (Bitfield-Mask: 0x01)               */
#define LIN_CTRL_FB_SM3_Pos               (15UL)                    /*!< LIN CTRL: FB_SM3 (Bit 15)                             */
#define LIN_CTRL_FB_SM3_Msk               (0x8000UL)                /*!< LIN CTRL: FB_SM3 (Bitfield-Mask: 0x01)                */
#define LIN_CTRL_FB_SM2_Pos               (14UL)                    /*!< LIN CTRL: FB_SM2 (Bit 14)                             */
#define LIN_CTRL_FB_SM2_Msk               (0x4000UL)                /*!< LIN CTRL: FB_SM2 (Bitfield-Mask: 0x01)                */
#define LIN_CTRL_FB_SM1_Pos               (13UL)                    /*!< LIN CTRL: FB_SM1 (Bit 13)                             */
#define LIN_CTRL_FB_SM1_Msk               (0x2000UL)                /*!< LIN CTRL: FB_SM1 (Bitfield-Mask: 0x01)                */
#define LIN_CTRL_SM_Pos                   (11UL)                    /*!< LIN CTRL: SM (Bit 11)                                 */
#define LIN_CTRL_SM_Msk                   (0x1800UL)                /*!< LIN CTRL: SM (Bitfield-Mask: 0x03)                    */
#define LIN_CTRL_RXD_Pos                  (10UL)                    /*!< LIN CTRL: RXD (Bit 10)                                */
#define LIN_CTRL_RXD_Msk                  (0x400UL)                 /*!< LIN CTRL: RXD (Bitfield-Mask: 0x01)                   */
#define LIN_CTRL_TXD_Pos                  (9UL)                     /*!< LIN CTRL: TXD (Bit 9)                                 */
#define LIN_CTRL_TXD_Msk                  (0x200UL)                 /*!< LIN CTRL: TXD (Bitfield-Mask: 0x01)                   */
#define LIN_CTRL_MODE_FB_Pos              (4UL)                     /*!< LIN CTRL: MODE_FB (Bit 4)                             */
#define LIN_CTRL_MODE_FB_Msk              (0x70UL)                  /*!< LIN CTRL: MODE_FB (Bitfield-Mask: 0x07)               */
#define LIN_CTRL_MODE_Pos                 (1UL)                     /*!< LIN CTRL: MODE (Bit 1)                                */
#define LIN_CTRL_MODE_Msk                 (0x6UL)                   /*!< LIN CTRL: MODE (Bitfield-Mask: 0x03)                  */
#define LIN_CTRL_EN_Pos                   (0UL)                     /*!< LIN CTRL: EN (Bit 0)                                  */
#define LIN_CTRL_EN_Msk                   (0x1UL)                   /*!< LIN CTRL: EN (Bitfield-Mask: 0x01)                    */
/* ========================================================  IRQCLR  ========================================================= */
#define LIN_IRQCLR_TXD_TMOUT_SC_Pos       (11UL)                    /*!< LIN IRQCLR: TXD_TMOUT_SC (Bit 11)                     */
#define LIN_IRQCLR_TXD_TMOUT_SC_Msk       (0x800UL)                 /*!< LIN IRQCLR: TXD_TMOUT_SC (Bitfield-Mask: 0x01)        */
#define LIN_IRQCLR_OT_SC_Pos              (9UL)                     /*!< LIN IRQCLR: OT_SC (Bit 9)                             */
#define LIN_IRQCLR_OT_SC_Msk              (0x200UL)                 /*!< LIN IRQCLR: OT_SC (Bitfield-Mask: 0x01)               */
#define LIN_IRQCLR_M_SM_ERR_SC_Pos        (8UL)                     /*!< LIN IRQCLR: M_SM_ERR_SC (Bit 8)                       */
#define LIN_IRQCLR_M_SM_ERR_SC_Msk        (0x100UL)                 /*!< LIN IRQCLR: M_SM_ERR_SC (Bitfield-Mask: 0x01)         */
#define LIN_IRQCLR_TXD_TMOUT_ISC_Pos      (6UL)                     /*!< LIN IRQCLR: TXD_TMOUT_ISC (Bit 6)                     */
#define LIN_IRQCLR_TXD_TMOUT_ISC_Msk      (0x40UL)                  /*!< LIN IRQCLR: TXD_TMOUT_ISC (Bitfield-Mask: 0x01)       */
#define LIN_IRQCLR_OC_ISC_Pos             (5UL)                     /*!< LIN IRQCLR: OC_ISC (Bit 5)                            */
#define LIN_IRQCLR_OC_ISC_Msk             (0x20UL)                  /*!< LIN IRQCLR: OC_ISC (Bitfield-Mask: 0x01)              */
#define LIN_IRQCLR_OT_ISC_Pos             (4UL)                     /*!< LIN IRQCLR: OT_ISC (Bit 4)                            */
#define LIN_IRQCLR_OT_ISC_Msk             (0x10UL)                  /*!< LIN IRQCLR: OT_ISC (Bitfield-Mask: 0x01)              */
#define LIN_IRQCLR_M_SM_ERR_ISC_Pos       (3UL)                     /*!< LIN IRQCLR: M_SM_ERR_ISC (Bit 3)                      */
#define LIN_IRQCLR_M_SM_ERR_ISC_Msk       (0x8UL)                   /*!< LIN IRQCLR: M_SM_ERR_ISC (Bitfield-Mask: 0x01)        */
/* =========================================================  IRQEN  ========================================================= */
#define LIN_IRQEN_TXD_TMOUT_IEN_Pos       (6UL)                     /*!< LIN IRQEN: TXD_TMOUT_IEN (Bit 6)                      */
#define LIN_IRQEN_TXD_TMOUT_IEN_Msk       (0x40UL)                  /*!< LIN IRQEN: TXD_TMOUT_IEN (Bitfield-Mask: 0x01)        */
#define LIN_IRQEN_OC_IEN_Pos              (5UL)                     /*!< LIN IRQEN: OC_IEN (Bit 5)                             */
#define LIN_IRQEN_OC_IEN_Msk              (0x20UL)                  /*!< LIN IRQEN: OC_IEN (Bitfield-Mask: 0x01)               */
#define LIN_IRQEN_OT_IEN_Pos              (4UL)                     /*!< LIN IRQEN: OT_IEN (Bit 4)                             */
#define LIN_IRQEN_OT_IEN_Msk              (0x10UL)                  /*!< LIN IRQEN: OT_IEN (Bitfield-Mask: 0x01)               */
#define LIN_IRQEN_M_SM_ERR_IEN_Pos        (3UL)                     /*!< LIN IRQEN: M_SM_ERR_IEN (Bit 3)                       */
#define LIN_IRQEN_M_SM_ERR_IEN_Msk        (0x8UL)                   /*!< LIN IRQEN: M_SM_ERR_IEN (Bitfield-Mask: 0x01)         */
/* =========================================================  IRQS  ========================================================== */
#define LIN_IRQS_TXD_TMOUT_STS_Pos        (11UL)                    /*!< LIN IRQS: TXD_TMOUT_STS (Bit 11)                      */
#define LIN_IRQS_TXD_TMOUT_STS_Msk        (0x800UL)                 /*!< LIN IRQS: TXD_TMOUT_STS (Bitfield-Mask: 0x01)         */
#define LIN_IRQS_OT_STS_Pos               (9UL)                     /*!< LIN IRQS: OT_STS (Bit 9)                              */
#define LIN_IRQS_OT_STS_Msk               (0x200UL)                 /*!< LIN IRQS: OT_STS (Bitfield-Mask: 0x01)                */
#define LIN_IRQS_M_SM_ERR_STS_Pos         (8UL)                     /*!< LIN IRQS: M_SM_ERR_STS (Bit 8)                        */
#define LIN_IRQS_M_SM_ERR_STS_Msk         (0x100UL)                 /*!< LIN IRQS: M_SM_ERR_STS (Bitfield-Mask: 0x01)          */
#define LIN_IRQS_TXD_TMOUT_IS_Pos         (6UL)                     /*!< LIN IRQS: TXD_TMOUT_IS (Bit 6)                        */
#define LIN_IRQS_TXD_TMOUT_IS_Msk         (0x40UL)                  /*!< LIN IRQS: TXD_TMOUT_IS (Bitfield-Mask: 0x01)          */
#define LIN_IRQS_OC_IS_Pos                (5UL)                     /*!< LIN IRQS: OC_IS (Bit 5)                               */
#define LIN_IRQS_OC_IS_Msk                (0x20UL)                  /*!< LIN IRQS: OC_IS (Bitfield-Mask: 0x01)                 */
#define LIN_IRQS_OT_IS_Pos                (4UL)                     /*!< LIN IRQS: OT_IS (Bit 4)                               */
#define LIN_IRQS_OT_IS_Msk                (0x10UL)                  /*!< LIN IRQS: OT_IS (Bitfield-Mask: 0x01)                 */
#define LIN_IRQS_M_SM_ERR_IS_Pos          (3UL)                     /*!< LIN IRQS: M_SM_ERR_IS (Bit 3)                         */
#define LIN_IRQS_M_SM_ERR_IS_Msk          (0x8UL)                   /*!< LIN IRQS: M_SM_ERR_IS (Bitfield-Mask: 0x01)           */


/* =========================================================================================================================== */
/* ================                                           MATH                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  DIVCON  ========================================================= */
#define MATH_DIVCON_DVSSRC_Pos            (24UL)                    /*!< MATH DIVCON: DVSSRC (Bit 24)                          */
#define MATH_DIVCON_DVSSRC_Msk            (0x1f000000UL)            /*!< MATH DIVCON: DVSSRC (Bitfield-Mask: 0x1f)             */
#define MATH_DIVCON_DVDSLC_Pos            (16UL)                    /*!< MATH DIVCON: DVDSLC (Bit 16)                          */
#define MATH_DIVCON_DVDSLC_Msk            (0x1f0000UL)              /*!< MATH DIVCON: DVDSLC (Bitfield-Mask: 0x1f)             */
#define MATH_DIVCON_QSDIR_Pos             (15UL)                    /*!< MATH DIVCON: QSDIR (Bit 15)                           */
#define MATH_DIVCON_QSDIR_Msk             (0x8000UL)                /*!< MATH DIVCON: QSDIR (Bitfield-Mask: 0x01)              */
#define MATH_DIVCON_QSCNT_Pos             (8UL)                     /*!< MATH DIVCON: QSCNT (Bit 8)                            */
#define MATH_DIVCON_QSCNT_Msk             (0x1f00UL)                /*!< MATH DIVCON: QSCNT (Bitfield-Mask: 0x1f)              */
#define MATH_DIVCON_DIVMODE_Pos           (3UL)                     /*!< MATH DIVCON: DIVMODE (Bit 3)                          */
#define MATH_DIVCON_DIVMODE_Msk           (0x18UL)                  /*!< MATH DIVCON: DIVMODE (Bitfield-Mask: 0x03)            */
#define MATH_DIVCON_USIGN_Pos             (2UL)                     /*!< MATH DIVCON: USIGN (Bit 2)                            */
#define MATH_DIVCON_USIGN_Msk             (0x4UL)                   /*!< MATH DIVCON: USIGN (Bitfield-Mask: 0x01)              */
#define MATH_DIVCON_STMODE_Pos            (1UL)                     /*!< MATH DIVCON: STMODE (Bit 1)                           */
#define MATH_DIVCON_STMODE_Msk            (0x2UL)                   /*!< MATH DIVCON: STMODE (Bitfield-Mask: 0x01)             */
#define MATH_DIVCON_ST_Pos                (0UL)                     /*!< MATH DIVCON: ST (Bit 0)                               */
#define MATH_DIVCON_ST_Msk                (0x1UL)                   /*!< MATH DIVCON: ST (Bitfield-Mask: 0x01)                 */
/* =========================================================  DIVST  ========================================================= */
#define MATH_DIVST_BSY_Pos                (0UL)                     /*!< MATH DIVST: BSY (Bit 0)                               */
#define MATH_DIVST_BSY_Msk                (0x1UL)                   /*!< MATH DIVST: BSY (Bitfield-Mask: 0x01)                 */
/* ==========================================================  DVD  ========================================================== */
#define MATH_DVD_VAL_Pos                  (0UL)                     /*!< MATH DVD: VAL (Bit 0)                                 */
#define MATH_DVD_VAL_Msk                  (0xffffffffUL)            /*!< MATH DVD: VAL (Bitfield-Mask: 0xffffffff)             */
/* ==========================================================  DVS  ========================================================== */
#define MATH_DVS_VAL_Pos                  (0UL)                     /*!< MATH DVS: VAL (Bit 0)                                 */
#define MATH_DVS_VAL_Msk                  (0xffffffffUL)            /*!< MATH DVS: VAL (Bitfield-Mask: 0xffffffff)             */
/* =========================================================  EVFCR  ========================================================= */
#define MATH_EVFCR_DIVERRC_Pos            (1UL)                     /*!< MATH EVFCR: DIVERRC (Bit 1)                           */
#define MATH_EVFCR_DIVERRC_Msk            (0x2UL)                   /*!< MATH EVFCR: DIVERRC (Bitfield-Mask: 0x01)             */
#define MATH_EVFCR_DIVEOCC_Pos            (0UL)                     /*!< MATH EVFCR: DIVEOCC (Bit 0)                           */
#define MATH_EVFCR_DIVEOCC_Msk            (0x1UL)                   /*!< MATH EVFCR: DIVEOCC (Bitfield-Mask: 0x01)             */
/* =========================================================  EVFR  ========================================================== */
#define MATH_EVFR_DIVERR_Pos              (1UL)                     /*!< MATH EVFR: DIVERR (Bit 1)                             */
#define MATH_EVFR_DIVERR_Msk              (0x2UL)                   /*!< MATH EVFR: DIVERR (Bitfield-Mask: 0x01)               */
#define MATH_EVFR_DIVEOC_Pos              (0UL)                     /*!< MATH EVFR: DIVEOC (Bit 0)                             */
#define MATH_EVFR_DIVEOC_Msk              (0x1UL)                   /*!< MATH EVFR: DIVEOC (Bitfield-Mask: 0x01)               */
/* =========================================================  EVIER  ========================================================= */
#define MATH_EVIER_DIVERRIEN_Pos          (1UL)                     /*!< MATH EVIER: DIVERRIEN (Bit 1)                         */
#define MATH_EVIER_DIVERRIEN_Msk          (0x2UL)                   /*!< MATH EVIER: DIVERRIEN (Bitfield-Mask: 0x01)           */
#define MATH_EVIER_DIVEOCIEN_Pos          (0UL)                     /*!< MATH EVIER: DIVEOCIEN (Bit 0)                         */
#define MATH_EVIER_DIVEOCIEN_Msk          (0x1UL)                   /*!< MATH EVIER: DIVEOCIEN (Bitfield-Mask: 0x01)           */
/* =========================================================  EVSFR  ========================================================= */
#define MATH_EVSFR_DIVERRS_Pos            (1UL)                     /*!< MATH EVSFR: DIVERRS (Bit 1)                           */
#define MATH_EVSFR_DIVERRS_Msk            (0x2UL)                   /*!< MATH EVSFR: DIVERRS (Bitfield-Mask: 0x01)             */
#define MATH_EVSFR_DIVEOCS_Pos            (0UL)                     /*!< MATH EVSFR: DIVEOCS (Bit 0)                           */
#define MATH_EVSFR_DIVEOCS_Msk            (0x1UL)                   /*!< MATH EVSFR: DIVEOCS (Bitfield-Mask: 0x01)             */
/* ========================================================  GLBCON  ========================================================= */
#define MATH_GLBCON_MATH_EN_Pos           (31UL)                    /*!< MATH GLBCON: MATH_EN (Bit 31)                         */
#define MATH_GLBCON_MATH_EN_Msk           (0x80000000UL)            /*!< MATH GLBCON: MATH_EN (Bitfield-Mask: 0x01)            */
#define MATH_GLBCON_SUSCFG_Pos            (16UL)                    /*!< MATH GLBCON: SUSCFG (Bit 16)                          */
#define MATH_GLBCON_SUSCFG_Msk            (0x30000UL)               /*!< MATH GLBCON: SUSCFG (Bitfield-Mask: 0x03)             */
#define MATH_GLBCON_DVSRC_Pos             (3UL)                     /*!< MATH GLBCON: DVSRC (Bit 3)                            */
#define MATH_GLBCON_DVSRC_Msk             (0x18UL)                  /*!< MATH GLBCON: DVSRC (Bitfield-Mask: 0x03)              */
#define MATH_GLBCON_DVDRC_Pos             (0UL)                     /*!< MATH GLBCON: DVDRC (Bit 0)                            */
#define MATH_GLBCON_DVDRC_Msk             (0x3UL)                   /*!< MATH GLBCON: DVDRC (Bitfield-Mask: 0x03)              */
/* ========================================================  MATH_ID  ======================================================== */
#define MATH_MATH_ID_MOD_NUMBER_Pos       (16UL)                    /*!< MATH MATH_ID: MOD_NUMBER (Bit 16)                     */
#define MATH_MATH_ID_MOD_NUMBER_Msk       (0xffff0000UL)            /*!< MATH MATH_ID: MOD_NUMBER (Bitfield-Mask: 0xffff)      */
#define MATH_MATH_ID_MOD_TYPE_Pos         (8UL)                     /*!< MATH MATH_ID: MOD_TYPE (Bit 8)                        */
#define MATH_MATH_ID_MOD_TYPE_Msk         (0xff00UL)                /*!< MATH MATH_ID: MOD_TYPE (Bitfield-Mask: 0xff)          */
#define MATH_MATH_ID_MOD_REV_Pos          (0UL)                     /*!< MATH MATH_ID: MOD_REV (Bit 0)                         */
#define MATH_MATH_ID_MOD_REV_Msk          (0xffUL)                  /*!< MATH MATH_ID: MOD_REV (Bitfield-Mask: 0xff)           */
/* =========================================================  QUOT  ========================================================== */
#define MATH_QUOT_VAL_Pos                 (0UL)                     /*!< MATH QUOT: VAL (Bit 0)                                */
#define MATH_QUOT_VAL_Msk                 (0xffffffffUL)            /*!< MATH QUOT: VAL (Bitfield-Mask: 0xffffffff)            */
/* ==========================================================  RMD  ========================================================== */
#define MATH_RMD_VAL_Pos                  (0UL)                     /*!< MATH RMD: VAL (Bit 0)                                 */
#define MATH_RMD_VAL_Msk                  (0xffffffffUL)            /*!< MATH RMD: VAL (Bitfield-Mask: 0xffffffff)             */


