Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
/* =========================================================================================================================== */
/* ================                                            MF                                             ================ */
/* =========================================================================================================================== */

/* =======================================================  CSA_CTRL  ======================================================== */
#define MF_CSA_CTRL_CSA_VZERO_Pos         (8UL)                     /*!< MF CSA_CTRL: CSA_VZERO (Bit 8)                        */
#define MF_CSA_CTRL_CSA_VZERO_Msk         (0x100UL)                 /*!< MF CSA_CTRL: CSA_VZERO (Bitfield-Mask: 0x01)          */
#define MF_CSA_CTRL_CSA_MI_EN_Pos         (4UL)                     /*!< MF CSA_CTRL: CSA_MI_EN (Bit 4)                        */
#define MF_CSA_CTRL_CSA_MI_EN_Msk         (0x10UL)                  /*!< MF CSA_CTRL: CSA_MI_EN (Bitfield-Mask: 0x01)          */
#define MF_CSA_CTRL_CSA_GAIN_Pos          (1UL)                     /*!< MF CSA_CTRL: CSA_GAIN (Bit 1)                         */
#define MF_CSA_CTRL_CSA_GAIN_Msk          (0x6UL)                   /*!< MF CSA_CTRL: CSA_GAIN (Bitfield-Mask: 0x03)           */
#define MF_CSA_CTRL_CSA_EN_Pos            (0UL)                     /*!< MF CSA_CTRL: CSA_EN (Bit 0)                           */
#define MF_CSA_CTRL_CSA_EN_Msk            (0x1UL)                   /*!< MF CSA_CTRL: CSA_EN (Bitfield-Mask: 0x01)             */
/* =======================================================  REF1_STS  ======================================================== */
#define MF_REF1_STS_VREF1V2_UPTHWARN_STS_Pos (5UL)                  /*!< MF REF1_STS: VREF1V2_UPTHWARN_STS (Bit 5)             */
#define MF_REF1_STS_VREF1V2_UPTHWARN_STS_Msk (0x20UL)               /*!< MF REF1_STS: VREF1V2_UPTHWARN_STS (Bitfield-Mask: 0x01) */
#define MF_REF1_STS_VREF1V2_LOTHWARN_STS_Pos (4UL)                  /*!< MF REF1_STS: VREF1V2_LOTHWARN_STS (Bit 4)             */
#define MF_REF1_STS_VREF1V2_LOTHWARN_STS_Msk (0x10UL)               /*!< MF REF1_STS: VREF1V2_LOTHWARN_STS (Bitfield-Mask: 0x01) */


/* =========================================================================================================================== */
/* ================                                            PMU                                            ================ */
/* =========================================================================================================================== */

/* ======================================================  CNF_RST_TFB  ====================================================== */
#define PMU_CNF_RST_TFB_RST_TFB_Pos       (0UL)                     /*!< PMU CNF_RST_TFB: RST_TFB (Bit 0)                      */
#define PMU_CNF_RST_TFB_RST_TFB_Msk       (0x3UL)                   /*!< PMU CNF_RST_TFB: RST_TFB (Bitfield-Mask: 0x03)        */
/* ====================================================  CNF_WAKE_FILTER  ==================================================== */
#define PMU_CNF_WAKE_FILTER_CNF_GPIO_FT_Pos (2UL)                   /*!< PMU CNF_WAKE_FILTER: CNF_GPIO_FT (Bit 2)              */
#define PMU_CNF_WAKE_FILTER_CNF_GPIO_FT_Msk (0xcUL)                 /*!< PMU CNF_WAKE_FILTER: CNF_GPIO_FT (Bitfield-Mask: 0x03) */
#define PMU_CNF_WAKE_FILTER_CNF_MON_FT_Pos (1UL)                    /*!< PMU CNF_WAKE_FILTER: CNF_MON_FT (Bit 1)               */
#define PMU_CNF_WAKE_FILTER_CNF_MON_FT_Msk (0x2UL)                  /*!< PMU CNF_WAKE_FILTER: CNF_MON_FT (Bitfield-Mask: 0x01) */
#define PMU_CNF_WAKE_FILTER_CNF_LIN_FT_Pos (0UL)                    /*!< PMU CNF_WAKE_FILTER: CNF_LIN_FT (Bit 0)               */
#define PMU_CNF_WAKE_FILTER_CNF_LIN_FT_Msk (0x1UL)                  /*!< PMU CNF_WAKE_FILTER: CNF_LIN_FT (Bitfield-Mask: 0x01) */
/* =======================================================  DRV_CTRL  ======================================================== */
#define PMU_DRV_CTRL_CNF_OFF_Pos          (6UL)                     /*!< PMU DRV_CTRL: CNF_OFF (Bit 6)                         */
#define PMU_DRV_CTRL_CNF_OFF_Msk          (0xc0UL)                  /*!< PMU DRV_CTRL: CNF_OFF (Bitfield-Mask: 0x03)           */
#define PMU_DRV_CTRL_CNF_ON_Pos           (4UL)                     /*!< PMU DRV_CTRL: CNF_ON (Bit 4)                          */
#define PMU_DRV_CTRL_CNF_ON_Msk           (0x30UL)                  /*!< PMU DRV_CTRL: CNF_ON (Bitfield-Mask: 0x03)            */
#define PMU_DRV_CTRL_GL2_HOLD_ON_Pos      (3UL)                     /*!< PMU DRV_CTRL: GL2_HOLD_ON (Bit 3)                     */
#define PMU_DRV_CTRL_GL2_HOLD_ON_Msk      (0x8UL)                   /*!< PMU DRV_CTRL: GL2_HOLD_ON (Bitfield-Mask: 0x01)       */
#define PMU_DRV_CTRL_GL2_CYC_ON_Pos       (2UL)                     /*!< PMU DRV_CTRL: GL2_CYC_ON (Bit 2)                      */
#define PMU_DRV_CTRL_GL2_CYC_ON_Msk       (0x4UL)                   /*!< PMU DRV_CTRL: GL2_CYC_ON (Bitfield-Mask: 0x01)        */
#define PMU_DRV_CTRL_GL1_HOLD_ON_Pos      (1UL)                     /*!< PMU DRV_CTRL: GL1_HOLD_ON (Bit 1)                     */
#define PMU_DRV_CTRL_GL1_HOLD_ON_Msk      (0x2UL)                   /*!< PMU DRV_CTRL: GL1_HOLD_ON (Bitfield-Mask: 0x01)       */
#define PMU_DRV_CTRL_GL1_CYC_ON_Pos       (0UL)                     /*!< PMU DRV_CTRL: GL1_CYC_ON (Bit 0)                      */
#define PMU_DRV_CTRL_GL1_CYC_ON_Msk       (0x1UL)                   /*!< PMU DRV_CTRL: GL1_CYC_ON (Bitfield-Mask: 0x01)        */
/* ===================================================  GPIO_WAKE_STATUS  ==================================================== */
#define PMU_GPIO_WAKE_STATUS_GPIO1_STS_4_Pos (12UL)                 /*!< PMU GPIO_WAKE_STATUS: GPIO1_STS_4 (Bit 12)            */
#define PMU_GPIO_WAKE_STATUS_GPIO1_STS_4_Msk (0x1000UL)             /*!< PMU GPIO_WAKE_STATUS: GPIO1_STS_4 (Bitfield-Mask: 0x01) */
#define PMU_GPIO_WAKE_STATUS_GPIO1_STS_2_Pos (10UL)                 /*!< PMU GPIO_WAKE_STATUS: GPIO1_STS_2 (Bit 10)            */
#define PMU_GPIO_WAKE_STATUS_GPIO1_STS_2_Msk (0x400UL)              /*!< PMU GPIO_WAKE_STATUS: GPIO1_STS_2 (Bitfield-Mask: 0x01) */
#define PMU_GPIO_WAKE_STATUS_GPIO1_STS_1_Pos (9UL)                  /*!< PMU GPIO_WAKE_STATUS: GPIO1_STS_1 (Bit 9)             */
#define PMU_GPIO_WAKE_STATUS_GPIO1_STS_1_Msk (0x200UL)              /*!< PMU GPIO_WAKE_STATUS: GPIO1_STS_1 (Bitfield-Mask: 0x01) */
#define PMU_GPIO_WAKE_STATUS_GPIO1_STS_0_Pos (8UL)                  /*!< PMU GPIO_WAKE_STATUS: GPIO1_STS_0 (Bit 8)             */
#define PMU_GPIO_WAKE_STATUS_GPIO1_STS_0_Msk (0x100UL)              /*!< PMU GPIO_WAKE_STATUS: GPIO1_STS_0 (Bitfield-Mask: 0x01) */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_5_Pos (5UL)                  /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_5 (Bit 5)             */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_5_Msk (0x20UL)               /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_5 (Bitfield-Mask: 0x01) */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_4_Pos (4UL)                  /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_4 (Bit 4)             */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_4_Msk (0x10UL)               /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_4 (Bitfield-Mask: 0x01) */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_3_Pos (3UL)                  /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_3 (Bit 3)             */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_3_Msk (0x8UL)                /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_3 (Bitfield-Mask: 0x01) */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_2_Pos (2UL)                  /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_2 (Bit 2)             */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_2_Msk (0x4UL)                /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_2 (Bitfield-Mask: 0x01) */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_1_Pos (1UL)                  /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_1 (Bit 1)             */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_1_Msk (0x2UL)                /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_1 (Bitfield-Mask: 0x01) */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_0_Pos (0UL)                  /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_0 (Bit 0)             */
#define PMU_GPIO_WAKE_STATUS_GPIO0_STS_0_Msk (0x1UL)                /*!< PMU GPIO_WAKE_STATUS: GPIO0_STS_0 (Bitfield-Mask: 0x01) */
/* ======================================================  GPUDATA0to3  ====================================================== */
#define PMU_GPUDATA0to3_DATA3_Pos         (24UL)                    /*!< PMU GPUDATA0to3: DATA3 (Bit 24)                       */
#define PMU_GPUDATA0to3_DATA3_Msk         (0xff000000UL)            /*!< PMU GPUDATA0to3: DATA3 (Bitfield-Mask: 0xff)          */
#define PMU_GPUDATA0to3_DATA2_Pos         (16UL)                    /*!< PMU GPUDATA0to3: DATA2 (Bit 16)                       */
#define PMU_GPUDATA0to3_DATA2_Msk         (0xff0000UL)              /*!< PMU GPUDATA0to3: DATA2 (Bitfield-Mask: 0xff)          */
#define PMU_GPUDATA0to3_DATA1_Pos         (8UL)                     /*!< PMU GPUDATA0to3: DATA1 (Bit 8)                        */
#define PMU_GPUDATA0to3_DATA1_Msk         (0xff00UL)                /*!< PMU GPUDATA0to3: DATA1 (Bitfield-Mask: 0xff)          */
#define PMU_GPUDATA0to3_DATA0_Pos         (0UL)                     /*!< PMU GPUDATA0to3: DATA0 (Bit 0)                        */
#define PMU_GPUDATA0to3_DATA0_Msk         (0xffUL)                  /*!< PMU GPUDATA0to3: DATA0 (Bitfield-Mask: 0xff)          */
/* ======================================================  GPUDATA4to7  ====================================================== */
#define PMU_GPUDATA4to7_DATA7_Pos         (24UL)                    /*!< PMU GPUDATA4to7: DATA7 (Bit 24)                       */
#define PMU_GPUDATA4to7_DATA7_Msk         (0xff000000UL)            /*!< PMU GPUDATA4to7: DATA7 (Bitfield-Mask: 0xff)          */
#define PMU_GPUDATA4to7_DATA6_Pos         (16UL)                    /*!< PMU GPUDATA4to7: DATA6 (Bit 16)                       */
#define PMU_GPUDATA4to7_DATA6_Msk         (0xff0000UL)              /*!< PMU GPUDATA4to7: DATA6 (Bitfield-Mask: 0xff)          */
#define PMU_GPUDATA4to7_DATA5_Pos         (8UL)                     /*!< PMU GPUDATA4to7: DATA5 (Bit 8)                        */
#define PMU_GPUDATA4to7_DATA5_Msk         (0xff00UL)                /*!< PMU GPUDATA4to7: DATA5 (Bitfield-Mask: 0xff)          */
#define PMU_GPUDATA4to7_DATA4_Pos         (0UL)                     /*!< PMU GPUDATA4to7: DATA4 (Bit 0)                        */
#define PMU_GPUDATA4to7_DATA4_Msk         (0xffUL)                  /*!< PMU GPUDATA4to7: DATA4 (Bitfield-Mask: 0xff)          */
/* =====================================================  GPUDATA8to11  ====================================================== */
#define PMU_GPUDATA8to11_DATA11_Pos       (24UL)                    /*!< PMU GPUDATA8to11: DATA11 (Bit 24)                     */
#define PMU_GPUDATA8to11_DATA11_Msk       (0xff000000UL)            /*!< PMU GPUDATA8to11: DATA11 (Bitfield-Mask: 0xff)        */
#define PMU_GPUDATA8to11_DATA10_Pos       (16UL)                    /*!< PMU GPUDATA8to11: DATA10 (Bit 16)                     */
#define PMU_GPUDATA8to11_DATA10_Msk       (0xff0000UL)              /*!< PMU GPUDATA8to11: DATA10 (Bitfield-Mask: 0xff)        */
#define PMU_GPUDATA8to11_DATA9_Pos        (8UL)                     /*!< PMU GPUDATA8to11: DATA9 (Bit 8)                       */
#define PMU_GPUDATA8to11_DATA9_Msk        (0xff00UL)                /*!< PMU GPUDATA8to11: DATA9 (Bitfield-Mask: 0xff)         */
#define PMU_GPUDATA8to11_DATA8_Pos        (0UL)                     /*!< PMU GPUDATA8to11: DATA8 (Bit 0)                       */
#define PMU_GPUDATA8to11_DATA8_Msk        (0xffUL)                  /*!< PMU GPUDATA8to11: DATA8 (Bitfield-Mask: 0xff)         */
/* =====================================================  HIGHSIDE_CTRL  ===================================================== */
#define PMU_HIGHSIDE_CTRL_SPARE_Pos       (10UL)                    /*!< PMU HIGHSIDE_CTRL: SPARE (Bit 10)                     */
#define PMU_HIGHSIDE_CTRL_SPARE_Msk       (0x400UL)                 /*!< PMU HIGHSIDE_CTRL: SPARE (Bitfield-Mask: 0x01)        */
#define PMU_HIGHSIDE_CTRL_HS1_CYC_EN_Pos  (2UL)                     /*!< PMU HIGHSIDE_CTRL: HS1_CYC_EN (Bit 2)                 */
#define PMU_HIGHSIDE_CTRL_HS1_CYC_EN_Msk  (0x4UL)                   /*!< PMU HIGHSIDE_CTRL: HS1_CYC_EN (Bitfield-Mask: 0x01)   */
/* ======================================================  LIN_WAKE_EN  ====================================================== */
#define PMU_LIN_WAKE_EN_LIN_WAKE_EN_Pos   (7UL)                     /*!< PMU LIN_WAKE_EN: LIN_WAKE_EN (Bit 7)                  */
#define PMU_LIN_WAKE_EN_LIN_WAKE_EN_Msk   (0x80UL)                  /*!< PMU LIN_WAKE_EN: LIN_WAKE_EN (Bitfield-Mask: 0x01)    */
/* =======================================================  MON_CNF1  ======================================================== */
#define PMU_MON_CNF1_MON4_STS_Pos         (31UL)                    /*!< PMU MON_CNF1: MON4_STS (Bit 31)                       */
#define PMU_MON_CNF1_MON4_STS_Msk         (0x80000000UL)            /*!< PMU MON_CNF1: MON4_STS (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF1_MON4_NSLEEP_SPARE_Pos (30UL)                   /*!< PMU MON_CNF1: MON4_NSLEEP_SPARE (Bit 30)              */
#define PMU_MON_CNF1_MON4_NSLEEP_SPARE_Msk (0x40000000UL)           /*!< PMU MON_CNF1: MON4_NSLEEP_SPARE (Bitfield-Mask: 0x01) */
#define PMU_MON_CNF1_MON4_PU_Pos          (29UL)                    /*!< PMU MON_CNF1: MON4_PU (Bit 29)                        */
#define PMU_MON_CNF1_MON4_PU_Msk          (0x20000000UL)            /*!< PMU MON_CNF1: MON4_PU (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON4_PD_Pos          (28UL)                    /*!< PMU MON_CNF1: MON4_PD (Bit 28)                        */
#define PMU_MON_CNF1_MON4_PD_Msk          (0x10000000UL)            /*!< PMU MON_CNF1: MON4_PD (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON4_CYC_Pos         (27UL)                    /*!< PMU MON_CNF1: MON4_CYC (Bit 27)                       */
#define PMU_MON_CNF1_MON4_CYC_Msk         (0x8000000UL)             /*!< PMU MON_CNF1: MON4_CYC (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF1_MON4_RISE_Pos        (26UL)                    /*!< PMU MON_CNF1: MON4_RISE (Bit 26)                      */
#define PMU_MON_CNF1_MON4_RISE_Msk        (0x4000000UL)             /*!< PMU MON_CNF1: MON4_RISE (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF1_MON4_FALL_Pos        (25UL)                    /*!< PMU MON_CNF1: MON4_FALL (Bit 25)                      */
#define PMU_MON_CNF1_MON4_FALL_Msk        (0x2000000UL)             /*!< PMU MON_CNF1: MON4_FALL (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF1_MON4_EN_Pos          (24UL)                    /*!< PMU MON_CNF1: MON4_EN (Bit 24)                        */
#define PMU_MON_CNF1_MON4_EN_Msk          (0x1000000UL)             /*!< PMU MON_CNF1: MON4_EN (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON3_STS_Pos         (23UL)                    /*!< PMU MON_CNF1: MON3_STS (Bit 23)                       */
#define PMU_MON_CNF1_MON3_STS_Msk         (0x800000UL)              /*!< PMU MON_CNF1: MON3_STS (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF1_MON3_NSLEEP_SPARE_Pos (22UL)                   /*!< PMU MON_CNF1: MON3_NSLEEP_SPARE (Bit 22)              */
#define PMU_MON_CNF1_MON3_NSLEEP_SPARE_Msk (0x400000UL)             /*!< PMU MON_CNF1: MON3_NSLEEP_SPARE (Bitfield-Mask: 0x01) */
#define PMU_MON_CNF1_MON3_PU_Pos          (21UL)                    /*!< PMU MON_CNF1: MON3_PU (Bit 21)                        */
#define PMU_MON_CNF1_MON3_PU_Msk          (0x200000UL)              /*!< PMU MON_CNF1: MON3_PU (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON3_PD_Pos          (20UL)                    /*!< PMU MON_CNF1: MON3_PD (Bit 20)                        */
#define PMU_MON_CNF1_MON3_PD_Msk          (0x100000UL)              /*!< PMU MON_CNF1: MON3_PD (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON3_CYC_Pos         (19UL)                    /*!< PMU MON_CNF1: MON3_CYC (Bit 19)                       */
#define PMU_MON_CNF1_MON3_CYC_Msk         (0x80000UL)               /*!< PMU MON_CNF1: MON3_CYC (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF1_MON3_RISE_Pos        (18UL)                    /*!< PMU MON_CNF1: MON3_RISE (Bit 18)                      */
#define PMU_MON_CNF1_MON3_RISE_Msk        (0x40000UL)               /*!< PMU MON_CNF1: MON3_RISE (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF1_MON3_FALL_Pos        (17UL)                    /*!< PMU MON_CNF1: MON3_FALL (Bit 17)                      */
#define PMU_MON_CNF1_MON3_FALL_Msk        (0x20000UL)               /*!< PMU MON_CNF1: MON3_FALL (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF1_MON3_EN_Pos          (16UL)                    /*!< PMU MON_CNF1: MON3_EN (Bit 16)                        */
#define PMU_MON_CNF1_MON3_EN_Msk          (0x10000UL)               /*!< PMU MON_CNF1: MON3_EN (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON2_STS_Pos         (15UL)                    /*!< PMU MON_CNF1: MON2_STS (Bit 15)                       */
#define PMU_MON_CNF1_MON2_STS_Msk         (0x8000UL)                /*!< PMU MON_CNF1: MON2_STS (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF1_MON2_NSLEEP_SPARE_Pos (14UL)                   /*!< PMU MON_CNF1: MON2_NSLEEP_SPARE (Bit 14)              */
#define PMU_MON_CNF1_MON2_NSLEEP_SPARE_Msk (0x4000UL)               /*!< PMU MON_CNF1: MON2_NSLEEP_SPARE (Bitfield-Mask: 0x01) */
#define PMU_MON_CNF1_MON2_PU_Pos          (13UL)                    /*!< PMU MON_CNF1: MON2_PU (Bit 13)                        */
#define PMU_MON_CNF1_MON2_PU_Msk          (0x2000UL)                /*!< PMU MON_CNF1: MON2_PU (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON2_PD_Pos          (12UL)                    /*!< PMU MON_CNF1: MON2_PD (Bit 12)                        */
#define PMU_MON_CNF1_MON2_PD_Msk          (0x1000UL)                /*!< PMU MON_CNF1: MON2_PD (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON2_CYC_Pos         (11UL)                    /*!< PMU MON_CNF1: MON2_CYC (Bit 11)                       */
#define PMU_MON_CNF1_MON2_CYC_Msk         (0x800UL)                 /*!< PMU MON_CNF1: MON2_CYC (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF1_MON2_RISE_Pos        (10UL)                    /*!< PMU MON_CNF1: MON2_RISE (Bit 10)                      */
#define PMU_MON_CNF1_MON2_RISE_Msk        (0x400UL)                 /*!< PMU MON_CNF1: MON2_RISE (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF1_MON2_FALL_Pos        (9UL)                     /*!< PMU MON_CNF1: MON2_FALL (Bit 9)                       */
#define PMU_MON_CNF1_MON2_FALL_Msk        (0x200UL)                 /*!< PMU MON_CNF1: MON2_FALL (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF1_MON2_EN_Pos          (8UL)                     /*!< PMU MON_CNF1: MON2_EN (Bit 8)                         */
#define PMU_MON_CNF1_MON2_EN_Msk          (0x100UL)                 /*!< PMU MON_CNF1: MON2_EN (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON1_STS_Pos         (7UL)                     /*!< PMU MON_CNF1: MON1_STS (Bit 7)                        */
#define PMU_MON_CNF1_MON1_STS_Msk         (0x80UL)                  /*!< PMU MON_CNF1: MON1_STS (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF1_MON1_NSLEEP_SPARE_Pos (6UL)                    /*!< PMU MON_CNF1: MON1_NSLEEP_SPARE (Bit 6)               */
#define PMU_MON_CNF1_MON1_NSLEEP_SPARE_Msk (0x40UL)                 /*!< PMU MON_CNF1: MON1_NSLEEP_SPARE (Bitfield-Mask: 0x01) */
#define PMU_MON_CNF1_MON1_PU_Pos          (5UL)                     /*!< PMU MON_CNF1: MON1_PU (Bit 5)                         */
#define PMU_MON_CNF1_MON1_PU_Msk          (0x20UL)                  /*!< PMU MON_CNF1: MON1_PU (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON1_PD_Pos          (4UL)                     /*!< PMU MON_CNF1: MON1_PD (Bit 4)                         */
#define PMU_MON_CNF1_MON1_PD_Msk          (0x10UL)                  /*!< PMU MON_CNF1: MON1_PD (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF1_MON1_CYC_Pos         (3UL)                     /*!< PMU MON_CNF1: MON1_CYC (Bit 3)                        */
#define PMU_MON_CNF1_MON1_CYC_Msk         (0x8UL)                   /*!< PMU MON_CNF1: MON1_CYC (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF1_MON1_RISE_Pos        (2UL)                     /*!< PMU MON_CNF1: MON1_RISE (Bit 2)                       */
#define PMU_MON_CNF1_MON1_RISE_Msk        (0x4UL)                   /*!< PMU MON_CNF1: MON1_RISE (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF1_MON1_FALL_Pos        (1UL)                     /*!< PMU MON_CNF1: MON1_FALL (Bit 1)                       */
#define PMU_MON_CNF1_MON1_FALL_Msk        (0x2UL)                   /*!< PMU MON_CNF1: MON1_FALL (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF1_MON1_EN_Pos          (0UL)                     /*!< PMU MON_CNF1: MON1_EN (Bit 0)                         */
#define PMU_MON_CNF1_MON1_EN_Msk          (0x1UL)                   /*!< PMU MON_CNF1: MON1_EN (Bitfield-Mask: 0x01)           */
/* =======================================================  MON_CNF2  ======================================================== */
#define PMU_MON_CNF2_MON5_STS_Pos         (7UL)                     /*!< PMU MON_CNF2: MON5_STS (Bit 7)                        */
#define PMU_MON_CNF2_MON5_STS_Msk         (0x80UL)                  /*!< PMU MON_CNF2: MON5_STS (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF2_MON5_NSLEEP_SPARE_Pos (6UL)                    /*!< PMU MON_CNF2: MON5_NSLEEP_SPARE (Bit 6)               */
#define PMU_MON_CNF2_MON5_NSLEEP_SPARE_Msk (0x40UL)                 /*!< PMU MON_CNF2: MON5_NSLEEP_SPARE (Bitfield-Mask: 0x01) */
#define PMU_MON_CNF2_MON5_PU_Pos          (5UL)                     /*!< PMU MON_CNF2: MON5_PU (Bit 5)                         */
#define PMU_MON_CNF2_MON5_PU_Msk          (0x20UL)                  /*!< PMU MON_CNF2: MON5_PU (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF2_MON5_PD_Pos          (4UL)                     /*!< PMU MON_CNF2: MON5_PD (Bit 4)                         */
#define PMU_MON_CNF2_MON5_PD_Msk          (0x10UL)                  /*!< PMU MON_CNF2: MON5_PD (Bitfield-Mask: 0x01)           */
#define PMU_MON_CNF2_MON5_CYC_Pos         (3UL)                     /*!< PMU MON_CNF2: MON5_CYC (Bit 3)                        */
#define PMU_MON_CNF2_MON5_CYC_Msk         (0x8UL)                   /*!< PMU MON_CNF2: MON5_CYC (Bitfield-Mask: 0x01)          */
#define PMU_MON_CNF2_MON5_RISE_Pos        (2UL)                     /*!< PMU MON_CNF2: MON5_RISE (Bit 2)                       */
#define PMU_MON_CNF2_MON5_RISE_Msk        (0x4UL)                   /*!< PMU MON_CNF2: MON5_RISE (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF2_MON5_FALL_Pos        (1UL)                     /*!< PMU MON_CNF2: MON5_FALL (Bit 1)                       */
#define PMU_MON_CNF2_MON5_FALL_Msk        (0x2UL)                   /*!< PMU MON_CNF2: MON5_FALL (Bitfield-Mask: 0x01)         */
#define PMU_MON_CNF2_MON5_EN_Pos          (0UL)                     /*!< PMU MON_CNF2: MON5_EN (Bit 0)                         */
#define PMU_MON_CNF2_MON5_EN_Msk          (0x1UL)                   /*!< PMU MON_CNF2: MON5_EN (Bitfield-Mask: 0x01)           */
/* ========================================================  OT_CTRL  ======================================================== */
#define PMU_OT_CTRL_PMU_OT_EN_Pos         (7UL)                     /*!< PMU OT_CTRL: PMU_OT_EN (Bit 7)                        */
#define PMU_OT_CTRL_PMU_OT_EN_Msk         (0x80UL)                  /*!< PMU OT_CTRL: PMU_OT_EN (Bitfield-Mask: 0x01)          */
