Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
#define PMU_OT_CTRL_PMU_OT_WAKE_EN_Pos    (6UL)                     /*!< PMU OT_CTRL: PMU_OT_WAKE_EN (Bit 6)                   */
#define PMU_OT_CTRL_PMU_OT_WAKE_EN_Msk    (0x40UL)                  /*!< PMU OT_CTRL: PMU_OT_WAKE_EN (Bitfield-Mask: 0x01)     */
#define PMU_OT_CTRL_PMU_OT_INT_EN_Pos     (5UL)                     /*!< PMU OT_CTRL: PMU_OT_INT_EN (Bit 5)                    */
#define PMU_OT_CTRL_PMU_OT_INT_EN_Msk     (0x20UL)                  /*!< PMU OT_CTRL: PMU_OT_INT_EN (Bitfield-Mask: 0x01)      */
#define PMU_OT_CTRL_PMU_OT_TH_CNF_Pos     (0UL)                     /*!< PMU OT_CTRL: PMU_OT_TH_CNF (Bit 0)                    */
#define PMU_OT_CTRL_PMU_OT_TH_CNF_Msk     (0xfUL)                   /*!< PMU OT_CTRL: PMU_OT_TH_CNF (Bitfield-Mask: 0x0f)      */
/* ========================================================  PORCFG  ========================================================= */
#define PMU_PORCFG_CNF_FILT_Pos           (0UL)                     /*!< PMU PORCFG: CNF_FILT (Bit 0)                          */
#define PMU_PORCFG_CNF_FILT_Msk           (0x3UL)                   /*!< PMU PORCFG: CNF_FILT (Bitfield-Mask: 0x03)            */
/* =======================================================  RESET_STS  ======================================================= */
#define PMU_RESET_STS_LOCKUP_Pos          (10UL)                    /*!< PMU RESET_STS: LOCKUP (Bit 10)                        */
#define PMU_RESET_STS_LOCKUP_Msk          (0x400UL)                 /*!< PMU RESET_STS: LOCKUP (Bitfield-Mask: 0x01)           */
#define PMU_RESET_STS_PMU_SOFT_Pos        (9UL)                     /*!< PMU RESET_STS: PMU_SOFT (Bit 9)                       */
#define PMU_RESET_STS_PMU_SOFT_Msk        (0x200UL)                 /*!< PMU RESET_STS: PMU_SOFT (Bitfield-Mask: 0x01)         */
#define PMU_RESET_STS_PMU_IntWDT_Pos      (8UL)                     /*!< PMU RESET_STS: PMU_IntWDT (Bit 8)                     */
#define PMU_RESET_STS_PMU_IntWDT_Msk      (0x100UL)                 /*!< PMU RESET_STS: PMU_IntWDT (Bitfield-Mask: 0x01)       */
#define PMU_RESET_STS_PMU_VS_POR_Pos      (7UL)                     /*!< PMU RESET_STS: PMU_VS_POR (Bit 7)                     */
#define PMU_RESET_STS_PMU_VS_POR_Msk      (0x80UL)                  /*!< PMU RESET_STS: PMU_VS_POR (Bitfield-Mask: 0x01)       */
#define PMU_RESET_STS_PMU_PIN_Pos         (6UL)                     /*!< PMU RESET_STS: PMU_PIN (Bit 6)                        */
#define PMU_RESET_STS_PMU_PIN_Msk         (0x40UL)                  /*!< PMU RESET_STS: PMU_PIN (Bitfield-Mask: 0x01)          */
#define PMU_RESET_STS_PMU_ExtWDT_Pos      (5UL)                     /*!< PMU RESET_STS: PMU_ExtWDT (Bit 5)                     */
#define PMU_RESET_STS_PMU_ExtWDT_Msk      (0x20UL)                  /*!< PMU RESET_STS: PMU_ExtWDT (Bitfield-Mask: 0x01)       */
#define PMU_RESET_STS_PMU_ClkWDT_Pos      (4UL)                     /*!< PMU RESET_STS: PMU_ClkWDT (Bit 4)                     */
#define PMU_RESET_STS_PMU_ClkWDT_Msk      (0x10UL)                  /*!< PMU RESET_STS: PMU_ClkWDT (Bitfield-Mask: 0x01)       */
#define PMU_RESET_STS_PMU_LPR_Pos         (3UL)                     /*!< PMU RESET_STS: PMU_LPR (Bit 3)                        */
#define PMU_RESET_STS_PMU_LPR_Msk         (0x8UL)                   /*!< PMU RESET_STS: PMU_LPR (Bitfield-Mask: 0x01)          */
#define PMU_RESET_STS_PMU_SleepEX_Pos     (2UL)                     /*!< PMU RESET_STS: PMU_SleepEX (Bit 2)                    */
#define PMU_RESET_STS_PMU_SleepEX_Msk     (0x4UL)                   /*!< PMU RESET_STS: PMU_SleepEX (Bitfield-Mask: 0x01)      */
#define PMU_RESET_STS_PMU_WAKE_Pos        (1UL)                     /*!< PMU RESET_STS: PMU_WAKE (Bit 1)                       */
#define PMU_RESET_STS_PMU_WAKE_Msk        (0x2UL)                   /*!< PMU RESET_STS: PMU_WAKE (Bitfield-Mask: 0x01)         */
#define PMU_RESET_STS_SYS_FAIL_Pos        (0UL)                     /*!< PMU RESET_STS: SYS_FAIL (Bit 0)                       */
#define PMU_RESET_STS_SYS_FAIL_Msk        (0x1UL)                   /*!< PMU RESET_STS: SYS_FAIL (Bitfield-Mask: 0x01)         */
/* =========================================================  SLEEP  ========================================================= */
#define PMU_SLEEP_CYC_SENSE_S_DEL_Pos     (24UL)                    /*!< PMU SLEEP: CYC_SENSE_S_DEL (Bit 24)                   */
#define PMU_SLEEP_CYC_SENSE_S_DEL_Msk     (0x7000000UL)             /*!< PMU SLEEP: CYC_SENSE_S_DEL (Bitfield-Mask: 0x07)      */
#define PMU_SLEEP_CYC_WAKE_E01_Pos        (20UL)                    /*!< PMU SLEEP: CYC_WAKE_E01 (Bit 20)                      */
#define PMU_SLEEP_CYC_WAKE_E01_Msk        (0x300000UL)              /*!< PMU SLEEP: CYC_WAKE_E01 (Bitfield-Mask: 0x03)         */
#define PMU_SLEEP_CYC_WAKE_M03_Pos        (16UL)                    /*!< PMU SLEEP: CYC_WAKE_M03 (Bit 16)                      */
#define PMU_SLEEP_CYC_WAKE_M03_Msk        (0xf0000UL)               /*!< PMU SLEEP: CYC_WAKE_M03 (Bitfield-Mask: 0x0f)         */
#define PMU_SLEEP_CYC_SENSE_E01_Pos       (12UL)                    /*!< PMU SLEEP: CYC_SENSE_E01 (Bit 12)                     */
#define PMU_SLEEP_CYC_SENSE_E01_Msk       (0x3000UL)                /*!< PMU SLEEP: CYC_SENSE_E01 (Bitfield-Mask: 0x03)        */
#define PMU_SLEEP_CYC_SENSE_M03_Pos       (8UL)                     /*!< PMU SLEEP: CYC_SENSE_M03 (Bit 8)                      */
#define PMU_SLEEP_CYC_SENSE_M03_Msk       (0xf00UL)                 /*!< PMU SLEEP: CYC_SENSE_M03 (Bitfield-Mask: 0x0f)        */
#define PMU_SLEEP_CYC_SENSE_EN_Pos        (3UL)                     /*!< PMU SLEEP: CYC_SENSE_EN (Bit 3)                       */
#define PMU_SLEEP_CYC_SENSE_EN_Msk        (0x8UL)                   /*!< PMU SLEEP: CYC_SENSE_EN (Bitfield-Mask: 0x01)         */
#define PMU_SLEEP_CYC_WAKE_EN_Pos         (2UL)                     /*!< PMU SLEEP: CYC_WAKE_EN (Bit 2)                        */
#define PMU_SLEEP_CYC_WAKE_EN_Msk         (0x4UL)                   /*!< PMU SLEEP: CYC_WAKE_EN (Bitfield-Mask: 0x01)          */
#define PMU_SLEEP_EN_0V9_N_Pos            (1UL)                     /*!< PMU SLEEP: EN_0V9_N (Bit 1)                           */
#define PMU_SLEEP_EN_0V9_N_Msk            (0x2UL)                   /*!< PMU SLEEP: EN_0V9_N (Bitfield-Mask: 0x01)             */
#define PMU_SLEEP_WAKE_W_RST_Pos          (0UL)                     /*!< PMU SLEEP: WAKE_W_RST (Bit 0)                         */
#define PMU_SLEEP_WAKE_W_RST_Msk          (0x1UL)                   /*!< PMU SLEEP: WAKE_W_RST (Bitfield-Mask: 0x01)           */
/* ======================================================  SUPPLY_STS  ======================================================= */
#define PMU_SUPPLY_STS_PMU_5V_OVERLOAD_SC_Pos (13UL)                /*!< PMU SUPPLY_STS: PMU_5V_OVERLOAD_SC (Bit 13)           */
#define PMU_SUPPLY_STS_PMU_5V_OVERLOAD_SC_Msk (0x2000UL)            /*!< PMU SUPPLY_STS: PMU_5V_OVERLOAD_SC (Bitfield-Mask: 0x01) */
#define PMU_SUPPLY_STS_PMU_5V_OVERVOLT_SC_Pos (12UL)                /*!< PMU SUPPLY_STS: PMU_5V_OVERVOLT_SC (Bit 12)           */
#define PMU_SUPPLY_STS_PMU_5V_OVERVOLT_SC_Msk (0x1000UL)            /*!< PMU SUPPLY_STS: PMU_5V_OVERVOLT_SC (Bitfield-Mask: 0x01) */
#define PMU_SUPPLY_STS_PMU_OVERTEMP_SC_Pos (11UL)                   /*!< PMU SUPPLY_STS: PMU_OVERTEMP_SC (Bit 11)              */
#define PMU_SUPPLY_STS_PMU_OVERTEMP_SC_Msk (0x800UL)                /*!< PMU SUPPLY_STS: PMU_OVERTEMP_SC (Bitfield-Mask: 0x01) */
#define PMU_SUPPLY_STS_PMU_1V5_OVERLOAD_SC_Pos (9UL)                /*!< PMU SUPPLY_STS: PMU_1V5_OVERLOAD_SC (Bit 9)           */
#define PMU_SUPPLY_STS_PMU_1V5_OVERLOAD_SC_Msk (0x200UL)            /*!< PMU SUPPLY_STS: PMU_1V5_OVERLOAD_SC (Bitfield-Mask: 0x01) */
#define PMU_SUPPLY_STS_PMU_1V5_OVERVOLT_SC_Pos (8UL)                /*!< PMU SUPPLY_STS: PMU_1V5_OVERVOLT_SC (Bit 8)           */
#define PMU_SUPPLY_STS_PMU_1V5_OVERVOLT_SC_Msk (0x100UL)            /*!< PMU SUPPLY_STS: PMU_1V5_OVERVOLT_SC (Bitfield-Mask: 0x01) */
#define PMU_SUPPLY_STS_PMU_5V_FAIL_EN_Pos (6UL)                     /*!< PMU SUPPLY_STS: PMU_5V_FAIL_EN (Bit 6)                */
#define PMU_SUPPLY_STS_PMU_5V_FAIL_EN_Msk (0x40UL)                  /*!< PMU SUPPLY_STS: PMU_5V_FAIL_EN (Bitfield-Mask: 0x01)  */
#define PMU_SUPPLY_STS_PMU_5V_OVERLOAD_Pos (5UL)                    /*!< PMU SUPPLY_STS: PMU_5V_OVERLOAD (Bit 5)               */
#define PMU_SUPPLY_STS_PMU_5V_OVERLOAD_Msk (0x20UL)                 /*!< PMU SUPPLY_STS: PMU_5V_OVERLOAD (Bitfield-Mask: 0x01) */
#define PMU_SUPPLY_STS_PMU_5V_OVERVOLT_Pos (4UL)                    /*!< PMU SUPPLY_STS: PMU_5V_OVERVOLT (Bit 4)               */
#define PMU_SUPPLY_STS_PMU_5V_OVERVOLT_Msk (0x10UL)                 /*!< PMU SUPPLY_STS: PMU_5V_OVERVOLT (Bitfield-Mask: 0x01) */
#define PMU_SUPPLY_STS_PMU_OVERTEMP_Pos   (3UL)                     /*!< PMU SUPPLY_STS: PMU_OVERTEMP (Bit 3)                  */
#define PMU_SUPPLY_STS_PMU_OVERTEMP_Msk   (0x8UL)                   /*!< PMU SUPPLY_STS: PMU_OVERTEMP (Bitfield-Mask: 0x01)    */
#define PMU_SUPPLY_STS_PMU_1V5_FAIL_EN_Pos (2UL)                    /*!< PMU SUPPLY_STS: PMU_1V5_FAIL_EN (Bit 2)               */
#define PMU_SUPPLY_STS_PMU_1V5_FAIL_EN_Msk (0x4UL)                  /*!< PMU SUPPLY_STS: PMU_1V5_FAIL_EN (Bitfield-Mask: 0x01) */
#define PMU_SUPPLY_STS_PMU_1V5_OVERLOAD_Pos (1UL)                   /*!< PMU SUPPLY_STS: PMU_1V5_OVERLOAD (Bit 1)              */
#define PMU_SUPPLY_STS_PMU_1V5_OVERLOAD_Msk (0x2UL)                 /*!< PMU SUPPLY_STS: PMU_1V5_OVERLOAD (Bitfield-Mask: 0x01) */
#define PMU_SUPPLY_STS_PMU_1V5_OVERVOLT_Pos (0UL)                   /*!< PMU SUPPLY_STS: PMU_1V5_OVERVOLT (Bit 0)              */
#define PMU_SUPPLY_STS_PMU_1V5_OVERVOLT_Msk (0x1UL)                 /*!< PMU SUPPLY_STS: PMU_1V5_OVERVOLT (Bitfield-Mask: 0x01) */
/* ======================================================  VDDEXT_CTRL  ====================================================== */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_SC_Pos  (13UL)                    /*!< PMU VDDEXT_CTRL: VDDEXT_OT_SC (Bit 13)                */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_SC_Msk  (0x2000UL)                /*!< PMU VDDEXT_CTRL: VDDEXT_OT_SC (Bitfield-Mask: 0x01)   */
#define PMU_VDDEXT_CTRL_VDDEXT_UV_ISC_Pos (12UL)                    /*!< PMU VDDEXT_CTRL: VDDEXT_UV_ISC (Bit 12)               */
#define PMU_VDDEXT_CTRL_VDDEXT_UV_ISC_Msk (0x1000UL)                /*!< PMU VDDEXT_CTRL: VDDEXT_UV_ISC (Bitfield-Mask: 0x01)  */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_ISC_Pos (11UL)                    /*!< PMU VDDEXT_CTRL: VDDEXT_OT_ISC (Bit 11)               */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_ISC_Msk (0x800UL)                 /*!< PMU VDDEXT_CTRL: VDDEXT_OT_ISC (Bitfield-Mask: 0x01)  */
#define PMU_VDDEXT_CTRL_VDDEXT_STABLE_Pos (7UL)                     /*!< PMU VDDEXT_CTRL: VDDEXT_STABLE (Bit 7)                */
#define PMU_VDDEXT_CTRL_VDDEXT_STABLE_Msk (0x80UL)                  /*!< PMU VDDEXT_CTRL: VDDEXT_STABLE (Bitfield-Mask: 0x01)  */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_Pos     (6UL)                     /*!< PMU VDDEXT_CTRL: VDDEXT_OT (Bit 6)                    */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_Msk     (0x40UL)                  /*!< PMU VDDEXT_CTRL: VDDEXT_OT (Bitfield-Mask: 0x01)      */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_STS_Pos (5UL)                     /*!< PMU VDDEXT_CTRL: VDDEXT_OT_STS (Bit 5)                */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_STS_Msk (0x20UL)                  /*!< PMU VDDEXT_CTRL: VDDEXT_OT_STS (Bitfield-Mask: 0x01)  */
#define PMU_VDDEXT_CTRL_VDDEXT_UV_IS_Pos  (4UL)                     /*!< PMU VDDEXT_CTRL: VDDEXT_UV_IS (Bit 4)                 */
#define PMU_VDDEXT_CTRL_VDDEXT_UV_IS_Msk  (0x10UL)                  /*!< PMU VDDEXT_CTRL: VDDEXT_UV_IS (Bitfield-Mask: 0x01)   */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_IS_Pos  (3UL)                     /*!< PMU VDDEXT_CTRL: VDDEXT_OT_IS (Bit 3)                 */
#define PMU_VDDEXT_CTRL_VDDEXT_OT_IS_Msk  (0x8UL)                   /*!< PMU VDDEXT_CTRL: VDDEXT_OT_IS (Bitfield-Mask: 0x01)   */
#define PMU_VDDEXT_CTRL_VDDEXT_FAIL_EN_Pos (2UL)                    /*!< PMU VDDEXT_CTRL: VDDEXT_FAIL_EN (Bit 2)               */
#define PMU_VDDEXT_CTRL_VDDEXT_FAIL_EN_Msk (0x4UL)                  /*!< PMU VDDEXT_CTRL: VDDEXT_FAIL_EN (Bitfield-Mask: 0x01) */
#define PMU_VDDEXT_CTRL_VDDEXT_CYC_EN_Pos (1UL)                     /*!< PMU VDDEXT_CTRL: VDDEXT_CYC_EN (Bit 1)                */
#define PMU_VDDEXT_CTRL_VDDEXT_CYC_EN_Msk (0x2UL)                   /*!< PMU VDDEXT_CTRL: VDDEXT_CYC_EN (Bitfield-Mask: 0x01)  */
#define PMU_VDDEXT_CTRL_VDDEXT_ENABLE_Pos (0UL)                     /*!< PMU VDDEXT_CTRL: VDDEXT_ENABLE (Bit 0)                */
#define PMU_VDDEXT_CTRL_VDDEXT_ENABLE_Msk (0x1UL)                   /*!< PMU VDDEXT_CTRL: VDDEXT_ENABLE (Bitfield-Mask: 0x01)  */
/* ====================================================  WAKE_CNF_GPIO0  ===================================================== */
#define PMU_WAKE_CNF_GPIO0_CYC_5_Pos      (21UL)                    /*!< PMU WAKE_CNF_GPIO0: CYC_5 (Bit 21)                    */
#define PMU_WAKE_CNF_GPIO0_CYC_5_Msk      (0x200000UL)              /*!< PMU WAKE_CNF_GPIO0: CYC_5 (Bitfield-Mask: 0x01)       */
#define PMU_WAKE_CNF_GPIO0_CYC_4_Pos      (20UL)                    /*!< PMU WAKE_CNF_GPIO0: CYC_4 (Bit 20)                    */
#define PMU_WAKE_CNF_GPIO0_CYC_4_Msk      (0x100000UL)              /*!< PMU WAKE_CNF_GPIO0: CYC_4 (Bitfield-Mask: 0x01)       */
#define PMU_WAKE_CNF_GPIO0_CYC_3_Pos      (19UL)                    /*!< PMU WAKE_CNF_GPIO0: CYC_3 (Bit 19)                    */
#define PMU_WAKE_CNF_GPIO0_CYC_3_Msk      (0x80000UL)               /*!< PMU WAKE_CNF_GPIO0: CYC_3 (Bitfield-Mask: 0x01)       */
#define PMU_WAKE_CNF_GPIO0_CYC_2_Pos      (18UL)                    /*!< PMU WAKE_CNF_GPIO0: CYC_2 (Bit 18)                    */
#define PMU_WAKE_CNF_GPIO0_CYC_2_Msk      (0x40000UL)               /*!< PMU WAKE_CNF_GPIO0: CYC_2 (Bitfield-Mask: 0x01)       */
#define PMU_WAKE_CNF_GPIO0_CYC_1_Pos      (17UL)                    /*!< PMU WAKE_CNF_GPIO0: CYC_1 (Bit 17)                    */
#define PMU_WAKE_CNF_GPIO0_CYC_1_Msk      (0x20000UL)               /*!< PMU WAKE_CNF_GPIO0: CYC_1 (Bitfield-Mask: 0x01)       */
#define PMU_WAKE_CNF_GPIO0_CYC_0_Pos      (16UL)                    /*!< PMU WAKE_CNF_GPIO0: CYC_0 (Bit 16)                    */
#define PMU_WAKE_CNF_GPIO0_CYC_0_Msk      (0x10000UL)               /*!< PMU WAKE_CNF_GPIO0: CYC_0 (Bitfield-Mask: 0x01)       */
#define PMU_WAKE_CNF_GPIO0_FA_5_Pos       (13UL)                    /*!< PMU WAKE_CNF_GPIO0: FA_5 (Bit 13)                     */
#define PMU_WAKE_CNF_GPIO0_FA_5_Msk       (0x2000UL)                /*!< PMU WAKE_CNF_GPIO0: FA_5 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO0_FA_4_Pos       (12UL)                    /*!< PMU WAKE_CNF_GPIO0: FA_4 (Bit 12)                     */
#define PMU_WAKE_CNF_GPIO0_FA_4_Msk       (0x1000UL)                /*!< PMU WAKE_CNF_GPIO0: FA_4 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO0_FA_3_Pos       (11UL)                    /*!< PMU WAKE_CNF_GPIO0: FA_3 (Bit 11)                     */
#define PMU_WAKE_CNF_GPIO0_FA_3_Msk       (0x800UL)                 /*!< PMU WAKE_CNF_GPIO0: FA_3 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO0_FA_2_Pos       (10UL)                    /*!< PMU WAKE_CNF_GPIO0: FA_2 (Bit 10)                     */
#define PMU_WAKE_CNF_GPIO0_FA_2_Msk       (0x400UL)                 /*!< PMU WAKE_CNF_GPIO0: FA_2 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO0_FA_1_Pos       (9UL)                     /*!< PMU WAKE_CNF_GPIO0: FA_1 (Bit 9)                      */
#define PMU_WAKE_CNF_GPIO0_FA_1_Msk       (0x200UL)                 /*!< PMU WAKE_CNF_GPIO0: FA_1 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO0_FA_0_Pos       (8UL)                     /*!< PMU WAKE_CNF_GPIO0: FA_0 (Bit 8)                      */
#define PMU_WAKE_CNF_GPIO0_FA_0_Msk       (0x100UL)                 /*!< PMU WAKE_CNF_GPIO0: FA_0 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO0_RI_5_Pos       (5UL)                     /*!< PMU WAKE_CNF_GPIO0: RI_5 (Bit 5)                      */
#define PMU_WAKE_CNF_GPIO0_RI_5_Msk       (0x20UL)                  /*!< PMU WAKE_CNF_GPIO0: RI_5 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO0_RI_4_Pos       (4UL)                     /*!< PMU WAKE_CNF_GPIO0: RI_4 (Bit 4)                      */
#define PMU_WAKE_CNF_GPIO0_RI_4_Msk       (0x10UL)                  /*!< PMU WAKE_CNF_GPIO0: RI_4 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO0_RI_3_Pos       (3UL)                     /*!< PMU WAKE_CNF_GPIO0: RI_3 (Bit 3)                      */
#define PMU_WAKE_CNF_GPIO0_RI_3_Msk       (0x8UL)                   /*!< PMU WAKE_CNF_GPIO0: RI_3 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO0_RI_2_Pos       (2UL)                     /*!< PMU WAKE_CNF_GPIO0: RI_2 (Bit 2)                      */
#define PMU_WAKE_CNF_GPIO0_RI_2_Msk       (0x4UL)                   /*!< PMU WAKE_CNF_GPIO0: RI_2 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO0_RI_1_Pos       (1UL)                     /*!< PMU WAKE_CNF_GPIO0: RI_1 (Bit 1)                      */
#define PMU_WAKE_CNF_GPIO0_RI_1_Msk       (0x2UL)                   /*!< PMU WAKE_CNF_GPIO0: RI_1 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO0_RI_0_Pos       (0UL)                     /*!< PMU WAKE_CNF_GPIO0: RI_0 (Bit 0)                      */
#define PMU_WAKE_CNF_GPIO0_RI_0_Msk       (0x1UL)                   /*!< PMU WAKE_CNF_GPIO0: RI_0 (Bitfield-Mask: 0x01)        */
/* ====================================================  WAKE_CNF_GPIO1  ===================================================== */
#define PMU_WAKE_CNF_GPIO1_CYC_4_Pos      (20UL)                    /*!< PMU WAKE_CNF_GPIO1: CYC_4 (Bit 20)                    */
#define PMU_WAKE_CNF_GPIO1_CYC_4_Msk      (0x100000UL)              /*!< PMU WAKE_CNF_GPIO1: CYC_4 (Bitfield-Mask: 0x01)       */
#define PMU_WAKE_CNF_GPIO1_CYC_2_Pos      (18UL)                    /*!< PMU WAKE_CNF_GPIO1: CYC_2 (Bit 18)                    */
#define PMU_WAKE_CNF_GPIO1_CYC_2_Msk      (0x40000UL)               /*!< PMU WAKE_CNF_GPIO1: CYC_2 (Bitfield-Mask: 0x01)       */
#define PMU_WAKE_CNF_GPIO1_CYC_1_Pos      (17UL)                    /*!< PMU WAKE_CNF_GPIO1: CYC_1 (Bit 17)                    */
#define PMU_WAKE_CNF_GPIO1_CYC_1_Msk      (0x20000UL)               /*!< PMU WAKE_CNF_GPIO1: CYC_1 (Bitfield-Mask: 0x01)       */
#define PMU_WAKE_CNF_GPIO1_CYC_0_Pos      (16UL)                    /*!< PMU WAKE_CNF_GPIO1: CYC_0 (Bit 16)                    */
#define PMU_WAKE_CNF_GPIO1_CYC_0_Msk      (0x10000UL)               /*!< PMU WAKE_CNF_GPIO1: CYC_0 (Bitfield-Mask: 0x01)       */
#define PMU_WAKE_CNF_GPIO1_FA_4_Pos       (12UL)                    /*!< PMU WAKE_CNF_GPIO1: FA_4 (Bit 12)                     */
#define PMU_WAKE_CNF_GPIO1_FA_4_Msk       (0x1000UL)                /*!< PMU WAKE_CNF_GPIO1: FA_4 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO1_FA_2_Pos       (10UL)                    /*!< PMU WAKE_CNF_GPIO1: FA_2 (Bit 10)                     */
#define PMU_WAKE_CNF_GPIO1_FA_2_Msk       (0x400UL)                 /*!< PMU WAKE_CNF_GPIO1: FA_2 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO1_FA_1_Pos       (9UL)                     /*!< PMU WAKE_CNF_GPIO1: FA_1 (Bit 9)                      */
#define PMU_WAKE_CNF_GPIO1_FA_1_Msk       (0x200UL)                 /*!< PMU WAKE_CNF_GPIO1: FA_1 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO1_FA_0_Pos       (8UL)                     /*!< PMU WAKE_CNF_GPIO1: FA_0 (Bit 8)                      */
#define PMU_WAKE_CNF_GPIO1_FA_0_Msk       (0x100UL)                 /*!< PMU WAKE_CNF_GPIO1: FA_0 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO1_RI_4_Pos       (4UL)                     /*!< PMU WAKE_CNF_GPIO1: RI_4 (Bit 4)                      */
#define PMU_WAKE_CNF_GPIO1_RI_4_Msk       (0x10UL)                  /*!< PMU WAKE_CNF_GPIO1: RI_4 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO1_RI_2_Pos       (2UL)                     /*!< PMU WAKE_CNF_GPIO1: RI_2 (Bit 2)                      */
#define PMU_WAKE_CNF_GPIO1_RI_2_Msk       (0x4UL)                   /*!< PMU WAKE_CNF_GPIO1: RI_2 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO1_RI_1_Pos       (1UL)                     /*!< PMU WAKE_CNF_GPIO1: RI_1 (Bit 1)                      */
#define PMU_WAKE_CNF_GPIO1_RI_1_Msk       (0x2UL)                   /*!< PMU WAKE_CNF_GPIO1: RI_1 (Bitfield-Mask: 0x01)        */
#define PMU_WAKE_CNF_GPIO1_RI_0_Pos       (0UL)                     /*!< PMU WAKE_CNF_GPIO1: RI_0 (Bit 0)                      */
#define PMU_WAKE_CNF_GPIO1_RI_0_Msk       (0x1UL)                   /*!< PMU WAKE_CNF_GPIO1: RI_0 (Bitfield-Mask: 0x01)        */
/* ======================================================  WAKE_STATUS  ====================================================== */
#define PMU_WAKE_STATUS_VDDEXT_UV_Pos     (18UL)                    /*!< PMU WAKE_STATUS: VDDEXT_UV (Bit 18)                   */
#define PMU_WAKE_STATUS_VDDEXT_UV_Msk     (0x40000UL)               /*!< PMU WAKE_STATUS: VDDEXT_UV (Bitfield-Mask: 0x01)      */
#define PMU_WAKE_STATUS_VDDEXT_OT_Pos     (17UL)                    /*!< PMU WAKE_STATUS: VDDEXT_OT (Bit 17)                   */
#define PMU_WAKE_STATUS_VDDEXT_OT_Msk     (0x20000UL)               /*!< PMU WAKE_STATUS: VDDEXT_OT (Bitfield-Mask: 0x01)      */
#define PMU_WAKE_STATUS_PMU_OT_Pos        (16UL)                    /*!< PMU WAKE_STATUS: PMU_OT (Bit 16)                      */
#define PMU_WAKE_STATUS_PMU_OT_Msk        (0x10000UL)               /*!< PMU WAKE_STATUS: PMU_OT (Bitfield-Mask: 0x01)         */
#define PMU_WAKE_STATUS_MON5_WAKE_STS_Pos (12UL)                    /*!< PMU WAKE_STATUS: MON5_WAKE_STS (Bit 12)               */
#define PMU_WAKE_STATUS_MON5_WAKE_STS_Msk (0x1000UL)                /*!< PMU WAKE_STATUS: MON5_WAKE_STS (Bitfield-Mask: 0x01)  */
#define PMU_WAKE_STATUS_MON4_WAKE_STS_Pos (11UL)                    /*!< PMU WAKE_STATUS: MON4_WAKE_STS (Bit 11)               */
#define PMU_WAKE_STATUS_MON4_WAKE_STS_Msk (0x800UL)                 /*!< PMU WAKE_STATUS: MON4_WAKE_STS (Bitfield-Mask: 0x01)  */
#define PMU_WAKE_STATUS_MON3_WAKE_STS_Pos (10UL)                    /*!< PMU WAKE_STATUS: MON3_WAKE_STS (Bit 10)               */
#define PMU_WAKE_STATUS_MON3_WAKE_STS_Msk (0x400UL)                 /*!< PMU WAKE_STATUS: MON3_WAKE_STS (Bitfield-Mask: 0x01)  */
#define PMU_WAKE_STATUS_MON2_WAKE_STS_Pos (9UL)                     /*!< PMU WAKE_STATUS: MON2_WAKE_STS (Bit 9)                */
#define PMU_WAKE_STATUS_MON2_WAKE_STS_Msk (0x200UL)                 /*!< PMU WAKE_STATUS: MON2_WAKE_STS (Bitfield-Mask: 0x01)  */
#define PMU_WAKE_STATUS_MON1_WAKE_STS_Pos (8UL)                     /*!< PMU WAKE_STATUS: MON1_WAKE_STS (Bit 8)                */
#define PMU_WAKE_STATUS_MON1_WAKE_STS_Msk (0x100UL)                 /*!< PMU WAKE_STATUS: MON1_WAKE_STS (Bitfield-Mask: 0x01)  */
#define PMU_WAKE_STATUS_GPIO2_Pos         (6UL)                     /*!< PMU WAKE_STATUS: GPIO2 (Bit 6)                        */
#define PMU_WAKE_STATUS_GPIO2_Msk         (0x40UL)                  /*!< PMU WAKE_STATUS: GPIO2 (Bitfield-Mask: 0x01)          */
#define PMU_WAKE_STATUS_FAIL_Pos          (5UL)                     /*!< PMU WAKE_STATUS: FAIL (Bit 5)                         */
#define PMU_WAKE_STATUS_FAIL_Msk          (0x20UL)                  /*!< PMU WAKE_STATUS: FAIL (Bitfield-Mask: 0x01)           */
#define PMU_WAKE_STATUS_CYC_WAKE_Pos      (4UL)                     /*!< PMU WAKE_STATUS: CYC_WAKE (Bit 4)                     */
#define PMU_WAKE_STATUS_CYC_WAKE_Msk      (0x10UL)                  /*!< PMU WAKE_STATUS: CYC_WAKE (Bitfield-Mask: 0x01)       */
