Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
#define PMU_WAKE_STATUS_GPIO1_Pos         (3UL)                     /*!< PMU WAKE_STATUS: GPIO1 (Bit 3)                        */
#define PMU_WAKE_STATUS_GPIO1_Msk         (0x8UL)                   /*!< PMU WAKE_STATUS: GPIO1 (Bitfield-Mask: 0x01)          */
#define PMU_WAKE_STATUS_GPIO0_Pos         (2UL)                     /*!< PMU WAKE_STATUS: GPIO0 (Bit 2)                        */
#define PMU_WAKE_STATUS_GPIO0_Msk         (0x4UL)                   /*!< PMU WAKE_STATUS: GPIO0 (Bitfield-Mask: 0x01)          */
#define PMU_WAKE_STATUS_MON_Pos           (1UL)                     /*!< PMU WAKE_STATUS: MON (Bit 1)                          */
#define PMU_WAKE_STATUS_MON_Msk           (0x2UL)                   /*!< PMU WAKE_STATUS: MON (Bitfield-Mask: 0x01)            */
#define PMU_WAKE_STATUS_LIN_WAKE_Pos      (0UL)                     /*!< PMU WAKE_STATUS: LIN_WAKE (Bit 0)                     */
#define PMU_WAKE_STATUS_LIN_WAKE_Msk      (0x1UL)                   /*!< PMU WAKE_STATUS: LIN_WAKE (Bitfield-Mask: 0x01)       */
/* ==========================================================  WFS  ========================================================== */
#define PMU_WFS_PMU_OT_FAIL_Pos           (8UL)                     /*!< PMU WFS: PMU_OT_FAIL (Bit 8)                          */
#define PMU_WFS_PMU_OT_FAIL_Msk           (0x100UL)                 /*!< PMU WFS: PMU_OT_FAIL (Bitfield-Mask: 0x01)            */
#define PMU_WFS_LP_CLKWD_Pos              (7UL)                     /*!< PMU WFS: LP_CLKWD (Bit 7)                             */
#define PMU_WFS_LP_CLKWD_Msk              (0x80UL)                  /*!< PMU WFS: LP_CLKWD (Bitfield-Mask: 0x01)               */
#define PMU_WFS_WDT1_SEQ_FAIL_Pos         (6UL)                     /*!< PMU WFS: WDT1_SEQ_FAIL (Bit 6)                        */
#define PMU_WFS_WDT1_SEQ_FAIL_Msk         (0x40UL)                  /*!< PMU WFS: WDT1_SEQ_FAIL (Bitfield-Mask: 0x01)          */
#define PMU_WFS_SYS_OT_Pos                (5UL)                     /*!< PMU WFS: SYS_OT (Bit 5)                               */
#define PMU_WFS_SYS_OT_Msk                (0x20UL)                  /*!< PMU WFS: SYS_OT (Bitfield-Mask: 0x01)                 */
#define PMU_WFS_SYS_CLK_WDT_Pos           (4UL)                     /*!< PMU WFS: SYS_CLK_WDT (Bit 4)                          */
#define PMU_WFS_SYS_CLK_WDT_Msk           (0x10UL)                  /*!< PMU WFS: SYS_CLK_WDT (Bitfield-Mask: 0x01)            */
#define PMU_WFS_PMU_5V_OVL_Pos            (3UL)                     /*!< PMU WFS: PMU_5V_OVL (Bit 3)                           */
#define PMU_WFS_PMU_5V_OVL_Msk            (0x8UL)                   /*!< PMU WFS: PMU_5V_OVL (Bitfield-Mask: 0x01)             */
#define PMU_WFS_PMU_1V5_OVL_Pos           (2UL)                     /*!< PMU WFS: PMU_1V5_OVL (Bit 2)                          */
#define PMU_WFS_PMU_1V5_OVL_Msk           (0x4UL)                   /*!< PMU WFS: PMU_1V5_OVL (Bitfield-Mask: 0x01)            */
#define PMU_WFS_SUPP_TMOUT_Pos            (1UL)                     /*!< PMU WFS: SUPP_TMOUT (Bit 1)                           */
#define PMU_WFS_SUPP_TMOUT_Msk            (0x2UL)                   /*!< PMU WFS: SUPP_TMOUT (Bitfield-Mask: 0x01)             */
#define PMU_WFS_SUPP_SHORT_Pos            (0UL)                     /*!< PMU WFS: SUPP_SHORT (Bit 0)                           */
#define PMU_WFS_SUPP_SHORT_Msk            (0x1UL)                   /*!< PMU WFS: SUPP_SHORT (Bitfield-Mask: 0x01)             */


/* =========================================================================================================================== */
/* ================                                           PORT                                            ================ */
/* =========================================================================================================================== */

/* ======================================================  P0_ALTSEL0  ======================================================= */
#define PORT_P0_ALTSEL0_PP5_Pos           (5UL)                     /*!< PORT P0_ALTSEL0: PP5 (Bit 5)                          */
#define PORT_P0_ALTSEL0_PP5_Msk           (0x20UL)                  /*!< PORT P0_ALTSEL0: PP5 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL0_PP4_Pos           (4UL)                     /*!< PORT P0_ALTSEL0: PP4 (Bit 4)                          */
#define PORT_P0_ALTSEL0_PP4_Msk           (0x10UL)                  /*!< PORT P0_ALTSEL0: PP4 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL0_PP3_Pos           (3UL)                     /*!< PORT P0_ALTSEL0: PP3 (Bit 3)                          */
#define PORT_P0_ALTSEL0_PP3_Msk           (0x8UL)                   /*!< PORT P0_ALTSEL0: PP3 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL0_PP2_Pos           (2UL)                     /*!< PORT P0_ALTSEL0: PP2 (Bit 2)                          */
#define PORT_P0_ALTSEL0_PP2_Msk           (0x4UL)                   /*!< PORT P0_ALTSEL0: PP2 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL0_PP1_Pos           (1UL)                     /*!< PORT P0_ALTSEL0: PP1 (Bit 1)                          */
#define PORT_P0_ALTSEL0_PP1_Msk           (0x2UL)                   /*!< PORT P0_ALTSEL0: PP1 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL0_PP0_Pos           (0UL)                     /*!< PORT P0_ALTSEL0: PP0 (Bit 0)                          */
#define PORT_P0_ALTSEL0_PP0_Msk           (0x1UL)                   /*!< PORT P0_ALTSEL0: PP0 (Bitfield-Mask: 0x01)            */
/* ======================================================  P0_ALTSEL1  ======================================================= */
#define PORT_P0_ALTSEL1_PP5_Pos           (5UL)                     /*!< PORT P0_ALTSEL1: PP5 (Bit 5)                          */
#define PORT_P0_ALTSEL1_PP5_Msk           (0x20UL)                  /*!< PORT P0_ALTSEL1: PP5 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL1_PP4_Pos           (4UL)                     /*!< PORT P0_ALTSEL1: PP4 (Bit 4)                          */
#define PORT_P0_ALTSEL1_PP4_Msk           (0x10UL)                  /*!< PORT P0_ALTSEL1: PP4 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL1_PP3_Pos           (3UL)                     /*!< PORT P0_ALTSEL1: PP3 (Bit 3)                          */
#define PORT_P0_ALTSEL1_PP3_Msk           (0x8UL)                   /*!< PORT P0_ALTSEL1: PP3 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL1_PP2_Pos           (2UL)                     /*!< PORT P0_ALTSEL1: PP2 (Bit 2)                          */
#define PORT_P0_ALTSEL1_PP2_Msk           (0x4UL)                   /*!< PORT P0_ALTSEL1: PP2 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL1_PP1_Pos           (1UL)                     /*!< PORT P0_ALTSEL1: PP1 (Bit 1)                          */
#define PORT_P0_ALTSEL1_PP1_Msk           (0x2UL)                   /*!< PORT P0_ALTSEL1: PP1 (Bitfield-Mask: 0x01)            */
#define PORT_P0_ALTSEL1_PP0_Pos           (0UL)                     /*!< PORT P0_ALTSEL1: PP0 (Bit 0)                          */
#define PORT_P0_ALTSEL1_PP0_Msk           (0x1UL)                   /*!< PORT P0_ALTSEL1: PP0 (Bitfield-Mask: 0x01)            */
/* ========================================================  P0_DATA  ======================================================== */
#define PORT_P0_DATA_PP5_STS_Pos          (21UL)                    /*!< PORT P0_DATA: PP5_STS (Bit 21)                        */
#define PORT_P0_DATA_PP5_STS_Msk          (0x200000UL)              /*!< PORT P0_DATA: PP5_STS (Bitfield-Mask: 0x01)           */
#define PORT_P0_DATA_PP4_STS_Pos          (20UL)                    /*!< PORT P0_DATA: PP4_STS (Bit 20)                        */
#define PORT_P0_DATA_PP4_STS_Msk          (0x100000UL)              /*!< PORT P0_DATA: PP4_STS (Bitfield-Mask: 0x01)           */
#define PORT_P0_DATA_PP3_STS_Pos          (19UL)                    /*!< PORT P0_DATA: PP3_STS (Bit 19)                        */
#define PORT_P0_DATA_PP3_STS_Msk          (0x80000UL)               /*!< PORT P0_DATA: PP3_STS (Bitfield-Mask: 0x01)           */
#define PORT_P0_DATA_PP2_STS_Pos          (18UL)                    /*!< PORT P0_DATA: PP2_STS (Bit 18)                        */
#define PORT_P0_DATA_PP2_STS_Msk          (0x40000UL)               /*!< PORT P0_DATA: PP2_STS (Bitfield-Mask: 0x01)           */
#define PORT_P0_DATA_PP1_STS_Pos          (17UL)                    /*!< PORT P0_DATA: PP1_STS (Bit 17)                        */
#define PORT_P0_DATA_PP1_STS_Msk          (0x20000UL)               /*!< PORT P0_DATA: PP1_STS (Bitfield-Mask: 0x01)           */
#define PORT_P0_DATA_PP0_STS_Pos          (16UL)                    /*!< PORT P0_DATA: PP0_STS (Bit 16)                        */
#define PORT_P0_DATA_PP0_STS_Msk          (0x10000UL)               /*!< PORT P0_DATA: PP0_STS (Bitfield-Mask: 0x01)           */
#define PORT_P0_DATA_PP5_Pos              (5UL)                     /*!< PORT P0_DATA: PP5 (Bit 5)                             */
#define PORT_P0_DATA_PP5_Msk              (0x20UL)                  /*!< PORT P0_DATA: PP5 (Bitfield-Mask: 0x01)               */
#define PORT_P0_DATA_PP4_Pos              (4UL)                     /*!< PORT P0_DATA: PP4 (Bit 4)                             */
#define PORT_P0_DATA_PP4_Msk              (0x10UL)                  /*!< PORT P0_DATA: PP4 (Bitfield-Mask: 0x01)               */
#define PORT_P0_DATA_PP3_Pos              (3UL)                     /*!< PORT P0_DATA: PP3 (Bit 3)                             */
#define PORT_P0_DATA_PP3_Msk              (0x8UL)                   /*!< PORT P0_DATA: PP3 (Bitfield-Mask: 0x01)               */
#define PORT_P0_DATA_PP2_Pos              (2UL)                     /*!< PORT P0_DATA: PP2 (Bit 2)                             */
#define PORT_P0_DATA_PP2_Msk              (0x4UL)                   /*!< PORT P0_DATA: PP2 (Bitfield-Mask: 0x01)               */
#define PORT_P0_DATA_PP1_Pos              (1UL)                     /*!< PORT P0_DATA: PP1 (Bit 1)                             */
#define PORT_P0_DATA_PP1_Msk              (0x2UL)                   /*!< PORT P0_DATA: PP1 (Bitfield-Mask: 0x01)               */
#define PORT_P0_DATA_PP0_Pos              (0UL)                     /*!< PORT P0_DATA: PP0 (Bit 0)                             */
#define PORT_P0_DATA_PP0_Msk              (0x1UL)                   /*!< PORT P0_DATA: PP0 (Bitfield-Mask: 0x01)               */
/* ========================================================  P0_DIR  ========================================================= */
#define PORT_P0_DIR_PP5_INEN_Pos          (21UL)                    /*!< PORT P0_DIR: PP5_INEN (Bit 21)                        */
#define PORT_P0_DIR_PP5_INEN_Msk          (0x200000UL)              /*!< PORT P0_DIR: PP5_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P0_DIR_PP4_INEN_Pos          (20UL)                    /*!< PORT P0_DIR: PP4_INEN (Bit 20)                        */
#define PORT_P0_DIR_PP4_INEN_Msk          (0x100000UL)              /*!< PORT P0_DIR: PP4_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P0_DIR_PP3_INEN_Pos          (19UL)                    /*!< PORT P0_DIR: PP3_INEN (Bit 19)                        */
#define PORT_P0_DIR_PP3_INEN_Msk          (0x80000UL)               /*!< PORT P0_DIR: PP3_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P0_DIR_PP2_INEN_Pos          (18UL)                    /*!< PORT P0_DIR: PP2_INEN (Bit 18)                        */
#define PORT_P0_DIR_PP2_INEN_Msk          (0x40000UL)               /*!< PORT P0_DIR: PP2_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P0_DIR_PP1_INEN_Pos          (17UL)                    /*!< PORT P0_DIR: PP1_INEN (Bit 17)                        */
#define PORT_P0_DIR_PP1_INEN_Msk          (0x20000UL)               /*!< PORT P0_DIR: PP1_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P0_DIR_PP0_INEN_Pos          (16UL)                    /*!< PORT P0_DIR: PP0_INEN (Bit 16)                        */
#define PORT_P0_DIR_PP0_INEN_Msk          (0x10000UL)               /*!< PORT P0_DIR: PP0_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P0_DIR_PP5_Pos               (5UL)                     /*!< PORT P0_DIR: PP5 (Bit 5)                              */
#define PORT_P0_DIR_PP5_Msk               (0x20UL)                  /*!< PORT P0_DIR: PP5 (Bitfield-Mask: 0x01)                */
#define PORT_P0_DIR_PP4_Pos               (4UL)                     /*!< PORT P0_DIR: PP4 (Bit 4)                              */
#define PORT_P0_DIR_PP4_Msk               (0x10UL)                  /*!< PORT P0_DIR: PP4 (Bitfield-Mask: 0x01)                */
#define PORT_P0_DIR_PP3_Pos               (3UL)                     /*!< PORT P0_DIR: PP3 (Bit 3)                              */
#define PORT_P0_DIR_PP3_Msk               (0x8UL)                   /*!< PORT P0_DIR: PP3 (Bitfield-Mask: 0x01)                */
#define PORT_P0_DIR_PP2_Pos               (2UL)                     /*!< PORT P0_DIR: PP2 (Bit 2)                              */
#define PORT_P0_DIR_PP2_Msk               (0x4UL)                   /*!< PORT P0_DIR: PP2 (Bitfield-Mask: 0x01)                */
#define PORT_P0_DIR_PP1_Pos               (1UL)                     /*!< PORT P0_DIR: PP1 (Bit 1)                              */
#define PORT_P0_DIR_PP1_Msk               (0x2UL)                   /*!< PORT P0_DIR: PP1 (Bitfield-Mask: 0x01)                */
#define PORT_P0_DIR_PP0_Pos               (0UL)                     /*!< PORT P0_DIR: PP0 (Bit 0)                              */
#define PORT_P0_DIR_PP0_Msk               (0x1UL)                   /*!< PORT P0_DIR: PP0 (Bitfield-Mask: 0x01)                */
/* =========================================================  P0_OD  ========================================================= */
#define PORT_P0_OD_PP5_Pos                (5UL)                     /*!< PORT P0_OD: PP5 (Bit 5)                               */
#define PORT_P0_OD_PP5_Msk                (0x20UL)                  /*!< PORT P0_OD: PP5 (Bitfield-Mask: 0x01)                 */
#define PORT_P0_OD_PP4_Pos                (4UL)                     /*!< PORT P0_OD: PP4 (Bit 4)                               */
#define PORT_P0_OD_PP4_Msk                (0x10UL)                  /*!< PORT P0_OD: PP4 (Bitfield-Mask: 0x01)                 */
#define PORT_P0_OD_PP3_Pos                (3UL)                     /*!< PORT P0_OD: PP3 (Bit 3)                               */
#define PORT_P0_OD_PP3_Msk                (0x8UL)                   /*!< PORT P0_OD: PP3 (Bitfield-Mask: 0x01)                 */
#define PORT_P0_OD_PP2_Pos                (2UL)                     /*!< PORT P0_OD: PP2 (Bit 2)                               */
#define PORT_P0_OD_PP2_Msk                (0x4UL)                   /*!< PORT P0_OD: PP2 (Bitfield-Mask: 0x01)                 */
#define PORT_P0_OD_PP1_Pos                (1UL)                     /*!< PORT P0_OD: PP1 (Bit 1)                               */
#define PORT_P0_OD_PP1_Msk                (0x2UL)                   /*!< PORT P0_OD: PP1 (Bitfield-Mask: 0x01)                 */
#define PORT_P0_OD_PP0_Pos                (0UL)                     /*!< PORT P0_OD: PP0 (Bit 0)                               */
#define PORT_P0_OD_PP0_Msk                (0x1UL)                   /*!< PORT P0_OD: PP0 (Bitfield-Mask: 0x01)                 */
/* =======================================================  P0_PUDEN  ======================================================== */
#define PORT_P0_PUDEN_PP5_Pos             (5UL)                     /*!< PORT P0_PUDEN: PP5 (Bit 5)                            */
#define PORT_P0_PUDEN_PP5_Msk             (0x20UL)                  /*!< PORT P0_PUDEN: PP5 (Bitfield-Mask: 0x01)              */
#define PORT_P0_PUDEN_PP4_Pos             (4UL)                     /*!< PORT P0_PUDEN: PP4 (Bit 4)                            */
#define PORT_P0_PUDEN_PP4_Msk             (0x10UL)                  /*!< PORT P0_PUDEN: PP4 (Bitfield-Mask: 0x01)              */
#define PORT_P0_PUDEN_PP3_Pos             (3UL)                     /*!< PORT P0_PUDEN: PP3 (Bit 3)                            */
#define PORT_P0_PUDEN_PP3_Msk             (0x8UL)                   /*!< PORT P0_PUDEN: PP3 (Bitfield-Mask: 0x01)              */
#define PORT_P0_PUDEN_PP2_Pos             (2UL)                     /*!< PORT P0_PUDEN: PP2 (Bit 2)                            */
#define PORT_P0_PUDEN_PP2_Msk             (0x4UL)                   /*!< PORT P0_PUDEN: PP2 (Bitfield-Mask: 0x01)              */
#define PORT_P0_PUDEN_PP1_Pos             (1UL)                     /*!< PORT P0_PUDEN: PP1 (Bit 1)                            */
#define PORT_P0_PUDEN_PP1_Msk             (0x2UL)                   /*!< PORT P0_PUDEN: PP1 (Bitfield-Mask: 0x01)              */
#define PORT_P0_PUDEN_PP0_Pos             (0UL)                     /*!< PORT P0_PUDEN: PP0 (Bit 0)                            */
#define PORT_P0_PUDEN_PP0_Msk             (0x1UL)                   /*!< PORT P0_PUDEN: PP0 (Bitfield-Mask: 0x01)              */
/* =======================================================  P0_PUDSEL  ======================================================= */
#define PORT_P0_PUDSEL_PP5_Pos            (5UL)                     /*!< PORT P0_PUDSEL: PP5 (Bit 5)                           */
#define PORT_P0_PUDSEL_PP5_Msk            (0x20UL)                  /*!< PORT P0_PUDSEL: PP5 (Bitfield-Mask: 0x01)             */
#define PORT_P0_PUDSEL_PP4_Pos            (4UL)                     /*!< PORT P0_PUDSEL: PP4 (Bit 4)                           */
#define PORT_P0_PUDSEL_PP4_Msk            (0x10UL)                  /*!< PORT P0_PUDSEL: PP4 (Bitfield-Mask: 0x01)             */
#define PORT_P0_PUDSEL_PP3_Pos            (3UL)                     /*!< PORT P0_PUDSEL: PP3 (Bit 3)                           */
#define PORT_P0_PUDSEL_PP3_Msk            (0x8UL)                   /*!< PORT P0_PUDSEL: PP3 (Bitfield-Mask: 0x01)             */
#define PORT_P0_PUDSEL_PP2_Pos            (2UL)                     /*!< PORT P0_PUDSEL: PP2 (Bit 2)                           */
#define PORT_P0_PUDSEL_PP2_Msk            (0x4UL)                   /*!< PORT P0_PUDSEL: PP2 (Bitfield-Mask: 0x01)             */
#define PORT_P0_PUDSEL_PP1_Pos            (1UL)                     /*!< PORT P0_PUDSEL: PP1 (Bit 1)                           */
#define PORT_P0_PUDSEL_PP1_Msk            (0x2UL)                   /*!< PORT P0_PUDSEL: PP1 (Bitfield-Mask: 0x01)             */
#define PORT_P0_PUDSEL_PP0_Pos            (0UL)                     /*!< PORT P0_PUDSEL: PP0 (Bit 0)                           */
#define PORT_P0_PUDSEL_PP0_Msk            (0x1UL)                   /*!< PORT P0_PUDSEL: PP0 (Bitfield-Mask: 0x01)             */
/* ======================================================  P1_ALTSEL0  ======================================================= */
#define PORT_P1_ALTSEL0_PP4_Pos           (4UL)                     /*!< PORT P1_ALTSEL0: PP4 (Bit 4)                          */
#define PORT_P1_ALTSEL0_PP4_Msk           (0x10UL)                  /*!< PORT P1_ALTSEL0: PP4 (Bitfield-Mask: 0x01)            */
#define PORT_P1_ALTSEL0_PP2_Pos           (2UL)                     /*!< PORT P1_ALTSEL0: PP2 (Bit 2)                          */
#define PORT_P1_ALTSEL0_PP2_Msk           (0x4UL)                   /*!< PORT P1_ALTSEL0: PP2 (Bitfield-Mask: 0x01)            */
#define PORT_P1_ALTSEL0_PP1_Pos           (1UL)                     /*!< PORT P1_ALTSEL0: PP1 (Bit 1)                          */
#define PORT_P1_ALTSEL0_PP1_Msk           (0x2UL)                   /*!< PORT P1_ALTSEL0: PP1 (Bitfield-Mask: 0x01)            */
#define PORT_P1_ALTSEL0_PP0_Pos           (0UL)                     /*!< PORT P1_ALTSEL0: PP0 (Bit 0)                          */
#define PORT_P1_ALTSEL0_PP0_Msk           (0x1UL)                   /*!< PORT P1_ALTSEL0: PP0 (Bitfield-Mask: 0x01)            */
/* ======================================================  P1_ALTSEL1  ======================================================= */
#define PORT_P1_ALTSEL1_PP4_Pos           (4UL)                     /*!< PORT P1_ALTSEL1: PP4 (Bit 4)                          */
#define PORT_P1_ALTSEL1_PP4_Msk           (0x10UL)                  /*!< PORT P1_ALTSEL1: PP4 (Bitfield-Mask: 0x01)            */
#define PORT_P1_ALTSEL1_PP2_Pos           (2UL)                     /*!< PORT P1_ALTSEL1: PP2 (Bit 2)                          */
#define PORT_P1_ALTSEL1_PP2_Msk           (0x4UL)                   /*!< PORT P1_ALTSEL1: PP2 (Bitfield-Mask: 0x01)            */
#define PORT_P1_ALTSEL1_PP1_Pos           (1UL)                     /*!< PORT P1_ALTSEL1: PP1 (Bit 1)                          */
#define PORT_P1_ALTSEL1_PP1_Msk           (0x2UL)                   /*!< PORT P1_ALTSEL1: PP1 (Bitfield-Mask: 0x01)            */
#define PORT_P1_ALTSEL1_PP0_Pos           (0UL)                     /*!< PORT P1_ALTSEL1: PP0 (Bit 0)                          */
#define PORT_P1_ALTSEL1_PP0_Msk           (0x1UL)                   /*!< PORT P1_ALTSEL1: PP0 (Bitfield-Mask: 0x01)            */
/* ========================================================  P1_DATA  ======================================================== */
#define PORT_P1_DATA_PP4_STS_Pos          (20UL)                    /*!< PORT P1_DATA: PP4_STS (Bit 20)                        */
#define PORT_P1_DATA_PP4_STS_Msk          (0x100000UL)              /*!< PORT P1_DATA: PP4_STS (Bitfield-Mask: 0x01)           */
#define PORT_P1_DATA_PP2_STS_Pos          (18UL)                    /*!< PORT P1_DATA: PP2_STS (Bit 18)                        */
#define PORT_P1_DATA_PP2_STS_Msk          (0x40000UL)               /*!< PORT P1_DATA: PP2_STS (Bitfield-Mask: 0x01)           */
#define PORT_P1_DATA_PP1_STS_Pos          (17UL)                    /*!< PORT P1_DATA: PP1_STS (Bit 17)                        */
#define PORT_P1_DATA_PP1_STS_Msk          (0x20000UL)               /*!< PORT P1_DATA: PP1_STS (Bitfield-Mask: 0x01)           */
#define PORT_P1_DATA_PP0_STS_Pos          (16UL)                    /*!< PORT P1_DATA: PP0_STS (Bit 16)                        */
#define PORT_P1_DATA_PP0_STS_Msk          (0x10000UL)               /*!< PORT P1_DATA: PP0_STS (Bitfield-Mask: 0x01)           */
#define PORT_P1_DATA_PP4_Pos              (4UL)                     /*!< PORT P1_DATA: PP4 (Bit 4)                             */
#define PORT_P1_DATA_PP4_Msk              (0x10UL)                  /*!< PORT P1_DATA: PP4 (Bitfield-Mask: 0x01)               */
#define PORT_P1_DATA_PP2_Pos              (2UL)                     /*!< PORT P1_DATA: PP2 (Bit 2)                             */
#define PORT_P1_DATA_PP2_Msk              (0x4UL)                   /*!< PORT P1_DATA: PP2 (Bitfield-Mask: 0x01)               */
#define PORT_P1_DATA_PP1_Pos              (1UL)                     /*!< PORT P1_DATA: PP1 (Bit 1)                             */
#define PORT_P1_DATA_PP1_Msk              (0x2UL)                   /*!< PORT P1_DATA: PP1 (Bitfield-Mask: 0x01)               */
#define PORT_P1_DATA_PP0_Pos              (0UL)                     /*!< PORT P1_DATA: PP0 (Bit 0)                             */
#define PORT_P1_DATA_PP0_Msk              (0x1UL)                   /*!< PORT P1_DATA: PP0 (Bitfield-Mask: 0x01)               */
/* ========================================================  P1_DIR  ========================================================= */
#define PORT_P1_DIR_PP4_INEN_Pos          (20UL)                    /*!< PORT P1_DIR: PP4_INEN (Bit 20)                        */
#define PORT_P1_DIR_PP4_INEN_Msk          (0x100000UL)              /*!< PORT P1_DIR: PP4_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P1_DIR_PP2_INEN_Pos          (18UL)                    /*!< PORT P1_DIR: PP2_INEN (Bit 18)                        */
