Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
#define PORT_P1_DIR_PP2_INEN_Msk          (0x40000UL)               /*!< PORT P1_DIR: PP2_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P1_DIR_PP1_INEN_Pos          (17UL)                    /*!< PORT P1_DIR: PP1_INEN (Bit 17)                        */
#define PORT_P1_DIR_PP1_INEN_Msk          (0x20000UL)               /*!< PORT P1_DIR: PP1_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P1_DIR_PP0_INEN_Pos          (16UL)                    /*!< PORT P1_DIR: PP0_INEN (Bit 16)                        */
#define PORT_P1_DIR_PP0_INEN_Msk          (0x10000UL)               /*!< PORT P1_DIR: PP0_INEN (Bitfield-Mask: 0x01)           */
#define PORT_P1_DIR_PP4_Pos               (4UL)                     /*!< PORT P1_DIR: PP4 (Bit 4)                              */
#define PORT_P1_DIR_PP4_Msk               (0x10UL)                  /*!< PORT P1_DIR: PP4 (Bitfield-Mask: 0x01)                */
#define PORT_P1_DIR_PP2_Pos               (2UL)                     /*!< PORT P1_DIR: PP2 (Bit 2)                              */
#define PORT_P1_DIR_PP2_Msk               (0x4UL)                   /*!< PORT P1_DIR: PP2 (Bitfield-Mask: 0x01)                */
#define PORT_P1_DIR_PP1_Pos               (1UL)                     /*!< PORT P1_DIR: PP1 (Bit 1)                              */
#define PORT_P1_DIR_PP1_Msk               (0x2UL)                   /*!< PORT P1_DIR: PP1 (Bitfield-Mask: 0x01)                */
#define PORT_P1_DIR_PP0_Pos               (0UL)                     /*!< PORT P1_DIR: PP0 (Bit 0)                              */
#define PORT_P1_DIR_PP0_Msk               (0x1UL)                   /*!< PORT P1_DIR: PP0 (Bitfield-Mask: 0x01)                */
/* =========================================================  P1_OD  ========================================================= */
#define PORT_P1_OD_PP4_Pos                (4UL)                     /*!< PORT P1_OD: PP4 (Bit 4)                               */
#define PORT_P1_OD_PP4_Msk                (0x10UL)                  /*!< PORT P1_OD: PP4 (Bitfield-Mask: 0x01)                 */
#define PORT_P1_OD_PP2_Pos                (2UL)                     /*!< PORT P1_OD: PP2 (Bit 2)                               */
#define PORT_P1_OD_PP2_Msk                (0x4UL)                   /*!< PORT P1_OD: PP2 (Bitfield-Mask: 0x01)                 */
#define PORT_P1_OD_PP1_Pos                (1UL)                     /*!< PORT P1_OD: PP1 (Bit 1)                               */
#define PORT_P1_OD_PP1_Msk                (0x2UL)                   /*!< PORT P1_OD: PP1 (Bitfield-Mask: 0x01)                 */
#define PORT_P1_OD_PP0_Pos                (0UL)                     /*!< PORT P1_OD: PP0 (Bit 0)                               */
#define PORT_P1_OD_PP0_Msk                (0x1UL)                   /*!< PORT P1_OD: PP0 (Bitfield-Mask: 0x01)                 */
/* =======================================================  P1_PUDEN  ======================================================== */
#define PORT_P1_PUDEN_PP4_Pos             (4UL)                     /*!< PORT P1_PUDEN: PP4 (Bit 4)                            */
#define PORT_P1_PUDEN_PP4_Msk             (0x10UL)                  /*!< PORT P1_PUDEN: PP4 (Bitfield-Mask: 0x01)              */
#define PORT_P1_PUDEN_PP2_Pos             (2UL)                     /*!< PORT P1_PUDEN: PP2 (Bit 2)                            */
#define PORT_P1_PUDEN_PP2_Msk             (0x4UL)                   /*!< PORT P1_PUDEN: PP2 (Bitfield-Mask: 0x01)              */
#define PORT_P1_PUDEN_PP1_Pos             (1UL)                     /*!< PORT P1_PUDEN: PP1 (Bit 1)                            */
#define PORT_P1_PUDEN_PP1_Msk             (0x2UL)                   /*!< PORT P1_PUDEN: PP1 (Bitfield-Mask: 0x01)              */
#define PORT_P1_PUDEN_PP0_Pos             (0UL)                     /*!< PORT P1_PUDEN: PP0 (Bit 0)                            */
#define PORT_P1_PUDEN_PP0_Msk             (0x1UL)                   /*!< PORT P1_PUDEN: PP0 (Bitfield-Mask: 0x01)              */
/* =======================================================  P1_PUDSEL  ======================================================= */
#define PORT_P1_PUDSEL_PP4_Pos            (4UL)                     /*!< PORT P1_PUDSEL: PP4 (Bit 4)                           */
#define PORT_P1_PUDSEL_PP4_Msk            (0x10UL)                  /*!< PORT P1_PUDSEL: PP4 (Bitfield-Mask: 0x01)             */
#define PORT_P1_PUDSEL_PP2_Pos            (2UL)                     /*!< PORT P1_PUDSEL: PP2 (Bit 2)                           */
#define PORT_P1_PUDSEL_PP2_Msk            (0x4UL)                   /*!< PORT P1_PUDSEL: PP2 (Bitfield-Mask: 0x01)             */
#define PORT_P1_PUDSEL_PP1_Pos            (1UL)                     /*!< PORT P1_PUDSEL: PP1 (Bit 1)                           */
#define PORT_P1_PUDSEL_PP1_Msk            (0x2UL)                   /*!< PORT P1_PUDSEL: PP1 (Bitfield-Mask: 0x01)             */
#define PORT_P1_PUDSEL_PP0_Pos            (0UL)                     /*!< PORT P1_PUDSEL: PP0 (Bit 0)                           */
#define PORT_P1_PUDSEL_PP0_Msk            (0x1UL)                   /*!< PORT P1_PUDSEL: PP0 (Bitfield-Mask: 0x01)             */
/* ========================================================  P2_DATA  ======================================================== */
#define PORT_P2_DATA_PP7_Pos              (7UL)                     /*!< PORT P2_DATA: PP7 (Bit 7)                             */
#define PORT_P2_DATA_PP7_Msk              (0x80UL)                  /*!< PORT P2_DATA: PP7 (Bitfield-Mask: 0x01)               */
#define PORT_P2_DATA_PP3_Pos              (3UL)                     /*!< PORT P2_DATA: PP3 (Bit 3)                             */
#define PORT_P2_DATA_PP3_Msk              (0x8UL)                   /*!< PORT P2_DATA: PP3 (Bitfield-Mask: 0x01)               */
#define PORT_P2_DATA_PP2_Pos              (2UL)                     /*!< PORT P2_DATA: PP2 (Bit 2)                             */
#define PORT_P2_DATA_PP2_Msk              (0x4UL)                   /*!< PORT P2_DATA: PP2 (Bitfield-Mask: 0x01)               */
#define PORT_P2_DATA_PP1_Pos              (1UL)                     /*!< PORT P2_DATA: PP1 (Bit 1)                             */
#define PORT_P2_DATA_PP1_Msk              (0x2UL)                   /*!< PORT P2_DATA: PP1 (Bitfield-Mask: 0x01)               */
#define PORT_P2_DATA_PP0_Pos              (0UL)                     /*!< PORT P2_DATA: PP0 (Bit 0)                             */
#define PORT_P2_DATA_PP0_Msk              (0x1UL)                   /*!< PORT P2_DATA: PP0 (Bitfield-Mask: 0x01)               */
/* ========================================================  P2_DIR  ========================================================= */
#define PORT_P2_DIR_PP7_Pos               (7UL)                     /*!< PORT P2_DIR: PP7 (Bit 7)                              */
#define PORT_P2_DIR_PP7_Msk               (0x80UL)                  /*!< PORT P2_DIR: PP7 (Bitfield-Mask: 0x01)                */
#define PORT_P2_DIR_PP3_Pos               (3UL)                     /*!< PORT P2_DIR: PP3 (Bit 3)                              */
#define PORT_P2_DIR_PP3_Msk               (0x8UL)                   /*!< PORT P2_DIR: PP3 (Bitfield-Mask: 0x01)                */
#define PORT_P2_DIR_PP2_Pos               (2UL)                     /*!< PORT P2_DIR: PP2 (Bit 2)                              */
#define PORT_P2_DIR_PP2_Msk               (0x4UL)                   /*!< PORT P2_DIR: PP2 (Bitfield-Mask: 0x01)                */
#define PORT_P2_DIR_PP1_Pos               (1UL)                     /*!< PORT P2_DIR: PP1 (Bit 1)                              */
#define PORT_P2_DIR_PP1_Msk               (0x2UL)                   /*!< PORT P2_DIR: PP1 (Bitfield-Mask: 0x01)                */
#define PORT_P2_DIR_PP0_Pos               (0UL)                     /*!< PORT P2_DIR: PP0 (Bit 0)                              */
#define PORT_P2_DIR_PP0_Msk               (0x1UL)                   /*!< PORT P2_DIR: PP0 (Bitfield-Mask: 0x01)                */
/* =======================================================  P2_PUDEN  ======================================================== */
#define PORT_P2_PUDEN_PP7_Pos             (7UL)                     /*!< PORT P2_PUDEN: PP7 (Bit 7)                            */
#define PORT_P2_PUDEN_PP7_Msk             (0x80UL)                  /*!< PORT P2_PUDEN: PP7 (Bitfield-Mask: 0x01)              */
#define PORT_P2_PUDEN_PP3_Pos             (3UL)                     /*!< PORT P2_PUDEN: PP3 (Bit 3)                            */
#define PORT_P2_PUDEN_PP3_Msk             (0x8UL)                   /*!< PORT P2_PUDEN: PP3 (Bitfield-Mask: 0x01)              */
#define PORT_P2_PUDEN_PP2_Pos             (2UL)                     /*!< PORT P2_PUDEN: PP2 (Bit 2)                            */
#define PORT_P2_PUDEN_PP2_Msk             (0x4UL)                   /*!< PORT P2_PUDEN: PP2 (Bitfield-Mask: 0x01)              */
#define PORT_P2_PUDEN_PP1_Pos             (1UL)                     /*!< PORT P2_PUDEN: PP1 (Bit 1)                            */
#define PORT_P2_PUDEN_PP1_Msk             (0x2UL)                   /*!< PORT P2_PUDEN: PP1 (Bitfield-Mask: 0x01)              */
#define PORT_P2_PUDEN_PP0_Pos             (0UL)                     /*!< PORT P2_PUDEN: PP0 (Bit 0)                            */
#define PORT_P2_PUDEN_PP0_Msk             (0x1UL)                   /*!< PORT P2_PUDEN: PP0 (Bitfield-Mask: 0x01)              */
/* =======================================================  P2_PUDSEL  ======================================================= */
#define PORT_P2_PUDSEL_PP7_Pos            (7UL)                     /*!< PORT P2_PUDSEL: PP7 (Bit 7)                           */
#define PORT_P2_PUDSEL_PP7_Msk            (0x80UL)                  /*!< PORT P2_PUDSEL: PP7 (Bitfield-Mask: 0x01)             */
#define PORT_P2_PUDSEL_PP3_Pos            (3UL)                     /*!< PORT P2_PUDSEL: PP3 (Bit 3)                           */
#define PORT_P2_PUDSEL_PP3_Msk            (0x8UL)                   /*!< PORT P2_PUDSEL: PP3 (Bitfield-Mask: 0x01)             */
#define PORT_P2_PUDSEL_PP2_Pos            (2UL)                     /*!< PORT P2_PUDSEL: PP2 (Bit 2)                           */
#define PORT_P2_PUDSEL_PP2_Msk            (0x4UL)                   /*!< PORT P2_PUDSEL: PP2 (Bitfield-Mask: 0x01)             */
#define PORT_P2_PUDSEL_PP1_Pos            (1UL)                     /*!< PORT P2_PUDSEL: PP1 (Bit 1)                           */
#define PORT_P2_PUDSEL_PP1_Msk            (0x2UL)                   /*!< PORT P2_PUDSEL: PP1 (Bitfield-Mask: 0x01)             */
#define PORT_P2_PUDSEL_PP0_Pos            (0UL)                     /*!< PORT P2_PUDSEL: PP0 (Bit 0)                           */
#define PORT_P2_PUDSEL_PP0_Msk            (0x1UL)                   /*!< PORT P2_PUDSEL: PP0 (Bitfield-Mask: 0x01)             */


/* =========================================================================================================================== */
/* ================                                            SCU                                            ================ */
/* =========================================================================================================================== */

