Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
/* =======================================================  ADC1_CLK  ======================================================== */
#define SCU_ADC1_CLK_DPP1_CLK_DIV_Pos     (8UL)                     /*!< SCU ADC1_CLK: DPP1_CLK_DIV (Bit 8)                    */
#define SCU_ADC1_CLK_DPP1_CLK_DIV_Msk     (0x300UL)                 /*!< SCU ADC1_CLK: DPP1_CLK_DIV (Bitfield-Mask: 0x03)      */
#define SCU_ADC1_CLK_ADC1_CLK_DIV_Pos     (0UL)                     /*!< SCU ADC1_CLK: ADC1_CLK_DIV (Bit 0)                    */
#define SCU_ADC1_CLK_ADC1_CLK_DIV_Msk     (0xfUL)                   /*!< SCU ADC1_CLK: ADC1_CLK_DIV (Bitfield-Mask: 0x0f)      */
/* =========================================================  APCLK  ========================================================= */
#define SCU_APCLK_CPCLK_DIV_Pos           (29UL)                    /*!< SCU APCLK: CPCLK_DIV (Bit 29)                         */
#define SCU_APCLK_CPCLK_DIV_Msk           (0x20000000UL)            /*!< SCU APCLK: CPCLK_DIV (Bitfield-Mask: 0x01)            */
#define SCU_APCLK_CPCLK_SEL_Pos           (28UL)                    /*!< SCU APCLK: CPCLK_SEL (Bit 28)                         */
#define SCU_APCLK_CPCLK_SEL_Msk           (0x10000000UL)            /*!< SCU APCLK: CPCLK_SEL (Bitfield-Mask: 0x01)            */
#define SCU_APCLK_BGCLK_DIV_Pos           (25UL)                    /*!< SCU APCLK: BGCLK_DIV (Bit 25)                         */
#define SCU_APCLK_BGCLK_DIV_Msk           (0x2000000UL)             /*!< SCU APCLK: BGCLK_DIV (Bitfield-Mask: 0x01)            */
#define SCU_APCLK_BGCLK_SEL_Pos           (24UL)                    /*!< SCU APCLK: BGCLK_SEL (Bit 24)                         */
#define SCU_APCLK_BGCLK_SEL_Msk           (0x1000000UL)             /*!< SCU APCLK: BGCLK_SEL (Bitfield-Mask: 0x01)            */
#define SCU_APCLK_APCLK2FAC_Pos           (8UL)                     /*!< SCU APCLK: APCLK2FAC (Bit 8)                          */
#define SCU_APCLK_APCLK2FAC_Msk           (0x1f00UL)                /*!< SCU APCLK: APCLK2FAC (Bitfield-Mask: 0x1f)            */
#define SCU_APCLK_APCLK1FAC_Pos           (0UL)                     /*!< SCU APCLK: APCLK1FAC (Bit 0)                          */
#define SCU_APCLK_APCLK1FAC_Msk           (0x3UL)                   /*!< SCU APCLK: APCLK1FAC (Bitfield-Mask: 0x03)            */
/* ======================================================  APCLK_CTRL  ======================================================= */
#define SCU_APCLK_CTRL_CLKWDT_IE_Pos      (8UL)                     /*!< SCU APCLK_CTRL: CLKWDT_IE (Bit 8)                     */
#define SCU_APCLK_CTRL_CLKWDT_IE_Msk      (0x100UL)                 /*!< SCU APCLK_CTRL: CLKWDT_IE (Bitfield-Mask: 0x01)       */
#define SCU_APCLK_CTRL_APCLK_SET_Pos      (0UL)                     /*!< SCU APCLK_CTRL: APCLK_SET (Bit 0)                     */
#define SCU_APCLK_CTRL_APCLK_SET_Msk      (0x1UL)                   /*!< SCU APCLK_CTRL: APCLK_SET (Bitfield-Mask: 0x01)       */
/* ======================================================  APCLK_SCLR  ======================================================= */
#define SCU_APCLK_SCLR_APCLK3SCLR_Pos     (16UL)                    /*!< SCU APCLK_SCLR: APCLK3SCLR (Bit 16)                   */
#define SCU_APCLK_SCLR_APCLK3SCLR_Msk     (0x10000UL)               /*!< SCU APCLK_SCLR: APCLK3SCLR (Bitfield-Mask: 0x01)      */
#define SCU_APCLK_SCLR_APCLK2SCLR_Pos     (8UL)                     /*!< SCU APCLK_SCLR: APCLK2SCLR (Bit 8)                    */
#define SCU_APCLK_SCLR_APCLK2SCLR_Msk     (0x100UL)                 /*!< SCU APCLK_SCLR: APCLK2SCLR (Bitfield-Mask: 0x01)      */
#define SCU_APCLK_SCLR_APCLK1SCLR_Pos     (0UL)                     /*!< SCU APCLK_SCLR: APCLK1SCLR (Bit 0)                    */
#define SCU_APCLK_SCLR_APCLK1SCLR_Msk     (0x1UL)                   /*!< SCU APCLK_SCLR: APCLK1SCLR (Bitfield-Mask: 0x01)      */
/* =======================================================  APCLK_STS  ======================================================= */
#define SCU_APCLK_STS_PLL_LOCK_Pos        (24UL)                    /*!< SCU APCLK_STS: PLL_LOCK (Bit 24)                      */
#define SCU_APCLK_STS_PLL_LOCK_Msk        (0x1000000UL)             /*!< SCU APCLK_STS: PLL_LOCK (Bitfield-Mask: 0x01)         */
#define SCU_APCLK_STS_BRDRV_CLK_ERR_STS_Pos (20UL)                  /*!< SCU APCLK_STS: BRDRV_CLK_ERR_STS (Bit 20)             */
#define SCU_APCLK_STS_BRDRV_CLK_ERR_STS_Msk (0x100000UL)            /*!< SCU APCLK_STS: BRDRV_CLK_ERR_STS (Bitfield-Mask: 0x01) */
#define SCU_APCLK_STS_APCLK3STS_Pos       (16UL)                    /*!< SCU APCLK_STS: APCLK3STS (Bit 16)                     */
#define SCU_APCLK_STS_APCLK3STS_Msk       (0x10000UL)               /*!< SCU APCLK_STS: APCLK3STS (Bitfield-Mask: 0x01)        */
#define SCU_APCLK_STS_APCLK2STS_Pos       (8UL)                     /*!< SCU APCLK_STS: APCLK2STS (Bit 8)                      */
#define SCU_APCLK_STS_APCLK2STS_Msk       (0x300UL)                 /*!< SCU APCLK_STS: APCLK2STS (Bitfield-Mask: 0x03)        */
#define SCU_APCLK_STS_APCLK_ERR_STS_Pos   (4UL)                     /*!< SCU APCLK_STS: APCLK_ERR_STS (Bit 4)                  */
#define SCU_APCLK_STS_APCLK_ERR_STS_Msk   (0x10UL)                  /*!< SCU APCLK_STS: APCLK_ERR_STS (Bitfield-Mask: 0x01)    */
#define SCU_APCLK_STS_APCLK1STS_Pos       (0UL)                     /*!< SCU APCLK_STS: APCLK1STS (Bit 0)                      */
#define SCU_APCLK_STS_APCLK1STS_Msk       (0x3UL)                   /*!< SCU APCLK_STS: APCLK1STS (Bitfield-Mask: 0x03)        */
/* =========================================================  BCON1  ========================================================= */
#define SCU_BCON1_BR1_PRE_Pos             (1UL)                     /*!< SCU BCON1: BR1_PRE (Bit 1)                            */
#define SCU_BCON1_BR1_PRE_Msk             (0xeUL)                   /*!< SCU BCON1: BR1_PRE (Bitfield-Mask: 0x07)              */
#define SCU_BCON1_BR1_R_Pos               (0UL)                     /*!< SCU BCON1: BR1_R (Bit 0)                              */
#define SCU_BCON1_BR1_R_Msk               (0x1UL)                   /*!< SCU BCON1: BR1_R (Bitfield-Mask: 0x01)                */
/* =========================================================  BCON2  ========================================================= */
#define SCU_BCON2_BR2_PRE_Pos             (1UL)                     /*!< SCU BCON2: BR2_PRE (Bit 1)                            */
#define SCU_BCON2_BR2_PRE_Msk             (0xeUL)                   /*!< SCU BCON2: BR2_PRE (Bitfield-Mask: 0x07)              */
#define SCU_BCON2_BR2_R_Pos               (0UL)                     /*!< SCU BCON2: BR2_R (Bit 0)                              */
#define SCU_BCON2_BR2_R_Msk               (0x1UL)                   /*!< SCU BCON2: BR2_R (Bitfield-Mask: 0x01)                */
/* ==========================================================  BG1  ========================================================== */
#define SCU_BG1_BG1_TIM_VALUE_Pos         (16UL)                    /*!< SCU BG1: BG1_TIM_VALUE (Bit 16)                       */
#define SCU_BG1_BG1_TIM_VALUE_Msk         (0x7ff0000UL)             /*!< SCU BG1: BG1_TIM_VALUE (Bitfield-Mask: 0x7ff)         */
#define SCU_BG1_BG1_BR_VALUE_Pos          (0UL)                     /*!< SCU BG1: BG1_BR_VALUE (Bit 0)                         */
#define SCU_BG1_BG1_BR_VALUE_Msk          (0x7ffUL)                 /*!< SCU BG1: BG1_BR_VALUE (Bitfield-Mask: 0x7ff)          */
/* ==========================================================  BG2  ========================================================== */
#define SCU_BG2_BG2_TIM_VALUE_Pos         (16UL)                    /*!< SCU BG2: BG2_TIM_VALUE (Bit 16)                       */
#define SCU_BG2_BG2_TIM_VALUE_Msk         (0x7ff0000UL)             /*!< SCU BG2: BG2_TIM_VALUE (Bitfield-Mask: 0x7ff)         */
#define SCU_BG2_BG2_BR_VALUE_Pos          (0UL)                     /*!< SCU BG2: BG2_BR_VALUE (Bit 0)                         */
#define SCU_BG2_BG2_BR_VALUE_Msk          (0x7ffUL)                 /*!< SCU BG2: BG2_BR_VALUE (Bitfield-Mask: 0x7ff)          */
/* =========================================================  BGL1  ========================================================== */
#define SCU_BGL1_BG1_FD_SEL_Pos           (0UL)                     /*!< SCU BGL1: BG1_FD_SEL (Bit 0)                          */
#define SCU_BGL1_BG1_FD_SEL_Msk           (0x1fUL)                  /*!< SCU BGL1: BG1_FD_SEL (Bitfield-Mask: 0x1f)            */
/* =========================================================  BGL2  ========================================================== */
#define SCU_BGL2_BG2_FD_SEL_Pos           (0UL)                     /*!< SCU BGL2: BG2_FD_SEL (Bit 0)                          */
#define SCU_BGL2_BG2_FD_SEL_Msk           (0x1fUL)                  /*!< SCU BGL2: BG2_FD_SEL (Bitfield-Mask: 0x1f)            */
/* =======================================================  BRDRV_CLK  ======================================================= */
#define SCU_BRDRV_CLK_BRDRV_TFILT_DIV_Pos (8UL)                     /*!< SCU BRDRV_CLK: BRDRV_TFILT_DIV (Bit 8)                */
#define SCU_BRDRV_CLK_BRDRV_TFILT_DIV_Msk (0x1f00UL)                /*!< SCU BRDRV_CLK: BRDRV_TFILT_DIV (Bitfield-Mask: 0x1f)  */
#define SCU_BRDRV_CLK_BRDRV_CLK_DIV_Pos   (0UL)                     /*!< SCU BRDRV_CLK: BRDRV_CLK_DIV (Bit 0)                  */
#define SCU_BRDRV_CLK_BRDRV_CLK_DIV_Msk   (0x3UL)                   /*!< SCU BRDRV_CLK: BRDRV_CLK_DIV (Bitfield-Mask: 0x03)    */
/* ========================================================  CMCON1  ========================================================= */
#define SCU_CMCON1_PDIV_Pos               (8UL)                     /*!< SCU CMCON1: PDIV (Bit 8)                              */
#define SCU_CMCON1_PDIV_Msk               (0x3f00UL)                /*!< SCU CMCON1: PDIV (Bitfield-Mask: 0x3f)                */
#define SCU_CMCON1_K1DIV_Pos              (7UL)                     /*!< SCU CMCON1: K1DIV (Bit 7)                             */
#define SCU_CMCON1_K1DIV_Msk              (0x80UL)                  /*!< SCU CMCON1: K1DIV (Bitfield-Mask: 0x01)               */
#define SCU_CMCON1_K2DIV_Pos              (4UL)                     /*!< SCU CMCON1: K2DIV (Bit 4)                             */
#define SCU_CMCON1_K2DIV_Msk              (0x70UL)                  /*!< SCU CMCON1: K2DIV (Bitfield-Mask: 0x07)               */
#define SCU_CMCON1_CLKREL_Pos             (0UL)                     /*!< SCU CMCON1: CLKREL (Bit 0)                            */
#define SCU_CMCON1_CLKREL_Msk             (0xfUL)                   /*!< SCU CMCON1: CLKREL (Bitfield-Mask: 0x0f)              */
/* ========================================================  CMCON2  ========================================================= */
#define SCU_CMCON2_PBA0CLKREL_Pos         (0UL)                     /*!< SCU CMCON2: PBA0CLKREL (Bit 0)                        */
#define SCU_CMCON2_PBA0CLKREL_Msk         (0x1UL)                   /*!< SCU CMCON2: PBA0CLKREL (Bitfield-Mask: 0x01)          */
/* =========================================================  COCON  ========================================================= */
#define SCU_COCON_EN_Pos                  (7UL)                     /*!< SCU COCON: EN (Bit 7)                                 */
#define SCU_COCON_EN_Msk                  (0x80UL)                  /*!< SCU COCON: EN (Bitfield-Mask: 0x01)                   */
#define SCU_COCON_COUTS1_Pos              (6UL)                     /*!< SCU COCON: COUTS1 (Bit 6)                             */
#define SCU_COCON_COUTS1_Msk              (0x40UL)                  /*!< SCU COCON: COUTS1 (Bitfield-Mask: 0x01)               */
#define SCU_COCON_TLEN_Pos                (5UL)                     /*!< SCU COCON: TLEN (Bit 5)                               */
#define SCU_COCON_TLEN_Msk                (0x20UL)                  /*!< SCU COCON: TLEN (Bitfield-Mask: 0x01)                 */
#define SCU_COCON_COUTS0_Pos              (4UL)                     /*!< SCU COCON: COUTS0 (Bit 4)                             */
#define SCU_COCON_COUTS0_Msk              (0x10UL)                  /*!< SCU COCON: COUTS0 (Bitfield-Mask: 0x01)               */
#define SCU_COCON_COREL_Pos               (0UL)                     /*!< SCU COCON: COREL (Bit 0)                              */
#define SCU_COCON_COREL_Msk               (0xfUL)                   /*!< SCU COCON: COREL (Bitfield-Mask: 0x0f)                */
/* ========================================================  EDCCON  ========================================================= */
#define SCU_EDCCON_NVMIE_Pos              (2UL)                     /*!< SCU EDCCON: NVMIE (Bit 2)                             */
#define SCU_EDCCON_NVMIE_Msk              (0x4UL)                   /*!< SCU EDCCON: NVMIE (Bitfield-Mask: 0x01)               */
#define SCU_EDCCON_RIE_Pos                (0UL)                     /*!< SCU EDCCON: RIE (Bit 0)                               */
#define SCU_EDCCON_RIE_Msk                (0x1UL)                   /*!< SCU EDCCON: RIE (Bitfield-Mask: 0x01)                 */
/* ========================================================  EDCSCLR  ======================================================== */
#define SCU_EDCSCLR_RSBEC_Pos             (4UL)                     /*!< SCU EDCSCLR: RSBEC (Bit 4)                            */
#define SCU_EDCSCLR_RSBEC_Msk             (0x10UL)                  /*!< SCU EDCSCLR: RSBEC (Bitfield-Mask: 0x01)              */
#define SCU_EDCSCLR_NVMDBEC_Pos           (2UL)                     /*!< SCU EDCSCLR: NVMDBEC (Bit 2)                          */
#define SCU_EDCSCLR_NVMDBEC_Msk           (0x4UL)                   /*!< SCU EDCSCLR: NVMDBEC (Bitfield-Mask: 0x01)            */
#define SCU_EDCSCLR_RDBEC_Pos             (0UL)                     /*!< SCU EDCSCLR: RDBEC (Bit 0)                            */
#define SCU_EDCSCLR_RDBEC_Msk             (0x1UL)                   /*!< SCU EDCSCLR: RDBEC (Bitfield-Mask: 0x01)              */
/* ========================================================  EDCSTAT  ======================================================== */
#define SCU_EDCSTAT_RSBE_Pos              (4UL)                     /*!< SCU EDCSTAT: RSBE (Bit 4)                             */
#define SCU_EDCSTAT_RSBE_Msk              (0x10UL)                  /*!< SCU EDCSTAT: RSBE (Bitfield-Mask: 0x01)               */
#define SCU_EDCSTAT_NVMDBE_Pos            (2UL)                     /*!< SCU EDCSTAT: NVMDBE (Bit 2)                           */
#define SCU_EDCSTAT_NVMDBE_Msk            (0x4UL)                   /*!< SCU EDCSTAT: NVMDBE (Bitfield-Mask: 0x01)             */
#define SCU_EDCSTAT_RDBE_Pos              (0UL)                     /*!< SCU EDCSTAT: RDBE (Bit 0)                             */
#define SCU_EDCSTAT_RDBE_Msk              (0x1UL)                   /*!< SCU EDCSTAT: RDBE (Bitfield-Mask: 0x01)               */
/* ========================================================  EXICON0  ======================================================== */
#define SCU_EXICON0_EXINT2_Pos            (4UL)                     /*!< SCU EXICON0: EXINT2 (Bit 4)                           */
#define SCU_EXICON0_EXINT2_Msk            (0x30UL)                  /*!< SCU EXICON0: EXINT2 (Bitfield-Mask: 0x03)             */
#define SCU_EXICON0_EXINT1_Pos            (2UL)                     /*!< SCU EXICON0: EXINT1 (Bit 2)                           */
#define SCU_EXICON0_EXINT1_Msk            (0xcUL)                   /*!< SCU EXICON0: EXINT1 (Bitfield-Mask: 0x03)             */
#define SCU_EXICON0_EXINT0_Pos            (0UL)                     /*!< SCU EXICON0: EXINT0 (Bit 0)                           */
#define SCU_EXICON0_EXINT0_Msk            (0x3UL)                   /*!< SCU EXICON0: EXINT0 (Bitfield-Mask: 0x03)             */
/* ========================================================  EXICON1  ======================================================== */
#define SCU_EXICON1_MON4_Pos              (6UL)                     /*!< SCU EXICON1: MON4 (Bit 6)                             */
#define SCU_EXICON1_MON4_Msk              (0xc0UL)                  /*!< SCU EXICON1: MON4 (Bitfield-Mask: 0x03)               */
#define SCU_EXICON1_MON3_Pos              (4UL)                     /*!< SCU EXICON1: MON3 (Bit 4)                             */
#define SCU_EXICON1_MON3_Msk              (0x30UL)                  /*!< SCU EXICON1: MON3 (Bitfield-Mask: 0x03)               */
#define SCU_EXICON1_MON2_Pos              (2UL)                     /*!< SCU EXICON1: MON2 (Bit 2)                             */
#define SCU_EXICON1_MON2_Msk              (0xcUL)                   /*!< SCU EXICON1: MON2 (Bitfield-Mask: 0x03)               */
#define SCU_EXICON1_MON1_Pos              (0UL)                     /*!< SCU EXICON1: MON1 (Bit 0)                             */
#define SCU_EXICON1_MON1_Msk              (0x3UL)                   /*!< SCU EXICON1: MON1 (Bitfield-Mask: 0x03)               */
/* =======================================================  GPT12ICLR  ======================================================= */
#define SCU_GPT12ICLR_GPT12CRC_Pos        (5UL)                     /*!< SCU GPT12ICLR: GPT12CRC (Bit 5)                       */
#define SCU_GPT12ICLR_GPT12CRC_Msk        (0x20UL)                  /*!< SCU GPT12ICLR: GPT12CRC (Bitfield-Mask: 0x01)         */
#define SCU_GPT12ICLR_GPT2T6C_Pos         (4UL)                     /*!< SCU GPT12ICLR: GPT2T6C (Bit 4)                        */
#define SCU_GPT12ICLR_GPT2T6C_Msk         (0x10UL)                  /*!< SCU GPT12ICLR: GPT2T6C (Bitfield-Mask: 0x01)          */
#define SCU_GPT12ICLR_GPT2T5C_Pos         (3UL)                     /*!< SCU GPT12ICLR: GPT2T5C (Bit 3)                        */
#define SCU_GPT12ICLR_GPT2T5C_Msk         (0x8UL)                   /*!< SCU GPT12ICLR: GPT2T5C (Bitfield-Mask: 0x01)          */
#define SCU_GPT12ICLR_GPT1T4C_Pos         (2UL)                     /*!< SCU GPT12ICLR: GPT1T4C (Bit 2)                        */
#define SCU_GPT12ICLR_GPT1T4C_Msk         (0x4UL)                   /*!< SCU GPT12ICLR: GPT1T4C (Bitfield-Mask: 0x01)          */
#define SCU_GPT12ICLR_GPT1T3C_Pos         (1UL)                     /*!< SCU GPT12ICLR: GPT1T3C (Bit 1)                        */
#define SCU_GPT12ICLR_GPT1T3C_Msk         (0x2UL)                   /*!< SCU GPT12ICLR: GPT1T3C (Bitfield-Mask: 0x01)          */
#define SCU_GPT12ICLR_GPT1T2C_Pos         (0UL)                     /*!< SCU GPT12ICLR: GPT1T2C (Bit 0)                        */
#define SCU_GPT12ICLR_GPT1T2C_Msk         (0x1UL)                   /*!< SCU GPT12ICLR: GPT1T2C (Bitfield-Mask: 0x01)          */
/* =======================================================  GPT12IEN  ======================================================== */
#define SCU_GPT12IEN_CRIE_Pos             (5UL)                     /*!< SCU GPT12IEN: CRIE (Bit 5)                            */
#define SCU_GPT12IEN_CRIE_Msk             (0x20UL)                  /*!< SCU GPT12IEN: CRIE (Bitfield-Mask: 0x01)              */
#define SCU_GPT12IEN_T6IE_Pos             (4UL)                     /*!< SCU GPT12IEN: T6IE (Bit 4)                            */
#define SCU_GPT12IEN_T6IE_Msk             (0x10UL)                  /*!< SCU GPT12IEN: T6IE (Bitfield-Mask: 0x01)              */
#define SCU_GPT12IEN_T5IE_Pos             (3UL)                     /*!< SCU GPT12IEN: T5IE (Bit 3)                            */
#define SCU_GPT12IEN_T5IE_Msk             (0x8UL)                   /*!< SCU GPT12IEN: T5IE (Bitfield-Mask: 0x01)              */
#define SCU_GPT12IEN_T4IE_Pos             (2UL)                     /*!< SCU GPT12IEN: T4IE (Bit 2)                            */
#define SCU_GPT12IEN_T4IE_Msk             (0x4UL)                   /*!< SCU GPT12IEN: T4IE (Bitfield-Mask: 0x01)              */
#define SCU_GPT12IEN_T3IE_Pos             (1UL)                     /*!< SCU GPT12IEN: T3IE (Bit 1)                            */
#define SCU_GPT12IEN_T3IE_Msk             (0x2UL)                   /*!< SCU GPT12IEN: T3IE (Bitfield-Mask: 0x01)              */
#define SCU_GPT12IEN_T2IE_Pos             (0UL)                     /*!< SCU GPT12IEN: T2IE (Bit 0)                            */
#define SCU_GPT12IEN_T2IE_Msk             (0x1UL)                   /*!< SCU GPT12IEN: T2IE (Bitfield-Mask: 0x01)              */
/* =======================================================  GPT12IRC  ======================================================== */
#define SCU_GPT12IRC_GPT12CR_Pos          (5UL)                     /*!< SCU GPT12IRC: GPT12CR (Bit 5)                         */
#define SCU_GPT12IRC_GPT12CR_Msk          (0x20UL)                  /*!< SCU GPT12IRC: GPT12CR (Bitfield-Mask: 0x01)           */
#define SCU_GPT12IRC_GPT2T6_Pos           (4UL)                     /*!< SCU GPT12IRC: GPT2T6 (Bit 4)                          */
#define SCU_GPT12IRC_GPT2T6_Msk           (0x10UL)                  /*!< SCU GPT12IRC: GPT2T6 (Bitfield-Mask: 0x01)            */
#define SCU_GPT12IRC_GPT2T5_Pos           (3UL)                     /*!< SCU GPT12IRC: GPT2T5 (Bit 3)                          */
#define SCU_GPT12IRC_GPT2T5_Msk           (0x8UL)                   /*!< SCU GPT12IRC: GPT2T5 (Bitfield-Mask: 0x01)            */
#define SCU_GPT12IRC_GPT1T4_Pos           (2UL)                     /*!< SCU GPT12IRC: GPT1T4 (Bit 2)                          */
#define SCU_GPT12IRC_GPT1T4_Msk           (0x4UL)                   /*!< SCU GPT12IRC: GPT1T4 (Bitfield-Mask: 0x01)            */
#define SCU_GPT12IRC_GPT1T3_Pos           (1UL)                     /*!< SCU GPT12IRC: GPT1T3 (Bit 1)                          */
#define SCU_GPT12IRC_GPT1T3_Msk           (0x2UL)                   /*!< SCU GPT12IRC: GPT1T3 (Bitfield-Mask: 0x01)            */
#define SCU_GPT12IRC_GPT1T2_Pos           (0UL)                     /*!< SCU GPT12IRC: GPT1T2 (Bit 0)                          */
#define SCU_GPT12IRC_GPT1T2_Msk           (0x1UL)                   /*!< SCU GPT12IRC: GPT1T2 (Bitfield-Mask: 0x01)            */
/* ======================================================  GPT12PISEL  ======================================================= */
#define SCU_GPT12PISEL_GPT12_SEL_Pos      (5UL)                     /*!< SCU GPT12PISEL: GPT12_SEL (Bit 5)                     */
#define SCU_GPT12PISEL_GPT12_SEL_Msk      (0x20UL)                  /*!< SCU GPT12PISEL: GPT12_SEL (Bitfield-Mask: 0x01)       */
#define SCU_GPT12PISEL_TRIG_CONF_Pos      (4UL)                     /*!< SCU GPT12PISEL: TRIG_CONF (Bit 4)                     */
#define SCU_GPT12PISEL_TRIG_CONF_Msk      (0x10UL)                  /*!< SCU GPT12PISEL: TRIG_CONF (Bitfield-Mask: 0x01)       */
#define SCU_GPT12PISEL_GPT12_Pos          (0UL)                     /*!< SCU GPT12PISEL: GPT12 (Bit 0)                         */
#define SCU_GPT12PISEL_GPT12_Msk          (0xfUL)                   /*!< SCU GPT12PISEL: GPT12 (Bitfield-Mask: 0x0f)           */
/* ==========================================================  ID  =========================================================== */
#define SCU_ID_PRODID_Pos                 (3UL)                     /*!< SCU ID: PRODID (Bit 3)                                */
#define SCU_ID_PRODID_Msk                 (0xf8UL)                  /*!< SCU ID: PRODID (Bitfield-Mask: 0x1f)                  */
#define SCU_ID_VERID_Pos                  (0UL)                     /*!< SCU ID: VERID (Bit 0)                                 */
#define SCU_ID_VERID_Msk                  (0x7UL)                   /*!< SCU ID: VERID (Bitfield-Mask: 0x07)                   */
/* =========================================================  IEN0  ========================================================== */
