Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
#define SCU_IEN0_EA_Pos                   (31UL)                    /*!< SCU IEN0: EA (Bit 31)                                 */
#define SCU_IEN0_EA_Msk                   (0x80000000UL)            /*!< SCU IEN0: EA (Bitfield-Mask: 0x01)                    */
/* ========================================================  IRCON0  ========================================================= */
#define SCU_IRCON0_EXINT2F_Pos            (5UL)                     /*!< SCU IRCON0: EXINT2F (Bit 5)                           */
#define SCU_IRCON0_EXINT2F_Msk            (0x20UL)                  /*!< SCU IRCON0: EXINT2F (Bitfield-Mask: 0x01)             */
#define SCU_IRCON0_EXINT2R_Pos            (4UL)                     /*!< SCU IRCON0: EXINT2R (Bit 4)                           */
#define SCU_IRCON0_EXINT2R_Msk            (0x10UL)                  /*!< SCU IRCON0: EXINT2R (Bitfield-Mask: 0x01)             */
#define SCU_IRCON0_EXINT1F_Pos            (3UL)                     /*!< SCU IRCON0: EXINT1F (Bit 3)                           */
#define SCU_IRCON0_EXINT1F_Msk            (0x8UL)                   /*!< SCU IRCON0: EXINT1F (Bitfield-Mask: 0x01)             */
#define SCU_IRCON0_EXINT1R_Pos            (2UL)                     /*!< SCU IRCON0: EXINT1R (Bit 2)                           */
#define SCU_IRCON0_EXINT1R_Msk            (0x4UL)                   /*!< SCU IRCON0: EXINT1R (Bitfield-Mask: 0x01)             */
#define SCU_IRCON0_EXINT0F_Pos            (1UL)                     /*!< SCU IRCON0: EXINT0F (Bit 1)                           */
#define SCU_IRCON0_EXINT0F_Msk            (0x2UL)                   /*!< SCU IRCON0: EXINT0F (Bitfield-Mask: 0x01)             */
#define SCU_IRCON0_EXINT0R_Pos            (0UL)                     /*!< SCU IRCON0: EXINT0R (Bit 0)                           */
#define SCU_IRCON0_EXINT0R_Msk            (0x1UL)                   /*!< SCU IRCON0: EXINT0R (Bitfield-Mask: 0x01)             */
/* =======================================================  IRCON0CLR  ======================================================= */
#define SCU_IRCON0CLR_EXINT2FC_Pos        (5UL)                     /*!< SCU IRCON0CLR: EXINT2FC (Bit 5)                       */
#define SCU_IRCON0CLR_EXINT2FC_Msk        (0x20UL)                  /*!< SCU IRCON0CLR: EXINT2FC (Bitfield-Mask: 0x01)         */
#define SCU_IRCON0CLR_EXINT2RC_Pos        (4UL)                     /*!< SCU IRCON0CLR: EXINT2RC (Bit 4)                       */
#define SCU_IRCON0CLR_EXINT2RC_Msk        (0x10UL)                  /*!< SCU IRCON0CLR: EXINT2RC (Bitfield-Mask: 0x01)         */
#define SCU_IRCON0CLR_EXINT1FC_Pos        (3UL)                     /*!< SCU IRCON0CLR: EXINT1FC (Bit 3)                       */
#define SCU_IRCON0CLR_EXINT1FC_Msk        (0x8UL)                   /*!< SCU IRCON0CLR: EXINT1FC (Bitfield-Mask: 0x01)         */
#define SCU_IRCON0CLR_EXINT1RC_Pos        (2UL)                     /*!< SCU IRCON0CLR: EXINT1RC (Bit 2)                       */
#define SCU_IRCON0CLR_EXINT1RC_Msk        (0x4UL)                   /*!< SCU IRCON0CLR: EXINT1RC (Bitfield-Mask: 0x01)         */
#define SCU_IRCON0CLR_EXINT0FC_Pos        (1UL)                     /*!< SCU IRCON0CLR: EXINT0FC (Bit 1)                       */
#define SCU_IRCON0CLR_EXINT0FC_Msk        (0x2UL)                   /*!< SCU IRCON0CLR: EXINT0FC (Bitfield-Mask: 0x01)         */
#define SCU_IRCON0CLR_EXINT0RC_Pos        (0UL)                     /*!< SCU IRCON0CLR: EXINT0RC (Bit 0)                       */
#define SCU_IRCON0CLR_EXINT0RC_Msk        (0x1UL)                   /*!< SCU IRCON0CLR: EXINT0RC (Bitfield-Mask: 0x01)         */
/* ========================================================  IRCON1  ========================================================= */
#define SCU_IRCON1_MON4F_Pos              (7UL)                     /*!< SCU IRCON1: MON4F (Bit 7)                             */
#define SCU_IRCON1_MON4F_Msk              (0x80UL)                  /*!< SCU IRCON1: MON4F (Bitfield-Mask: 0x01)               */
#define SCU_IRCON1_MON4R_Pos              (6UL)                     /*!< SCU IRCON1: MON4R (Bit 6)                             */
#define SCU_IRCON1_MON4R_Msk              (0x40UL)                  /*!< SCU IRCON1: MON4R (Bitfield-Mask: 0x01)               */
#define SCU_IRCON1_MON3F_Pos              (5UL)                     /*!< SCU IRCON1: MON3F (Bit 5)                             */
#define SCU_IRCON1_MON3F_Msk              (0x20UL)                  /*!< SCU IRCON1: MON3F (Bitfield-Mask: 0x01)               */
#define SCU_IRCON1_MON3R_Pos              (4UL)                     /*!< SCU IRCON1: MON3R (Bit 4)                             */
#define SCU_IRCON1_MON3R_Msk              (0x10UL)                  /*!< SCU IRCON1: MON3R (Bitfield-Mask: 0x01)               */
#define SCU_IRCON1_MON2F_Pos              (3UL)                     /*!< SCU IRCON1: MON2F (Bit 3)                             */
#define SCU_IRCON1_MON2F_Msk              (0x8UL)                   /*!< SCU IRCON1: MON2F (Bitfield-Mask: 0x01)               */
#define SCU_IRCON1_MON2R_Pos              (2UL)                     /*!< SCU IRCON1: MON2R (Bit 2)                             */
#define SCU_IRCON1_MON2R_Msk              (0x4UL)                   /*!< SCU IRCON1: MON2R (Bitfield-Mask: 0x01)               */
#define SCU_IRCON1_MON1F_Pos              (1UL)                     /*!< SCU IRCON1: MON1F (Bit 1)                             */
#define SCU_IRCON1_MON1F_Msk              (0x2UL)                   /*!< SCU IRCON1: MON1F (Bitfield-Mask: 0x01)               */
#define SCU_IRCON1_MON1R_Pos              (0UL)                     /*!< SCU IRCON1: MON1R (Bit 0)                             */
#define SCU_IRCON1_MON1R_Msk              (0x1UL)                   /*!< SCU IRCON1: MON1R (Bitfield-Mask: 0x01)               */
/* =======================================================  IRCON1CLR  ======================================================= */
#define SCU_IRCON1CLR_MON4FC_Pos          (7UL)                     /*!< SCU IRCON1CLR: MON4FC (Bit 7)                         */
#define SCU_IRCON1CLR_MON4FC_Msk          (0x80UL)                  /*!< SCU IRCON1CLR: MON4FC (Bitfield-Mask: 0x01)           */
#define SCU_IRCON1CLR_MON4RC_Pos          (6UL)                     /*!< SCU IRCON1CLR: MON4RC (Bit 6)                         */
#define SCU_IRCON1CLR_MON4RC_Msk          (0x40UL)                  /*!< SCU IRCON1CLR: MON4RC (Bitfield-Mask: 0x01)           */
#define SCU_IRCON1CLR_MON3FC_Pos          (5UL)                     /*!< SCU IRCON1CLR: MON3FC (Bit 5)                         */
#define SCU_IRCON1CLR_MON3FC_Msk          (0x20UL)                  /*!< SCU IRCON1CLR: MON3FC (Bitfield-Mask: 0x01)           */
#define SCU_IRCON1CLR_MON3RC_Pos          (4UL)                     /*!< SCU IRCON1CLR: MON3RC (Bit 4)                         */
#define SCU_IRCON1CLR_MON3RC_Msk          (0x10UL)                  /*!< SCU IRCON1CLR: MON3RC (Bitfield-Mask: 0x01)           */
#define SCU_IRCON1CLR_MON2FC_Pos          (3UL)                     /*!< SCU IRCON1CLR: MON2FC (Bit 3)                         */
#define SCU_IRCON1CLR_MON2FC_Msk          (0x8UL)                   /*!< SCU IRCON1CLR: MON2FC (Bitfield-Mask: 0x01)           */
#define SCU_IRCON1CLR_MON2RC_Pos          (2UL)                     /*!< SCU IRCON1CLR: MON2RC (Bit 2)                         */
#define SCU_IRCON1CLR_MON2RC_Msk          (0x4UL)                   /*!< SCU IRCON1CLR: MON2RC (Bitfield-Mask: 0x01)           */
#define SCU_IRCON1CLR_MON1FC_Pos          (1UL)                     /*!< SCU IRCON1CLR: MON1FC (Bit 1)                         */
#define SCU_IRCON1CLR_MON1FC_Msk          (0x2UL)                   /*!< SCU IRCON1CLR: MON1FC (Bitfield-Mask: 0x01)           */
#define SCU_IRCON1CLR_MON1RC_Pos          (0UL)                     /*!< SCU IRCON1CLR: MON1RC (Bit 0)                         */
#define SCU_IRCON1CLR_MON1RC_Msk          (0x1UL)                   /*!< SCU IRCON1CLR: MON1RC (Bitfield-Mask: 0x01)           */
/* ========================================================  IRCON2  ========================================================= */
#define SCU_IRCON2_RIR1_Pos               (2UL)                     /*!< SCU IRCON2: RIR1 (Bit 2)                              */
#define SCU_IRCON2_RIR1_Msk               (0x4UL)                   /*!< SCU IRCON2: RIR1 (Bitfield-Mask: 0x01)                */
#define SCU_IRCON2_TIR1_Pos               (1UL)                     /*!< SCU IRCON2: TIR1 (Bit 1)                              */
#define SCU_IRCON2_TIR1_Msk               (0x2UL)                   /*!< SCU IRCON2: TIR1 (Bitfield-Mask: 0x01)                */
#define SCU_IRCON2_EIR1_Pos               (0UL)                     /*!< SCU IRCON2: EIR1 (Bit 0)                              */
#define SCU_IRCON2_EIR1_Msk               (0x1UL)                   /*!< SCU IRCON2: EIR1 (Bitfield-Mask: 0x01)                */
/* =======================================================  IRCON2CLR  ======================================================= */
#define SCU_IRCON2CLR_RIR1C_Pos           (2UL)                     /*!< SCU IRCON2CLR: RIR1C (Bit 2)                          */
#define SCU_IRCON2CLR_RIR1C_Msk           (0x4UL)                   /*!< SCU IRCON2CLR: RIR1C (Bitfield-Mask: 0x01)            */
#define SCU_IRCON2CLR_TIR1C_Pos           (1UL)                     /*!< SCU IRCON2CLR: TIR1C (Bit 1)                          */
#define SCU_IRCON2CLR_TIR1C_Msk           (0x2UL)                   /*!< SCU IRCON2CLR: TIR1C (Bitfield-Mask: 0x01)            */
#define SCU_IRCON2CLR_EIR1C_Pos           (0UL)                     /*!< SCU IRCON2CLR: EIR1C (Bit 0)                          */
#define SCU_IRCON2CLR_EIR1C_Msk           (0x1UL)                   /*!< SCU IRCON2CLR: EIR1C (Bitfield-Mask: 0x01)            */
/* ========================================================  IRCON3  ========================================================= */
#define SCU_IRCON3_RIR2_Pos               (2UL)                     /*!< SCU IRCON3: RIR2 (Bit 2)                              */
#define SCU_IRCON3_RIR2_Msk               (0x4UL)                   /*!< SCU IRCON3: RIR2 (Bitfield-Mask: 0x01)                */
#define SCU_IRCON3_TIR2_Pos               (1UL)                     /*!< SCU IRCON3: TIR2 (Bit 1)                              */
#define SCU_IRCON3_TIR2_Msk               (0x2UL)                   /*!< SCU IRCON3: TIR2 (Bitfield-Mask: 0x01)                */
#define SCU_IRCON3_EIR2_Pos               (0UL)                     /*!< SCU IRCON3: EIR2 (Bit 0)                              */
#define SCU_IRCON3_EIR2_Msk               (0x1UL)                   /*!< SCU IRCON3: EIR2 (Bitfield-Mask: 0x01)                */
/* =======================================================  IRCON3CLR  ======================================================= */
#define SCU_IRCON3CLR_RIR2C_Pos           (2UL)                     /*!< SCU IRCON3CLR: RIR2C (Bit 2)                          */
#define SCU_IRCON3CLR_RIR2C_Msk           (0x4UL)                   /*!< SCU IRCON3CLR: RIR2C (Bitfield-Mask: 0x01)            */
#define SCU_IRCON3CLR_TIR2C_Pos           (1UL)                     /*!< SCU IRCON3CLR: TIR2C (Bit 1)                          */
#define SCU_IRCON3CLR_TIR2C_Msk           (0x2UL)                   /*!< SCU IRCON3CLR: TIR2C (Bitfield-Mask: 0x01)            */
#define SCU_IRCON3CLR_EIR2C_Pos           (0UL)                     /*!< SCU IRCON3CLR: EIR2C (Bit 0)                          */
#define SCU_IRCON3CLR_EIR2C_Msk           (0x1UL)                   /*!< SCU IRCON3CLR: EIR2C (Bitfield-Mask: 0x01)            */
/* ========================================================  IRCON4  ========================================================= */
#define SCU_IRCON4_CCU6SR3_Pos            (20UL)                    /*!< SCU IRCON4: CCU6SR3 (Bit 20)                          */
#define SCU_IRCON4_CCU6SR3_Msk            (0x100000UL)              /*!< SCU IRCON4: CCU6SR3 (Bitfield-Mask: 0x01)             */
#define SCU_IRCON4_CCU6SR2_Pos            (16UL)                    /*!< SCU IRCON4: CCU6SR2 (Bit 16)                          */
#define SCU_IRCON4_CCU6SR2_Msk            (0x10000UL)               /*!< SCU IRCON4: CCU6SR2 (Bitfield-Mask: 0x01)             */
#define SCU_IRCON4_CCU6SR1_Pos            (4UL)                     /*!< SCU IRCON4: CCU6SR1 (Bit 4)                           */
#define SCU_IRCON4_CCU6SR1_Msk            (0x10UL)                  /*!< SCU IRCON4: CCU6SR1 (Bitfield-Mask: 0x01)             */
#define SCU_IRCON4_CCU6SR0_Pos            (0UL)                     /*!< SCU IRCON4: CCU6SR0 (Bit 0)                           */
#define SCU_IRCON4_CCU6SR0_Msk            (0x1UL)                   /*!< SCU IRCON4: CCU6SR0 (Bitfield-Mask: 0x01)             */
/* =======================================================  IRCON4CLR  ======================================================= */
#define SCU_IRCON4CLR_CCU6SR3C_Pos        (20UL)                    /*!< SCU IRCON4CLR: CCU6SR3C (Bit 20)                      */
#define SCU_IRCON4CLR_CCU6SR3C_Msk        (0x100000UL)              /*!< SCU IRCON4CLR: CCU6SR3C (Bitfield-Mask: 0x01)         */
#define SCU_IRCON4CLR_CCU6SR2C_Pos        (16UL)                    /*!< SCU IRCON4CLR: CCU6SR2C (Bit 16)                      */
#define SCU_IRCON4CLR_CCU6SR2C_Msk        (0x10000UL)               /*!< SCU IRCON4CLR: CCU6SR2C (Bitfield-Mask: 0x01)         */
#define SCU_IRCON4CLR_CCU6SR1C_Pos        (4UL)                     /*!< SCU IRCON4CLR: CCU6SR1C (Bit 4)                       */
#define SCU_IRCON4CLR_CCU6SR1C_Msk        (0x10UL)                  /*!< SCU IRCON4CLR: CCU6SR1C (Bitfield-Mask: 0x01)         */
#define SCU_IRCON4CLR_CCU6SR0C_Pos        (0UL)                     /*!< SCU IRCON4CLR: CCU6SR0C (Bit 0)                       */
#define SCU_IRCON4CLR_CCU6SR0C_Msk        (0x1UL)                   /*!< SCU IRCON4CLR: CCU6SR0C (Bitfield-Mask: 0x01)         */
/* ========================================================  IRCON5  ========================================================= */
#define SCU_IRCON5_WAKEUP_Pos             (0UL)                     /*!< SCU IRCON5: WAKEUP (Bit 0)                            */
#define SCU_IRCON5_WAKEUP_Msk             (0x1UL)                   /*!< SCU IRCON5: WAKEUP (Bitfield-Mask: 0x01)              */
/* =======================================================  IRCON5CLR  ======================================================= */
#define SCU_IRCON5CLR_WAKEUPC_Pos         (0UL)                     /*!< SCU IRCON5CLR: WAKEUPC (Bit 0)                        */
#define SCU_IRCON5CLR_WAKEUPC_Msk         (0x1UL)                   /*!< SCU IRCON5CLR: WAKEUPC (Bitfield-Mask: 0x01)          */
/* ========================================================  LINSCLR  ======================================================== */
#define SCU_LINSCLR_ERRSYNC_Pos           (5UL)                     /*!< SCU LINSCLR: ERRSYNC (Bit 5)                          */
#define SCU_LINSCLR_ERRSYNC_Msk           (0x20UL)                  /*!< SCU LINSCLR: ERRSYNC (Bitfield-Mask: 0x01)            */
#define SCU_LINSCLR_EOFSYNC_Pos           (4UL)                     /*!< SCU LINSCLR: EOFSYNC (Bit 4)                          */
#define SCU_LINSCLR_EOFSYNC_Msk           (0x10UL)                  /*!< SCU LINSCLR: EOFSYNC (Bitfield-Mask: 0x01)            */
#define SCU_LINSCLR_BRKC_Pos              (3UL)                     /*!< SCU LINSCLR: BRKC (Bit 3)                             */
#define SCU_LINSCLR_BRKC_Msk              (0x8UL)                   /*!< SCU LINSCLR: BRKC (Bitfield-Mask: 0x01)               */
/* =========================================================  LINST  ========================================================= */
#define SCU_LINST_SYNEN_Pos               (6UL)                     /*!< SCU LINST: SYNEN (Bit 6)                              */
#define SCU_LINST_SYNEN_Msk               (0x40UL)                  /*!< SCU LINST: SYNEN (Bitfield-Mask: 0x01)                */
#define SCU_LINST_ERRSYN_Pos              (5UL)                     /*!< SCU LINST: ERRSYN (Bit 5)                             */
#define SCU_LINST_ERRSYN_Msk              (0x20UL)                  /*!< SCU LINST: ERRSYN (Bitfield-Mask: 0x01)               */
#define SCU_LINST_EOFSYN_Pos              (4UL)                     /*!< SCU LINST: EOFSYN (Bit 4)                             */
#define SCU_LINST_EOFSYN_Msk              (0x10UL)                  /*!< SCU LINST: EOFSYN (Bitfield-Mask: 0x01)               */
#define SCU_LINST_BRK_Pos                 (3UL)                     /*!< SCU LINST: BRK (Bit 3)                                */
#define SCU_LINST_BRK_Msk                 (0x8UL)                   /*!< SCU LINST: BRK (Bitfield-Mask: 0x01)                  */
#define SCU_LINST_BGSEL_Pos               (1UL)                     /*!< SCU LINST: BGSEL (Bit 1)                              */
#define SCU_LINST_BGSEL_Msk               (0x6UL)                   /*!< SCU LINST: BGSEL (Bitfield-Mask: 0x03)                */
#define SCU_LINST_BRDIS_Pos               (0UL)                     /*!< SCU LINST: BRDIS (Bit 0)                              */
#define SCU_LINST_BRDIS_Msk               (0x1UL)                   /*!< SCU LINST: BRDIS (Bitfield-Mask: 0x01)                */
/* ======================================================  MEM_ACC_STS  ====================================================== */
#define SCU_MEM_ACC_STS_ROM_PROT_ERR_Pos  (4UL)                     /*!< SCU MEM_ACC_STS: ROM_PROT_ERR (Bit 4)                 */
#define SCU_MEM_ACC_STS_ROM_PROT_ERR_Msk  (0x10UL)                  /*!< SCU MEM_ACC_STS: ROM_PROT_ERR (Bitfield-Mask: 0x01)   */
#define SCU_MEM_ACC_STS_NVM_SFR_ADDR_ERR_Pos (3UL)                  /*!< SCU MEM_ACC_STS: NVM_SFR_ADDR_ERR (Bit 3)             */
#define SCU_MEM_ACC_STS_NVM_SFR_ADDR_ERR_Msk (0x8UL)                /*!< SCU MEM_ACC_STS: NVM_SFR_ADDR_ERR (Bitfield-Mask: 0x01) */
#define SCU_MEM_ACC_STS_NVM_SFR_PROT_ERR_Pos (2UL)                  /*!< SCU MEM_ACC_STS: NVM_SFR_PROT_ERR (Bit 2)             */
#define SCU_MEM_ACC_STS_NVM_SFR_PROT_ERR_Msk (0x4UL)                /*!< SCU MEM_ACC_STS: NVM_SFR_PROT_ERR (Bitfield-Mask: 0x01) */
#define SCU_MEM_ACC_STS_NVM_ADDR_ERR_Pos  (1UL)                     /*!< SCU MEM_ACC_STS: NVM_ADDR_ERR (Bit 1)                 */
#define SCU_MEM_ACC_STS_NVM_ADDR_ERR_Msk  (0x2UL)                   /*!< SCU MEM_ACC_STS: NVM_ADDR_ERR (Bitfield-Mask: 0x01)   */
#define SCU_MEM_ACC_STS_NVM_PROT_ERR_Pos  (0UL)                     /*!< SCU MEM_ACC_STS: NVM_PROT_ERR (Bit 0)                 */
#define SCU_MEM_ACC_STS_NVM_PROT_ERR_Msk  (0x1UL)                   /*!< SCU MEM_ACC_STS: NVM_PROT_ERR (Bitfield-Mask: 0x01)   */
/* ========================================================  MEMSTAT  ======================================================== */
#define SCU_MEMSTAT_RAM_TEST_MODE_Pos     (22UL)                    /*!< SCU MEMSTAT: RAM_TEST_MODE (Bit 22)                   */
#define SCU_MEMSTAT_RAM_TEST_MODE_Msk     (0x400000UL)              /*!< SCU MEMSTAT: RAM_TEST_MODE (Bitfield-Mask: 0x01)      */
#define SCU_MEMSTAT_RAM_VAL_KEYS_Pos      (20UL)                    /*!< SCU MEMSTAT: RAM_VAL_KEYS (Bit 20)                    */
#define SCU_MEMSTAT_RAM_VAL_KEYS_Msk      (0x300000UL)              /*!< SCU MEMSTAT: RAM_VAL_KEYS (Bitfield-Mask: 0x03)       */
#define SCU_MEMSTAT_NVM_DATA_MODE_Pos     (18UL)                    /*!< SCU MEMSTAT: NVM_DATA_MODE (Bit 18)                   */
#define SCU_MEMSTAT_NVM_DATA_MODE_Msk     (0x40000UL)               /*!< SCU MEMSTAT: NVM_DATA_MODE (Bitfield-Mask: 0x01)      */
#define SCU_MEMSTAT_NVM_VAL_KEYS_Pos      (16UL)                    /*!< SCU MEMSTAT: NVM_VAL_KEYS (Bit 16)                    */
#define SCU_MEMSTAT_NVM_VAL_KEYS_Msk      (0x30000UL)               /*!< SCU MEMSTAT: NVM_VAL_KEYS (Bitfield-Mask: 0x03)       */
#define SCU_MEMSTAT_SASTATUS_Pos          (6UL)                     /*!< SCU MEMSTAT: SASTATUS (Bit 6)                         */
#define SCU_MEMSTAT_SASTATUS_Msk          (0xc0UL)                  /*!< SCU MEMSTAT: SASTATUS (Bitfield-Mask: 0x03)           */
#define SCU_MEMSTAT_SECTORINFO_Pos        (0UL)                     /*!< SCU MEMSTAT: SECTORINFO (Bit 0)                       */
#define SCU_MEMSTAT_SECTORINFO_Msk        (0x3fUL)                  /*!< SCU MEMSTAT: SECTORINFO (Bitfield-Mask: 0x3f)         */
/* ========================================================  MODIEN1  ======================================================== */
#define SCU_MODIEN1_RIREN2_Pos            (10UL)                    /*!< SCU MODIEN1: RIREN2 (Bit 10)                          */
#define SCU_MODIEN1_RIREN2_Msk            (0x400UL)                 /*!< SCU MODIEN1: RIREN2 (Bitfield-Mask: 0x01)             */
#define SCU_MODIEN1_TIREN2_Pos            (9UL)                     /*!< SCU MODIEN1: TIREN2 (Bit 9)                           */
#define SCU_MODIEN1_TIREN2_Msk            (0x200UL)                 /*!< SCU MODIEN1: TIREN2 (Bitfield-Mask: 0x01)             */
#define SCU_MODIEN1_EIREN2_Pos            (8UL)                     /*!< SCU MODIEN1: EIREN2 (Bit 8)                           */
#define SCU_MODIEN1_EIREN2_Msk            (0x100UL)                 /*!< SCU MODIEN1: EIREN2 (Bitfield-Mask: 0x01)             */
#define SCU_MODIEN1_RIREN1_Pos            (2UL)                     /*!< SCU MODIEN1: RIREN1 (Bit 2)                           */
#define SCU_MODIEN1_RIREN1_Msk            (0x4UL)                   /*!< SCU MODIEN1: RIREN1 (Bitfield-Mask: 0x01)             */
#define SCU_MODIEN1_TIREN1_Pos            (1UL)                     /*!< SCU MODIEN1: TIREN1 (Bit 1)                           */
#define SCU_MODIEN1_TIREN1_Msk            (0x2UL)                   /*!< SCU MODIEN1: TIREN1 (Bitfield-Mask: 0x01)             */
#define SCU_MODIEN1_EIREN1_Pos            (0UL)                     /*!< SCU MODIEN1: EIREN1 (Bit 0)                           */
#define SCU_MODIEN1_EIREN1_Msk            (0x1UL)                   /*!< SCU MODIEN1: EIREN1 (Bitfield-Mask: 0x01)             */
/* ========================================================  MODIEN2  ======================================================== */
#define SCU_MODIEN2_TIEN2_Pos             (7UL)                     /*!< SCU MODIEN2: TIEN2 (Bit 7)                            */
#define SCU_MODIEN2_TIEN2_Msk             (0x80UL)                  /*!< SCU MODIEN2: TIEN2 (Bitfield-Mask: 0x01)              */
#define SCU_MODIEN2_RIEN2_Pos             (6UL)                     /*!< SCU MODIEN2: RIEN2 (Bit 6)                            */
#define SCU_MODIEN2_RIEN2_Msk             (0x40UL)                  /*!< SCU MODIEN2: RIEN2 (Bitfield-Mask: 0x01)              */
#define SCU_MODIEN2_EXINT2_EN_Pos         (5UL)                     /*!< SCU MODIEN2: EXINT2_EN (Bit 5)                        */
#define SCU_MODIEN2_EXINT2_EN_Msk         (0x20UL)                  /*!< SCU MODIEN2: EXINT2_EN (Bitfield-Mask: 0x01)          */
#define SCU_MODIEN2_TIEN1_Pos             (1UL)                     /*!< SCU MODIEN2: TIEN1 (Bit 1)                            */
#define SCU_MODIEN2_TIEN1_Msk             (0x2UL)                   /*!< SCU MODIEN2: TIEN1 (Bitfield-Mask: 0x01)              */
#define SCU_MODIEN2_RIEN1_Pos             (0UL)                     /*!< SCU MODIEN2: RIEN1 (Bit 0)                            */
#define SCU_MODIEN2_RIEN1_Msk             (0x1UL)                   /*!< SCU MODIEN2: RIEN1 (Bitfield-Mask: 0x01)              */
/* ========================================================  MODIEN3  ======================================================== */
#define SCU_MODIEN3_IE0_Pos               (0UL)                     /*!< SCU MODIEN3: IE0 (Bit 0)                              */
