Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
#define SCU_MODIEN3_IE0_Msk               (0x1UL)                   /*!< SCU MODIEN3: IE0 (Bitfield-Mask: 0x01)                */
/* ========================================================  MODIEN4  ======================================================== */
#define SCU_MODIEN4_IE1_Pos               (0UL)                     /*!< SCU MODIEN4: IE1 (Bit 0)                              */
#define SCU_MODIEN4_IE1_Msk               (0x1UL)                   /*!< SCU MODIEN4: IE1 (Bitfield-Mask: 0x01)                */
/* =======================================================  MODPISEL  ======================================================== */
#define SCU_MODPISEL_SSC12_S_MRST_OUTSEL_Pos (18UL)                 /*!< SCU MODPISEL: SSC12_S_MRST_OUTSEL (Bit 18)            */
#define SCU_MODPISEL_SSC12_S_MRST_OUTSEL_Msk (0x40000UL)            /*!< SCU MODPISEL: SSC12_S_MRST_OUTSEL (Bitfield-Mask: 0x01) */
#define SCU_MODPISEL_SSC12_M_MTSR_OUTSEL_Pos (17UL)                 /*!< SCU MODPISEL: SSC12_M_MTSR_OUTSEL (Bit 17)            */
#define SCU_MODPISEL_SSC12_M_MTSR_OUTSEL_Msk (0x20000UL)            /*!< SCU MODPISEL: SSC12_M_MTSR_OUTSEL (Bitfield-Mask: 0x01) */
#define SCU_MODPISEL_SSC12_M_SCK_OUTSEL_Pos (16UL)                  /*!< SCU MODPISEL: SSC12_M_SCK_OUTSEL (Bit 16)             */
#define SCU_MODPISEL_SSC12_M_SCK_OUTSEL_Msk (0x10000UL)             /*!< SCU MODPISEL: SSC12_M_SCK_OUTSEL (Bitfield-Mask: 0x01) */
#define SCU_MODPISEL_U_TX_CONDIS_Pos      (7UL)                     /*!< SCU MODPISEL: U_TX_CONDIS (Bit 7)                     */
#define SCU_MODPISEL_U_TX_CONDIS_Msk      (0x80UL)                  /*!< SCU MODPISEL: U_TX_CONDIS (Bitfield-Mask: 0x01)       */
#define SCU_MODPISEL_URIOS1_Pos           (6UL)                     /*!< SCU MODPISEL: URIOS1 (Bit 6)                          */
#define SCU_MODPISEL_URIOS1_Msk           (0x40UL)                  /*!< SCU MODPISEL: URIOS1 (Bitfield-Mask: 0x01)            */
#define SCU_MODPISEL_EXINT2IS_Pos         (4UL)                     /*!< SCU MODPISEL: EXINT2IS (Bit 4)                        */
#define SCU_MODPISEL_EXINT2IS_Msk         (0x30UL)                  /*!< SCU MODPISEL: EXINT2IS (Bitfield-Mask: 0x03)          */
#define SCU_MODPISEL_EXINT1IS_Pos         (2UL)                     /*!< SCU MODPISEL: EXINT1IS (Bit 2)                        */
#define SCU_MODPISEL_EXINT1IS_Msk         (0xcUL)                   /*!< SCU MODPISEL: EXINT1IS (Bitfield-Mask: 0x03)          */
#define SCU_MODPISEL_EXINT0IS_Pos         (0UL)                     /*!< SCU MODPISEL: EXINT0IS (Bit 0)                        */
#define SCU_MODPISEL_EXINT0IS_Msk         (0x3UL)                   /*!< SCU MODPISEL: EXINT0IS (Bitfield-Mask: 0x03)          */
/* =======================================================  MODPISEL1  ======================================================= */
#define SCU_MODPISEL1_T21EXCON_Pos        (7UL)                     /*!< SCU MODPISEL1: T21EXCON (Bit 7)                       */
#define SCU_MODPISEL1_T21EXCON_Msk        (0x80UL)                  /*!< SCU MODPISEL1: T21EXCON (Bitfield-Mask: 0x01)         */
#define SCU_MODPISEL1_T2EXCON_Pos         (6UL)                     /*!< SCU MODPISEL1: T2EXCON (Bit 6)                        */
#define SCU_MODPISEL1_T2EXCON_Msk         (0x40UL)                  /*!< SCU MODPISEL1: T2EXCON (Bitfield-Mask: 0x01)          */
/* =======================================================  MODPISEL2  ======================================================= */
#define SCU_MODPISEL2_T21EXISCNF_Pos      (10UL)                    /*!< SCU MODPISEL2: T21EXISCNF (Bit 10)                    */
#define SCU_MODPISEL2_T21EXISCNF_Msk      (0xc00UL)                 /*!< SCU MODPISEL2: T21EXISCNF (Bitfield-Mask: 0x03)       */
#define SCU_MODPISEL2_T2EXISCNF_Pos       (8UL)                     /*!< SCU MODPISEL2: T2EXISCNF (Bit 8)                      */
#define SCU_MODPISEL2_T2EXISCNF_Msk       (0x300UL)                 /*!< SCU MODPISEL2: T2EXISCNF (Bitfield-Mask: 0x03)        */
#define SCU_MODPISEL2_T21EXIS_Pos         (6UL)                     /*!< SCU MODPISEL2: T21EXIS (Bit 6)                        */
#define SCU_MODPISEL2_T21EXIS_Msk         (0xc0UL)                  /*!< SCU MODPISEL2: T21EXIS (Bitfield-Mask: 0x03)          */
#define SCU_MODPISEL2_T2EXIS_Pos          (4UL)                     /*!< SCU MODPISEL2: T2EXIS (Bit 4)                         */
#define SCU_MODPISEL2_T2EXIS_Msk          (0x30UL)                  /*!< SCU MODPISEL2: T2EXIS (Bitfield-Mask: 0x03)           */
#define SCU_MODPISEL2_T21IS_Pos           (2UL)                     /*!< SCU MODPISEL2: T21IS (Bit 2)                          */
#define SCU_MODPISEL2_T21IS_Msk           (0xcUL)                   /*!< SCU MODPISEL2: T21IS (Bitfield-Mask: 0x03)            */
#define SCU_MODPISEL2_T2IS_Pos            (0UL)                     /*!< SCU MODPISEL2: T2IS (Bit 0)                           */
#define SCU_MODPISEL2_T2IS_Msk            (0x3UL)                   /*!< SCU MODPISEL2: T2IS (Bitfield-Mask: 0x03)             */
/* =======================================================  MODPISEL3  ======================================================= */
#define SCU_MODPISEL3_URIOS2_Pos          (6UL)                     /*!< SCU MODPISEL3: URIOS2 (Bit 6)                         */
#define SCU_MODPISEL3_URIOS2_Msk          (0x40UL)                  /*!< SCU MODPISEL3: URIOS2 (Bitfield-Mask: 0x01)           */
/* =======================================================  MODPISEL4  ======================================================= */
#define SCU_MODPISEL4_DU4TRIGGEN_Pos      (24UL)                    /*!< SCU MODPISEL4: DU4TRIGGEN (Bit 24)                    */
#define SCU_MODPISEL4_DU4TRIGGEN_Msk      (0x7000000UL)             /*!< SCU MODPISEL4: DU4TRIGGEN (Bitfield-Mask: 0x07)       */
#define SCU_MODPISEL4_DU3TRIGGEN_Pos      (16UL)                    /*!< SCU MODPISEL4: DU3TRIGGEN (Bit 16)                    */
#define SCU_MODPISEL4_DU3TRIGGEN_Msk      (0x70000UL)               /*!< SCU MODPISEL4: DU3TRIGGEN (Bitfield-Mask: 0x07)       */
#define SCU_MODPISEL4_DU2TRIGGEN_Pos      (8UL)                     /*!< SCU MODPISEL4: DU2TRIGGEN (Bit 8)                     */
#define SCU_MODPISEL4_DU2TRIGGEN_Msk      (0x700UL)                 /*!< SCU MODPISEL4: DU2TRIGGEN (Bitfield-Mask: 0x07)       */
#define SCU_MODPISEL4_DU1TRIGGEN_Pos      (0UL)                     /*!< SCU MODPISEL4: DU1TRIGGEN (Bit 0)                     */
#define SCU_MODPISEL4_DU1TRIGGEN_Msk      (0x7UL)                   /*!< SCU MODPISEL4: DU1TRIGGEN (Bitfield-Mask: 0x07)       */
/* ========================================================  MODSUSP  ======================================================== */
#define SCU_MODSUSP_ADC1_SUSP_Pos         (10UL)                    /*!< SCU MODSUSP: ADC1_SUSP (Bit 10)                       */
#define SCU_MODSUSP_ADC1_SUSP_Msk         (0x400UL)                 /*!< SCU MODSUSP: ADC1_SUSP (Bitfield-Mask: 0x01)          */
#define SCU_MODSUSP_MU_SUSP_Pos           (9UL)                     /*!< SCU MODSUSP: MU_SUSP (Bit 9)                          */
#define SCU_MODSUSP_MU_SUSP_Msk           (0x200UL)                 /*!< SCU MODSUSP: MU_SUSP (Bitfield-Mask: 0x01)            */
#define SCU_MODSUSP_WDT1SUSP_Pos          (7UL)                     /*!< SCU MODSUSP: WDT1SUSP (Bit 7)                         */
#define SCU_MODSUSP_WDT1SUSP_Msk          (0x80UL)                  /*!< SCU MODSUSP: WDT1SUSP (Bitfield-Mask: 0x01)           */
#define SCU_MODSUSP_T21_SUSP_Pos          (6UL)                     /*!< SCU MODSUSP: T21_SUSP (Bit 6)                         */
#define SCU_MODSUSP_T21_SUSP_Msk          (0x40UL)                  /*!< SCU MODSUSP: T21_SUSP (Bitfield-Mask: 0x01)           */
#define SCU_MODSUSP_GPT12_SUSP_Pos        (4UL)                     /*!< SCU MODSUSP: GPT12_SUSP (Bit 4)                       */
#define SCU_MODSUSP_GPT12_SUSP_Msk        (0x10UL)                  /*!< SCU MODSUSP: GPT12_SUSP (Bitfield-Mask: 0x01)         */
#define SCU_MODSUSP_T2_SUSP_Pos           (3UL)                     /*!< SCU MODSUSP: T2_SUSP (Bit 3)                          */
#define SCU_MODSUSP_T2_SUSP_Msk           (0x8UL)                   /*!< SCU MODSUSP: T2_SUSP (Bitfield-Mask: 0x01)            */
#define SCU_MODSUSP_T13SUSP_Pos           (2UL)                     /*!< SCU MODSUSP: T13SUSP (Bit 2)                          */
#define SCU_MODSUSP_T13SUSP_Msk           (0x4UL)                   /*!< SCU MODSUSP: T13SUSP (Bitfield-Mask: 0x01)            */
#define SCU_MODSUSP_T12SUSP_Pos           (1UL)                     /*!< SCU MODSUSP: T12SUSP (Bit 1)                          */
#define SCU_MODSUSP_T12SUSP_Msk           (0x2UL)                   /*!< SCU MODSUSP: T12SUSP (Bitfield-Mask: 0x01)            */
#define SCU_MODSUSP_WDTSUSP_Pos           (0UL)                     /*!< SCU MODSUSP: WDTSUSP (Bit 0)                          */
#define SCU_MODSUSP_WDTSUSP_Msk           (0x1UL)                   /*!< SCU MODSUSP: WDTSUSP (Bitfield-Mask: 0x01)            */
/* ========================================================  MONIEN  ========================================================= */
#define SCU_MONIEN_MON4IE_Pos             (3UL)                     /*!< SCU MONIEN: MON4IE (Bit 3)                            */
#define SCU_MONIEN_MON4IE_Msk             (0x8UL)                   /*!< SCU MONIEN: MON4IE (Bitfield-Mask: 0x01)              */
#define SCU_MONIEN_MON3IE_Pos             (2UL)                     /*!< SCU MONIEN: MON3IE (Bit 2)                            */
#define SCU_MONIEN_MON3IE_Msk             (0x4UL)                   /*!< SCU MONIEN: MON3IE (Bitfield-Mask: 0x01)              */
#define SCU_MONIEN_MON2IE_Pos             (1UL)                     /*!< SCU MONIEN: MON2IE (Bit 1)                            */
#define SCU_MONIEN_MON2IE_Msk             (0x2UL)                   /*!< SCU MONIEN: MON2IE (Bitfield-Mask: 0x01)              */
#define SCU_MONIEN_MON1IE_Pos             (0UL)                     /*!< SCU MONIEN: MON1IE (Bit 0)                            */
#define SCU_MONIEN_MON1IE_Msk             (0x1UL)                   /*!< SCU MONIEN: MON1IE (Bitfield-Mask: 0x01)              */
/* ========================================================  NMICON  ========================================================= */
#define SCU_NMICON_NMISTOF_Pos            (8UL)                     /*!< SCU NMICON: NMISTOF (Bit 8)                           */
#define SCU_NMICON_NMISTOF_Msk            (0x100UL)                 /*!< SCU NMICON: NMISTOF (Bitfield-Mask: 0x01)             */
#define SCU_NMICON_NMISUP_Pos             (7UL)                     /*!< SCU NMICON: NMISUP (Bit 7)                            */
#define SCU_NMICON_NMISUP_Msk             (0x80UL)                  /*!< SCU NMICON: NMISUP (Bitfield-Mask: 0x01)              */
#define SCU_NMICON_NMIECC_Pos             (6UL)                     /*!< SCU NMICON: NMIECC (Bit 6)                            */
#define SCU_NMICON_NMIECC_Msk             (0x40UL)                  /*!< SCU NMICON: NMIECC (Bitfield-Mask: 0x01)              */
#define SCU_NMICON_NMIMAP_Pos             (5UL)                     /*!< SCU NMICON: NMIMAP (Bit 5)                            */
#define SCU_NMICON_NMIMAP_Msk             (0x20UL)                  /*!< SCU NMICON: NMIMAP (Bitfield-Mask: 0x01)              */
#define SCU_NMICON_NMIOWD_Pos             (4UL)                     /*!< SCU NMICON: NMIOWD (Bit 4)                            */
#define SCU_NMICON_NMIOWD_Msk             (0x10UL)                  /*!< SCU NMICON: NMIOWD (Bitfield-Mask: 0x01)              */
#define SCU_NMICON_NMIOT_Pos              (3UL)                     /*!< SCU NMICON: NMIOT (Bit 3)                             */
#define SCU_NMICON_NMIOT_Msk              (0x8UL)                   /*!< SCU NMICON: NMIOT (Bitfield-Mask: 0x01)               */
#define SCU_NMICON_NMIPLL_Pos             (1UL)                     /*!< SCU NMICON: NMIPLL (Bit 1)                            */
#define SCU_NMICON_NMIPLL_Msk             (0x2UL)                   /*!< SCU NMICON: NMIPLL (Bitfield-Mask: 0x01)              */
#define SCU_NMICON_NMIWDT_Pos             (0UL)                     /*!< SCU NMICON: NMIWDT (Bit 0)                            */
#define SCU_NMICON_NMIWDT_Msk             (0x1UL)                   /*!< SCU NMICON: NMIWDT (Bitfield-Mask: 0x01)              */
/* =========================================================  NMISR  ========================================================= */
#define SCU_NMISR_FNMISTOF_Pos            (8UL)                     /*!< SCU NMISR: FNMISTOF (Bit 8)                           */
#define SCU_NMISR_FNMISTOF_Msk            (0x100UL)                 /*!< SCU NMISR: FNMISTOF (Bitfield-Mask: 0x01)             */
#define SCU_NMISR_FNMISUP_Pos             (7UL)                     /*!< SCU NMISR: FNMISUP (Bit 7)                            */
#define SCU_NMISR_FNMISUP_Msk             (0x80UL)                  /*!< SCU NMISR: FNMISUP (Bitfield-Mask: 0x01)              */
#define SCU_NMISR_FNMIECC_Pos             (6UL)                     /*!< SCU NMISR: FNMIECC (Bit 6)                            */
#define SCU_NMISR_FNMIECC_Msk             (0x40UL)                  /*!< SCU NMISR: FNMIECC (Bitfield-Mask: 0x01)              */
#define SCU_NMISR_FNMIMAP_Pos             (5UL)                     /*!< SCU NMISR: FNMIMAP (Bit 5)                            */
#define SCU_NMISR_FNMIMAP_Msk             (0x20UL)                  /*!< SCU NMISR: FNMIMAP (Bitfield-Mask: 0x01)              */
#define SCU_NMISR_FNMIOWD_Pos             (4UL)                     /*!< SCU NMISR: FNMIOWD (Bit 4)                            */
#define SCU_NMISR_FNMIOWD_Msk             (0x10UL)                  /*!< SCU NMISR: FNMIOWD (Bitfield-Mask: 0x01)              */
#define SCU_NMISR_FNMIOT_Pos              (3UL)                     /*!< SCU NMISR: FNMIOT (Bit 3)                             */
#define SCU_NMISR_FNMIOT_Msk              (0x8UL)                   /*!< SCU NMISR: FNMIOT (Bitfield-Mask: 0x01)               */
#define SCU_NMISR_FNMIPLL_Pos             (1UL)                     /*!< SCU NMISR: FNMIPLL (Bit 1)                            */
#define SCU_NMISR_FNMIPLL_Msk             (0x2UL)                   /*!< SCU NMISR: FNMIPLL (Bitfield-Mask: 0x01)              */
#define SCU_NMISR_FNMIWDT_Pos             (0UL)                     /*!< SCU NMISR: FNMIWDT (Bit 0)                            */
#define SCU_NMISR_FNMIWDT_Msk             (0x1UL)                   /*!< SCU NMISR: FNMIWDT (Bitfield-Mask: 0x01)              */
/* =======================================================  NMISRCLR  ======================================================== */
#define SCU_NMISRCLR_FNMIMAPC_Pos         (5UL)                     /*!< SCU NMISRCLR: FNMIMAPC (Bit 5)                        */
#define SCU_NMISRCLR_FNMIMAPC_Msk         (0x20UL)                  /*!< SCU NMISRCLR: FNMIMAPC (Bitfield-Mask: 0x01)          */
#define SCU_NMISRCLR_FNMIOWDC_Pos         (4UL)                     /*!< SCU NMISRCLR: FNMIOWDC (Bit 4)                        */
#define SCU_NMISRCLR_FNMIOWDC_Msk         (0x10UL)                  /*!< SCU NMISRCLR: FNMIOWDC (Bitfield-Mask: 0x01)          */
#define SCU_NMISRCLR_FNMIPLLC_Pos         (1UL)                     /*!< SCU NMISRCLR: FNMIPLLC (Bit 1)                        */
#define SCU_NMISRCLR_FNMIPLLC_Msk         (0x2UL)                   /*!< SCU NMISRCLR: FNMIPLLC (Bitfield-Mask: 0x01)          */
#define SCU_NMISRCLR_FNMIWDTC_Pos         (0UL)                     /*!< SCU NMISRCLR: FNMIWDTC (Bit 0)                        */
#define SCU_NMISRCLR_FNMIWDTC_Msk         (0x1UL)                   /*!< SCU NMISRCLR: FNMIWDTC (Bitfield-Mask: 0x01)          */
/* =====================================================  NVM_PROT_STS  ====================================================== */
#define SCU_NVM_PROT_STS_DAT_LIN_SIZE_Pos (26UL)                    /*!< SCU NVM_PROT_STS: DAT_LIN_SIZE (Bit 26)               */
#define SCU_NVM_PROT_STS_DAT_LIN_SIZE_Msk (0xc000000UL)             /*!< SCU NVM_PROT_STS: DAT_LIN_SIZE (Bitfield-Mask: 0x03)  */
#define SCU_NVM_PROT_STS_CUS_BSL_SIZE_Pos (24UL)                    /*!< SCU NVM_PROT_STS: CUS_BSL_SIZE (Bit 24)               */
#define SCU_NVM_PROT_STS_CUS_BSL_SIZE_Msk (0x3000000UL)             /*!< SCU NVM_PROT_STS: CUS_BSL_SIZE (Bitfield-Mask: 0x03)  */
#define SCU_NVM_PROT_STS_DAT_NL_PW_Pos    (22UL)                    /*!< SCU NVM_PROT_STS: DAT_NL_PW (Bit 22)                  */
#define SCU_NVM_PROT_STS_DAT_NL_PW_Msk    (0x400000UL)              /*!< SCU NVM_PROT_STS: DAT_NL_PW (Bitfield-Mask: 0x01)     */
#define SCU_NVM_PROT_STS_DAT_LIN_PW_Pos   (21UL)                    /*!< SCU NVM_PROT_STS: DAT_LIN_PW (Bit 21)                 */
#define SCU_NVM_PROT_STS_DAT_LIN_PW_Msk   (0x200000UL)              /*!< SCU NVM_PROT_STS: DAT_LIN_PW (Bitfield-Mask: 0x01)    */
#define SCU_NVM_PROT_STS_COD_LIN_PW_Pos   (20UL)                    /*!< SCU NVM_PROT_STS: COD_LIN_PW (Bit 20)                 */
#define SCU_NVM_PROT_STS_COD_LIN_PW_Msk   (0x100000UL)              /*!< SCU NVM_PROT_STS: COD_LIN_PW (Bitfield-Mask: 0x01)    */
#define SCU_NVM_PROT_STS_CUS_BSL_PW_Pos   (19UL)                    /*!< SCU NVM_PROT_STS: CUS_BSL_PW (Bit 19)                 */
#define SCU_NVM_PROT_STS_CUS_BSL_PW_Msk   (0x80000UL)               /*!< SCU NVM_PROT_STS: CUS_BSL_PW (Bitfield-Mask: 0x01)    */
#define SCU_NVM_PROT_STS_DIS_RDUS_S0_Pos  (18UL)                    /*!< SCU NVM_PROT_STS: DIS_RDUS_S0 (Bit 18)                */
#define SCU_NVM_PROT_STS_DIS_RDUS_S0_Msk  (0x40000UL)               /*!< SCU NVM_PROT_STS: DIS_RDUS_S0 (Bitfield-Mask: 0x01)   */
#define SCU_NVM_PROT_STS_DIS_RDUS_Pos     (17UL)                    /*!< SCU NVM_PROT_STS: DIS_RDUS (Bit 17)                   */
#define SCU_NVM_PROT_STS_DIS_RDUS_Msk     (0x20000UL)               /*!< SCU NVM_PROT_STS: DIS_RDUS (Bitfield-Mask: 0x01)      */
#define SCU_NVM_PROT_STS_EN_RD_S0_Pos     (16UL)                    /*!< SCU NVM_PROT_STS: EN_RD_S0 (Bit 16)                   */
#define SCU_NVM_PROT_STS_EN_RD_S0_Msk     (0x10000UL)               /*!< SCU NVM_PROT_STS: EN_RD_S0 (Bitfield-Mask: 0x01)      */
#define SCU_NVM_PROT_STS_EN_PRG_DAT_NL_Pos (7UL)                    /*!< SCU NVM_PROT_STS: EN_PRG_DAT_NL (Bit 7)               */
#define SCU_NVM_PROT_STS_EN_PRG_DAT_NL_Msk (0x80UL)                 /*!< SCU NVM_PROT_STS: EN_PRG_DAT_NL (Bitfield-Mask: 0x01) */
#define SCU_NVM_PROT_STS_EN_RD_DAT_NL_Pos (6UL)                     /*!< SCU NVM_PROT_STS: EN_RD_DAT_NL (Bit 6)                */
#define SCU_NVM_PROT_STS_EN_RD_DAT_NL_Msk (0x40UL)                  /*!< SCU NVM_PROT_STS: EN_RD_DAT_NL (Bitfield-Mask: 0x01)  */
#define SCU_NVM_PROT_STS_EN_PRG_DAT_LIN_Pos (5UL)                   /*!< SCU NVM_PROT_STS: EN_PRG_DAT_LIN (Bit 5)              */
#define SCU_NVM_PROT_STS_EN_PRG_DAT_LIN_Msk (0x20UL)                /*!< SCU NVM_PROT_STS: EN_PRG_DAT_LIN (Bitfield-Mask: 0x01) */
#define SCU_NVM_PROT_STS_EN_RD_DAT_LIN_Pos (4UL)                    /*!< SCU NVM_PROT_STS: EN_RD_DAT_LIN (Bit 4)               */
#define SCU_NVM_PROT_STS_EN_RD_DAT_LIN_Msk (0x10UL)                 /*!< SCU NVM_PROT_STS: EN_RD_DAT_LIN (Bitfield-Mask: 0x01) */
#define SCU_NVM_PROT_STS_EN_PRG_COD_LIN_Pos (3UL)                   /*!< SCU NVM_PROT_STS: EN_PRG_COD_LIN (Bit 3)              */
#define SCU_NVM_PROT_STS_EN_PRG_COD_LIN_Msk (0x8UL)                 /*!< SCU NVM_PROT_STS: EN_PRG_COD_LIN (Bitfield-Mask: 0x01) */
#define SCU_NVM_PROT_STS_EN_RD_COD_LIN_Pos (2UL)                    /*!< SCU NVM_PROT_STS: EN_RD_COD_LIN (Bit 2)               */
#define SCU_NVM_PROT_STS_EN_RD_COD_LIN_Msk (0x4UL)                  /*!< SCU NVM_PROT_STS: EN_RD_COD_LIN (Bitfield-Mask: 0x01) */
#define SCU_NVM_PROT_STS_EN_PRG_CUS_BSL_Pos (1UL)                   /*!< SCU NVM_PROT_STS: EN_PRG_CUS_BSL (Bit 1)              */
#define SCU_NVM_PROT_STS_EN_PRG_CUS_BSL_Msk (0x2UL)                 /*!< SCU NVM_PROT_STS: EN_PRG_CUS_BSL (Bitfield-Mask: 0x01) */
#define SCU_NVM_PROT_STS_EN_RD_CUS_BSL_Pos (0UL)                    /*!< SCU NVM_PROT_STS: EN_RD_CUS_BSL (Bit 0)               */
#define SCU_NVM_PROT_STS_EN_RD_CUS_BSL_Msk (0x1UL)                  /*!< SCU NVM_PROT_STS: EN_RD_CUS_BSL (Bitfield-Mask: 0x01) */
/* ========================================================  OSC_CON  ======================================================== */
#define SCU_OSC_CON_XPD_Pos               (4UL)                     /*!< SCU OSC_CON: XPD (Bit 4)                              */
#define SCU_OSC_CON_XPD_Msk               (0x10UL)                  /*!< SCU OSC_CON: XPD (Bitfield-Mask: 0x01)                */
#define SCU_OSC_CON_OSC2L_Pos             (3UL)                     /*!< SCU OSC_CON: OSC2L (Bit 3)                            */
#define SCU_OSC_CON_OSC2L_Msk             (0x8UL)                   /*!< SCU OSC_CON: OSC2L (Bitfield-Mask: 0x01)              */
#define SCU_OSC_CON_OSCWDTRST_Pos         (2UL)                     /*!< SCU OSC_CON: OSCWDTRST (Bit 2)                        */
#define SCU_OSC_CON_OSCWDTRST_Msk         (0x4UL)                   /*!< SCU OSC_CON: OSCWDTRST (Bitfield-Mask: 0x01)          */
#define SCU_OSC_CON_OSCSS_Pos             (0UL)                     /*!< SCU OSC_CON: OSCSS (Bit 0)                            */
#define SCU_OSC_CON_OSCSS_Msk             (0x3UL)                   /*!< SCU OSC_CON: OSCSS (Bitfield-Mask: 0x03)              */
/* =======================================================  P0_POCON0  ======================================================= */
#define SCU_P0_POCON0_P0_PDM6_Pos         (24UL)                    /*!< SCU P0_POCON0: P0_PDM6 (Bit 24)                       */
#define SCU_P0_POCON0_P0_PDM6_Msk         (0x7000000UL)             /*!< SCU P0_POCON0: P0_PDM6 (Bitfield-Mask: 0x07)          */
#define SCU_P0_POCON0_P0_PDM5_Pos         (20UL)                    /*!< SCU P0_POCON0: P0_PDM5 (Bit 20)                       */
#define SCU_P0_POCON0_P0_PDM5_Msk         (0x700000UL)              /*!< SCU P0_POCON0: P0_PDM5 (Bitfield-Mask: 0x07)          */
#define SCU_P0_POCON0_P0_PDM4_Pos         (16UL)                    /*!< SCU P0_POCON0: P0_PDM4 (Bit 16)                       */
#define SCU_P0_POCON0_P0_PDM4_Msk         (0x70000UL)               /*!< SCU P0_POCON0: P0_PDM4 (Bitfield-Mask: 0x07)          */
#define SCU_P0_POCON0_P0_PDM3_Pos         (12UL)                    /*!< SCU P0_POCON0: P0_PDM3 (Bit 12)                       */
#define SCU_P0_POCON0_P0_PDM3_Msk         (0x7000UL)                /*!< SCU P0_POCON0: P0_PDM3 (Bitfield-Mask: 0x07)          */
#define SCU_P0_POCON0_P0_PDM2_Pos         (8UL)                     /*!< SCU P0_POCON0: P0_PDM2 (Bit 8)                        */
#define SCU_P0_POCON0_P0_PDM2_Msk         (0x700UL)                 /*!< SCU P0_POCON0: P0_PDM2 (Bitfield-Mask: 0x07)          */
#define SCU_P0_POCON0_P0_PDM1_Pos         (4UL)                     /*!< SCU P0_POCON0: P0_PDM1 (Bit 4)                        */
#define SCU_P0_POCON0_P0_PDM1_Msk         (0x70UL)                  /*!< SCU P0_POCON0: P0_PDM1 (Bitfield-Mask: 0x07)          */
#define SCU_P0_POCON0_P0_PDM0_Pos         (0UL)                     /*!< SCU P0_POCON0: P0_PDM0 (Bit 0)                        */
#define SCU_P0_POCON0_P0_PDM0_Msk         (0x7UL)                   /*!< SCU P0_POCON0: P0_PDM0 (Bitfield-Mask: 0x07)          */
/* =======================================================  P1_POCON0  ======================================================= */
#define SCU_P1_POCON0_P1_PDM4_Pos         (16UL)                    /*!< SCU P1_POCON0: P1_PDM4 (Bit 16)                       */
#define SCU_P1_POCON0_P1_PDM4_Msk         (0x70000UL)               /*!< SCU P1_POCON0: P1_PDM4 (Bitfield-Mask: 0x07)          */
