Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
#define SCU_P1_POCON0_P1_PDM2_Pos         (8UL)                     /*!< SCU P1_POCON0: P1_PDM2 (Bit 8)                        */
#define SCU_P1_POCON0_P1_PDM2_Msk         (0x700UL)                 /*!< SCU P1_POCON0: P1_PDM2 (Bitfield-Mask: 0x07)          */
#define SCU_P1_POCON0_P1_PDM1_Pos         (4UL)                     /*!< SCU P1_POCON0: P1_PDM1 (Bit 4)                        */
#define SCU_P1_POCON0_P1_PDM1_Msk         (0x70UL)                  /*!< SCU P1_POCON0: P1_PDM1 (Bitfield-Mask: 0x07)          */
#define SCU_P1_POCON0_P1_PDM0_Pos         (0UL)                     /*!< SCU P1_POCON0: P1_PDM0 (Bit 0)                        */
#define SCU_P1_POCON0_P1_PDM0_Msk         (0x7UL)                   /*!< SCU P1_POCON0: P1_PDM0 (Bitfield-Mask: 0x07)          */
/* ========================================================  PASSWD  ========================================================= */
#define SCU_PASSWD_PASS_Pos               (3UL)                     /*!< SCU PASSWD: PASS (Bit 3)                              */
#define SCU_PASSWD_PASS_Msk               (0xf8UL)                  /*!< SCU PASSWD: PASS (Bitfield-Mask: 0x1f)                */
#define SCU_PASSWD_PROTECT_S_Pos          (2UL)                     /*!< SCU PASSWD: PROTECT_S (Bit 2)                         */
#define SCU_PASSWD_PROTECT_S_Msk          (0x4UL)                   /*!< SCU PASSWD: PROTECT_S (Bitfield-Mask: 0x01)           */
#define SCU_PASSWD_PW_MODE_Pos            (0UL)                     /*!< SCU PASSWD: PW_MODE (Bit 0)                           */
#define SCU_PASSWD_PW_MODE_Msk            (0x3UL)                   /*!< SCU PASSWD: PW_MODE (Bitfield-Mask: 0x03)             */
/* ========================================================  PLL_CON  ======================================================== */
#define SCU_PLL_CON_UNPROT_VCOBYP_Pos     (19UL)                    /*!< SCU PLL_CON: UNPROT_VCOBYP (Bit 19)                   */
#define SCU_PLL_CON_UNPROT_VCOBYP_Msk     (0x80000UL)               /*!< SCU PLL_CON: UNPROT_VCOBYP (Bitfield-Mask: 0x01)      */
#define SCU_PLL_CON_UNPROT_OSCDISC_Pos    (18UL)                    /*!< SCU PLL_CON: UNPROT_OSCDISC (Bit 18)                  */
#define SCU_PLL_CON_UNPROT_OSCDISC_Msk    (0x40000UL)               /*!< SCU PLL_CON: UNPROT_OSCDISC (Bitfield-Mask: 0x01)     */
#define SCU_PLL_CON_NDIV_Pos              (8UL)                     /*!< SCU PLL_CON: NDIV (Bit 8)                             */
#define SCU_PLL_CON_NDIV_Msk              (0xff00UL)                /*!< SCU PLL_CON: NDIV (Bitfield-Mask: 0xff)               */
#define SCU_PLL_CON_VCOBYP_Pos            (3UL)                     /*!< SCU PLL_CON: VCOBYP (Bit 3)                           */
#define SCU_PLL_CON_VCOBYP_Msk            (0x8UL)                   /*!< SCU PLL_CON: VCOBYP (Bitfield-Mask: 0x01)             */
#define SCU_PLL_CON_OSCDISC_Pos           (2UL)                     /*!< SCU PLL_CON: OSCDISC (Bit 2)                          */
#define SCU_PLL_CON_OSCDISC_Msk           (0x4UL)                   /*!< SCU PLL_CON: OSCDISC (Bitfield-Mask: 0x01)            */
#define SCU_PLL_CON_RESLD_Pos             (1UL)                     /*!< SCU PLL_CON: RESLD (Bit 1)                            */
#define SCU_PLL_CON_RESLD_Msk             (0x2UL)                   /*!< SCU PLL_CON: RESLD (Bitfield-Mask: 0x01)              */
#define SCU_PLL_CON_LOCK_Pos              (0UL)                     /*!< SCU PLL_CON: LOCK (Bit 0)                             */
#define SCU_PLL_CON_LOCK_Msk              (0x1UL)                   /*!< SCU PLL_CON: LOCK (Bitfield-Mask: 0x01)               */
/* =========================================================  PMCON  ========================================================= */
#define SCU_PMCON_T21_DIS_Pos             (10UL)                    /*!< SCU PMCON: T21_DIS (Bit 10)                           */
#define SCU_PMCON_T21_DIS_Msk             (0x400UL)                 /*!< SCU PMCON: T21_DIS (Bitfield-Mask: 0x01)              */
#define SCU_PMCON_SSC2_DIS_Pos            (8UL)                     /*!< SCU PMCON: SSC2_DIS (Bit 8)                           */
#define SCU_PMCON_SSC2_DIS_Msk            (0x100UL)                 /*!< SCU PMCON: SSC2_DIS (Bitfield-Mask: 0x01)             */
#define SCU_PMCON_GPT12_DIS_Pos           (4UL)                     /*!< SCU PMCON: GPT12_DIS (Bit 4)                          */
#define SCU_PMCON_GPT12_DIS_Msk           (0x10UL)                  /*!< SCU PMCON: GPT12_DIS (Bitfield-Mask: 0x01)            */
#define SCU_PMCON_T2_DIS_Pos              (3UL)                     /*!< SCU PMCON: T2_DIS (Bit 3)                             */
#define SCU_PMCON_T2_DIS_Msk              (0x8UL)                   /*!< SCU PMCON: T2_DIS (Bitfield-Mask: 0x01)               */
#define SCU_PMCON_CCU_DIS_Pos             (2UL)                     /*!< SCU PMCON: CCU_DIS (Bit 2)                            */
#define SCU_PMCON_CCU_DIS_Msk             (0x4UL)                   /*!< SCU PMCON: CCU_DIS (Bitfield-Mask: 0x01)              */
#define SCU_PMCON_SSC1_DIS_Pos            (1UL)                     /*!< SCU PMCON: SSC1_DIS (Bit 1)                           */
#define SCU_PMCON_SSC1_DIS_Msk            (0x2UL)                   /*!< SCU PMCON: SSC1_DIS (Bitfield-Mask: 0x01)             */
#define SCU_PMCON_ADC1_DIS_Pos            (0UL)                     /*!< SCU PMCON: ADC1_DIS (Bit 0)                           */
#define SCU_PMCON_ADC1_DIS_Msk            (0x1UL)                   /*!< SCU PMCON: ADC1_DIS (Bitfield-Mask: 0x01)             */
/* ========================================================  PMCON0  ========================================================= */
#define SCU_PMCON0_SD_Pos                 (3UL)                     /*!< SCU PMCON0: SD (Bit 3)                                */
#define SCU_PMCON0_SD_Msk                 (0x8UL)                   /*!< SCU PMCON0: SD (Bitfield-Mask: 0x01)                  */
#define SCU_PMCON0_PD_Pos                 (2UL)                     /*!< SCU PMCON0: PD (Bit 2)                                */
#define SCU_PMCON0_PD_Msk                 (0x4UL)                   /*!< SCU PMCON0: PD (Bitfield-Mask: 0x01)                  */
#define SCU_PMCON0_SL_Pos                 (1UL)                     /*!< SCU PMCON0: SL (Bit 1)                                */
#define SCU_PMCON0_SL_Msk                 (0x2UL)                   /*!< SCU PMCON0: SL (Bitfield-Mask: 0x01)                  */
#define SCU_PMCON0_XTAL_ON_Pos            (0UL)                     /*!< SCU PMCON0: XTAL_ON (Bit 0)                           */
#define SCU_PMCON0_XTAL_ON_Msk            (0x1UL)                   /*!< SCU PMCON0: XTAL_ON (Bitfield-Mask: 0x01)             */
/* ========================================================  RSTCON  ========================================================= */
#define SCU_RSTCON_LOCKUP_EN_Pos          (7UL)                     /*!< SCU RSTCON: LOCKUP_EN (Bit 7)                         */
#define SCU_RSTCON_LOCKUP_EN_Msk          (0x80UL)                  /*!< SCU RSTCON: LOCKUP_EN (Bitfield-Mask: 0x01)           */
#define SCU_RSTCON_LOCKUP_Pos             (0UL)                     /*!< SCU RSTCON: LOCKUP (Bit 0)                            */
#define SCU_RSTCON_LOCKUP_Msk             (0x1UL)                   /*!< SCU RSTCON: LOCKUP (Bitfield-Mask: 0x01)              */
/* ====================================================  STACK_OVF_ADDR  ===================================================== */
#define SCU_STACK_OVF_ADDR_STOF_ADDR_OFF_H_Pos (18UL)               /*!< SCU STACK_OVF_ADDR: STOF_ADDR_OFF_H (Bit 18)          */
#define SCU_STACK_OVF_ADDR_STOF_ADDR_OFF_H_Msk (0xffc0000UL)        /*!< SCU STACK_OVF_ADDR: STOF_ADDR_OFF_H (Bitfield-Mask: 0x3ff) */
#define SCU_STACK_OVF_ADDR_STOF_ADDR_OFF_L_Pos (2UL)                /*!< SCU STACK_OVF_ADDR: STOF_ADDR_OFF_L (Bit 2)           */
#define SCU_STACK_OVF_ADDR_STOF_ADDR_OFF_L_Msk (0xffcUL)            /*!< SCU STACK_OVF_ADDR: STOF_ADDR_OFF_L (Bitfield-Mask: 0x3ff) */
/* ====================================================  STACK_OVF_CTRL  ===================================================== */
#define SCU_STACK_OVF_CTRL_STOF_EN_Pos    (0UL)                     /*!< SCU STACK_OVF_CTRL: STOF_EN (Bit 0)                   */
#define SCU_STACK_OVF_CTRL_STOF_EN_Msk    (0x1UL)                   /*!< SCU STACK_OVF_CTRL: STOF_EN (Bitfield-Mask: 0x01)     */
/* =====================================================  STACK_OVF_STS  ===================================================== */
#define SCU_STACK_OVF_STS_STOF_STS_Pos    (0UL)                     /*!< SCU STACK_OVF_STS: STOF_STS (Bit 0)                   */
#define SCU_STACK_OVF_STS_STOF_STS_Msk    (0x1UL)                   /*!< SCU STACK_OVF_STS: STOF_STS (Bitfield-Mask: 0x01)     */
/* =====================================================  STACK_OVFCLR  ====================================================== */
#define SCU_STACK_OVFCLR_STOF_STSC_Pos    (0UL)                     /*!< SCU STACK_OVFCLR: STOF_STSC (Bit 0)                   */
#define SCU_STACK_OVFCLR_STOF_STSC_Msk    (0x1UL)                   /*!< SCU STACK_OVFCLR: STOF_STSC (Bitfield-Mask: 0x01)     */
/* ====================================================  SYS_STRTUP_STS  ===================================================== */
#define SCU_SYS_STRTUP_STS_PG100TP_CHKS_ERR_Pos (2UL)               /*!< SCU SYS_STRTUP_STS: PG100TP_CHKS_ERR (Bit 2)          */
#define SCU_SYS_STRTUP_STS_PG100TP_CHKS_ERR_Msk (0x4UL)             /*!< SCU SYS_STRTUP_STS: PG100TP_CHKS_ERR (Bitfield-Mask: 0x01) */
#define SCU_SYS_STRTUP_STS_MRAMINITSTS_Pos (1UL)                    /*!< SCU SYS_STRTUP_STS: MRAMINITSTS (Bit 1)               */
#define SCU_SYS_STRTUP_STS_MRAMINITSTS_Msk (0x2UL)                  /*!< SCU SYS_STRTUP_STS: MRAMINITSTS (Bitfield-Mask: 0x01) */
#define SCU_SYS_STRTUP_STS_PLL_LOCK_STS_Pos (0UL)                   /*!< SCU SYS_STRTUP_STS: PLL_LOCK_STS (Bit 0)              */
#define SCU_SYS_STRTUP_STS_PLL_LOCK_STS_Msk (0x1UL)                 /*!< SCU SYS_STRTUP_STS: PLL_LOCK_STS (Bitfield-Mask: 0x01) */
/* ========================================================  SYSCON0  ======================================================== */
#define SCU_SYSCON0_SYSCLKSEL_Pos         (6UL)                     /*!< SCU SYSCON0: SYSCLKSEL (Bit 6)                        */
#define SCU_SYSCON0_SYSCLKSEL_Msk         (0xc0UL)                  /*!< SCU SYSCON0: SYSCLKSEL (Bitfield-Mask: 0x03)          */
#define SCU_SYSCON0_NVMCLKFAC_Pos         (4UL)                     /*!< SCU SYSCON0: NVMCLKFAC (Bit 4)                        */
#define SCU_SYSCON0_NVMCLKFAC_Msk         (0x30UL)                  /*!< SCU SYSCON0: NVMCLKFAC (Bitfield-Mask: 0x03)          */
/* =========================================================  TCCR  ========================================================== */
#define SCU_TCCR_TCC_Pos                  (0UL)                     /*!< SCU TCCR: TCC (Bit 0)                                 */
#define SCU_TCCR_TCC_Msk                  (0x3UL)                   /*!< SCU TCCR: TCC (Bitfield-Mask: 0x03)                   */
/* =========================================================  VTOR  ========================================================== */
#define SCU_VTOR_VTOR_BYP_Pos             (0UL)                     /*!< SCU VTOR: VTOR_BYP (Bit 0)                            */
#define SCU_VTOR_VTOR_BYP_Msk             (0x3UL)                   /*!< SCU VTOR: VTOR_BYP (Bitfield-Mask: 0x03)              */
/* ========================================================  WAKECON  ======================================================== */
#define SCU_WAKECON_WAKEUPEN_Pos          (0UL)                     /*!< SCU WAKECON: WAKEUPEN (Bit 0)                         */
#define SCU_WAKECON_WAKEUPEN_Msk          (0x1UL)                   /*!< SCU WAKECON: WAKEUPEN (Bitfield-Mask: 0x01)           */
/* ==========================================================  WDT  ========================================================== */
#define SCU_WDT_WDT_Pos                   (0UL)                     /*!< SCU WDT: WDT (Bit 0)                                  */
#define SCU_WDT_WDT_Msk                   (0xffffUL)                /*!< SCU WDT: WDT (Bitfield-Mask: 0xffff)                  */
/* ========================================================  WDTCON  ========================================================= */
#define SCU_WDTCON_WINBEN_Pos             (5UL)                     /*!< SCU WDTCON: WINBEN (Bit 5)                            */
#define SCU_WDTCON_WINBEN_Msk             (0x20UL)                  /*!< SCU WDTCON: WINBEN (Bitfield-Mask: 0x01)              */
#define SCU_WDTCON_WDTPR_Pos              (4UL)                     /*!< SCU WDTCON: WDTPR (Bit 4)                             */
#define SCU_WDTCON_WDTPR_Msk              (0x10UL)                  /*!< SCU WDTCON: WDTPR (Bitfield-Mask: 0x01)               */
#define SCU_WDTCON_WDTEN_Pos              (2UL)                     /*!< SCU WDTCON: WDTEN (Bit 2)                             */
#define SCU_WDTCON_WDTEN_Msk              (0x4UL)                   /*!< SCU WDTCON: WDTEN (Bitfield-Mask: 0x01)               */
#define SCU_WDTCON_WDTRS_Pos              (1UL)                     /*!< SCU WDTCON: WDTRS (Bit 1)                             */
#define SCU_WDTCON_WDTRS_Msk              (0x2UL)                   /*!< SCU WDTCON: WDTRS (Bitfield-Mask: 0x01)               */
#define SCU_WDTCON_WDTIN_Pos              (0UL)                     /*!< SCU WDTCON: WDTIN (Bit 0)                             */
#define SCU_WDTCON_WDTIN_Msk              (0x1UL)                   /*!< SCU WDTCON: WDTIN (Bitfield-Mask: 0x01)               */
/* ========================================================  WDTREL  ========================================================= */
#define SCU_WDTREL_WDTREL_Pos             (0UL)                     /*!< SCU WDTREL: WDTREL (Bit 0)                            */
#define SCU_WDTREL_WDTREL_Msk             (0xffUL)                  /*!< SCU WDTREL: WDTREL (Bitfield-Mask: 0xff)              */
/* ========================================================  WDTWINB  ======================================================== */
#define SCU_WDTWINB_WDTWINB_Pos           (0UL)                     /*!< SCU WDTWINB: WDTWINB (Bit 0)                          */
#define SCU_WDTWINB_WDTWINB_Msk           (0xffUL)                  /*!< SCU WDTWINB: WDTWINB (Bitfield-Mask: 0xff)            */
/* =======================================================  XTAL_CTRL  ======================================================= */
#define SCU_XTAL_CTRL_XTALHYSCTRL_Pos     (4UL)                     /*!< SCU XTAL_CTRL: XTALHYSCTRL (Bit 4)                    */
#define SCU_XTAL_CTRL_XTALHYSCTRL_Msk     (0x30UL)                  /*!< SCU XTAL_CTRL: XTALHYSCTRL (Bitfield-Mask: 0x03)      */
#define SCU_XTAL_CTRL_XTALHYSEN_Pos       (1UL)                     /*!< SCU XTAL_CTRL: XTALHYSEN (Bit 1)                      */
#define SCU_XTAL_CTRL_XTALHYSEN_Msk       (0x2UL)                   /*!< SCU XTAL_CTRL: XTALHYSEN (Bitfield-Mask: 0x01)        */
#define SCU_XTAL_CTRL_XTAL12EN_Pos        (0UL)                     /*!< SCU XTAL_CTRL: XTAL12EN (Bit 0)                       */
#define SCU_XTAL_CTRL_XTAL12EN_Msk        (0x1UL)                   /*!< SCU XTAL_CTRL: XTAL12EN (Bitfield-Mask: 0x01)         */


/* =========================================================================================================================== */
/* ================                                           SCUPM                                           ================ */
/* =========================================================================================================================== */

