Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD5V_OV_IS_Msk (0x1000UL)         /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD5V_OV_IS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDDEXT_OV_IS_Pos (11UL)            /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDDEXT_OV_IS (Bit 11)       */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDDEXT_OV_IS_Msk (0x800UL)         /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDDEXT_OV_IS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VS_OV_IS_Pos (8UL)                 /*!< SCUPM SYS_SUPPLY_IRQ_STS: VS_OV_IS (Bit 8)            */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VS_OV_IS_Msk (0x100UL)             /*!< SCUPM SYS_SUPPLY_IRQ_STS: VS_OV_IS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD1V5_UV_IS_Pos (6UL)             /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD1V5_UV_IS (Bit 6)        */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD1V5_UV_IS_Msk (0x40UL)          /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD1V5_UV_IS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD5V_UV_IS_Pos (4UL)              /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD5V_UV_IS (Bit 4)         */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDD5V_UV_IS_Msk (0x10UL)           /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDD5V_UV_IS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDDEXT_UV_IS_Pos (3UL)             /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDDEXT_UV_IS (Bit 3)        */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VDDEXT_UV_IS_Msk (0x8UL)           /*!< SCUPM SYS_SUPPLY_IRQ_STS: VDDEXT_UV_IS (Bitfield-Mask: 0x01) */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VS_UV_IS_Pos (0UL)                 /*!< SCUPM SYS_SUPPLY_IRQ_STS: VS_UV_IS (Bit 0)            */
#define SCUPM_SYS_SUPPLY_IRQ_STS_VS_UV_IS_Msk (0x1UL)               /*!< SCUPM SYS_SUPPLY_IRQ_STS: VS_UV_IS (Bitfield-Mask: 0x01) */
/* =======================================================  WDT1_TRIG  ======================================================= */
#define SCUPM_WDT1_TRIG_SOWCONF_Pos       (6UL)                     /*!< SCUPM WDT1_TRIG: SOWCONF (Bit 6)                      */
#define SCUPM_WDT1_TRIG_SOWCONF_Msk       (0xc0UL)                  /*!< SCUPM WDT1_TRIG: SOWCONF (Bitfield-Mask: 0x03)        */
#define SCUPM_WDT1_TRIG_WDP_SEL_Pos       (0UL)                     /*!< SCUPM WDT1_TRIG: WDP_SEL (Bit 0)                      */
#define SCUPM_WDT1_TRIG_WDP_SEL_Msk       (0x3fUL)                  /*!< SCUPM WDT1_TRIG: WDP_SEL (Bitfield-Mask: 0x3f)        */


/* =========================================================================================================================== */
/* ================                                           SSC1                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  BR  =========================================================== */
#define SSC1_BR_BR_VALUE_Pos              (0UL)                     /*!< SSC1 BR: BR_VALUE (Bit 0)                             */
#define SSC1_BR_BR_VALUE_Msk              (0xffffUL)                /*!< SSC1 BR: BR_VALUE (Bitfield-Mask: 0xffff)             */
/* ==========================================================  CON  ========================================================== */
#define SSC1_CON_BSY_Pos                  (28UL)                    /*!< SSC1 CON: BSY (Bit 28)                                */
#define SSC1_CON_BSY_Msk                  (0x10000000UL)            /*!< SSC1 CON: BSY (Bitfield-Mask: 0x01)                   */
#define SSC1_CON_BE_Pos                   (27UL)                    /*!< SSC1 CON: BE (Bit 27)                                 */
#define SSC1_CON_BE_Msk                   (0x8000000UL)             /*!< SSC1 CON: BE (Bitfield-Mask: 0x01)                    */
#define SSC1_CON_PE_Pos                   (26UL)                    /*!< SSC1 CON: PE (Bit 26)                                 */
#define SSC1_CON_PE_Msk                   (0x4000000UL)             /*!< SSC1 CON: PE (Bitfield-Mask: 0x01)                    */
#define SSC1_CON_RE_Pos                   (25UL)                    /*!< SSC1 CON: RE (Bit 25)                                 */
#define SSC1_CON_RE_Msk                   (0x2000000UL)             /*!< SSC1 CON: RE (Bitfield-Mask: 0x01)                    */
#define SSC1_CON_TE_Pos                   (24UL)                    /*!< SSC1 CON: TE (Bit 24)                                 */
#define SSC1_CON_TE_Msk                   (0x1000000UL)             /*!< SSC1 CON: TE (Bitfield-Mask: 0x01)                    */
#define SSC1_CON_BC_Pos                   (16UL)                    /*!< SSC1 CON: BC (Bit 16)                                 */
#define SSC1_CON_BC_Msk                   (0xf0000UL)               /*!< SSC1 CON: BC (Bitfield-Mask: 0x0f)                    */
#define SSC1_CON_EN_Pos                   (15UL)                    /*!< SSC1 CON: EN (Bit 15)                                 */
#define SSC1_CON_EN_Msk                   (0x8000UL)                /*!< SSC1 CON: EN (Bitfield-Mask: 0x01)                    */
#define SSC1_CON_MS_Pos                   (14UL)                    /*!< SSC1 CON: MS (Bit 14)                                 */
#define SSC1_CON_MS_Msk                   (0x4000UL)                /*!< SSC1 CON: MS (Bitfield-Mask: 0x01)                    */
#define SSC1_CON_AREN_Pos                 (12UL)                    /*!< SSC1 CON: AREN (Bit 12)                               */
#define SSC1_CON_AREN_Msk                 (0x1000UL)                /*!< SSC1 CON: AREN (Bitfield-Mask: 0x01)                  */
#define SSC1_CON_BEN_Pos                  (11UL)                    /*!< SSC1 CON: BEN (Bit 11)                                */
#define SSC1_CON_BEN_Msk                  (0x800UL)                 /*!< SSC1 CON: BEN (Bitfield-Mask: 0x01)                   */
#define SSC1_CON_PEN_Pos                  (10UL)                    /*!< SSC1 CON: PEN (Bit 10)                                */
#define SSC1_CON_PEN_Msk                  (0x400UL)                 /*!< SSC1 CON: PEN (Bitfield-Mask: 0x01)                   */
#define SSC1_CON_REN_Pos                  (9UL)                     /*!< SSC1 CON: REN (Bit 9)                                 */
#define SSC1_CON_REN_Msk                  (0x200UL)                 /*!< SSC1 CON: REN (Bitfield-Mask: 0x01)                   */
#define SSC1_CON_TEN_Pos                  (8UL)                     /*!< SSC1 CON: TEN (Bit 8)                                 */
#define SSC1_CON_TEN_Msk                  (0x100UL)                 /*!< SSC1 CON: TEN (Bitfield-Mask: 0x01)                   */
#define SSC1_CON_LB_Pos                   (7UL)                     /*!< SSC1 CON: LB (Bit 7)                                  */
#define SSC1_CON_LB_Msk                   (0x80UL)                  /*!< SSC1 CON: LB (Bitfield-Mask: 0x01)                    */
#define SSC1_CON_PO_Pos                   (6UL)                     /*!< SSC1 CON: PO (Bit 6)                                  */
#define SSC1_CON_PO_Msk                   (0x40UL)                  /*!< SSC1 CON: PO (Bitfield-Mask: 0x01)                    */
#define SSC1_CON_PH_Pos                   (5UL)                     /*!< SSC1 CON: PH (Bit 5)                                  */
#define SSC1_CON_PH_Msk                   (0x20UL)                  /*!< SSC1 CON: PH (Bitfield-Mask: 0x01)                    */
#define SSC1_CON_HB_Pos                   (4UL)                     /*!< SSC1 CON: HB (Bit 4)                                  */
#define SSC1_CON_HB_Msk                   (0x10UL)                  /*!< SSC1 CON: HB (Bitfield-Mask: 0x01)                    */
#define SSC1_CON_BM_Pos                   (0UL)                     /*!< SSC1 CON: BM (Bit 0)                                  */
#define SSC1_CON_BM_Msk                   (0xfUL)                   /*!< SSC1 CON: BM (Bitfield-Mask: 0x0f)                    */
/* ========================================================  ISRCLR  ========================================================= */
#define SSC1_ISRCLR_BECLR_Pos             (11UL)                    /*!< SSC1 ISRCLR: BECLR (Bit 11)                           */
#define SSC1_ISRCLR_BECLR_Msk             (0x800UL)                 /*!< SSC1 ISRCLR: BECLR (Bitfield-Mask: 0x01)              */
#define SSC1_ISRCLR_PECLR_Pos             (10UL)                    /*!< SSC1 ISRCLR: PECLR (Bit 10)                           */
#define SSC1_ISRCLR_PECLR_Msk             (0x400UL)                 /*!< SSC1 ISRCLR: PECLR (Bitfield-Mask: 0x01)              */
#define SSC1_ISRCLR_RECLR_Pos             (9UL)                     /*!< SSC1 ISRCLR: RECLR (Bit 9)                            */
#define SSC1_ISRCLR_RECLR_Msk             (0x200UL)                 /*!< SSC1 ISRCLR: RECLR (Bitfield-Mask: 0x01)              */
#define SSC1_ISRCLR_TECLR_Pos             (8UL)                     /*!< SSC1 ISRCLR: TECLR (Bit 8)                            */
#define SSC1_ISRCLR_TECLR_Msk             (0x100UL)                 /*!< SSC1 ISRCLR: TECLR (Bitfield-Mask: 0x01)              */
/* =========================================================  PISEL  ========================================================= */
#define SSC1_PISEL_GIS_Pos                (4UL)                     /*!< SSC1 PISEL: GIS (Bit 4)                               */
#define SSC1_PISEL_GIS_Msk                (0x10UL)                  /*!< SSC1 PISEL: GIS (Bitfield-Mask: 0x01)                 */
#define SSC1_PISEL_MIS_1_Pos              (3UL)                     /*!< SSC1 PISEL: MIS_1 (Bit 3)                             */
#define SSC1_PISEL_MIS_1_Msk              (0x8UL)                   /*!< SSC1 PISEL: MIS_1 (Bitfield-Mask: 0x01)               */
#define SSC1_PISEL_CIS_Pos                (2UL)                     /*!< SSC1 PISEL: CIS (Bit 2)                               */
#define SSC1_PISEL_CIS_Msk                (0x4UL)                   /*!< SSC1 PISEL: CIS (Bitfield-Mask: 0x01)                 */
#define SSC1_PISEL_SIS_Pos                (1UL)                     /*!< SSC1 PISEL: SIS (Bit 1)                               */
#define SSC1_PISEL_SIS_Msk                (0x2UL)                   /*!< SSC1 PISEL: SIS (Bitfield-Mask: 0x01)                 */
#define SSC1_PISEL_MIS_0_Pos              (0UL)                     /*!< SSC1 PISEL: MIS_0 (Bit 0)                             */
#define SSC1_PISEL_MIS_0_Msk              (0x1UL)                   /*!< SSC1 PISEL: MIS_0 (Bitfield-Mask: 0x01)               */
/* ==========================================================  RB  =========================================================== */
#define SSC1_RB_RB_VALUE_Pos              (0UL)                     /*!< SSC1 RB: RB_VALUE (Bit 0)                             */
#define SSC1_RB_RB_VALUE_Msk              (0xffffUL)                /*!< SSC1 RB: RB_VALUE (Bitfield-Mask: 0xffff)             */
/* ==========================================================  TB  =========================================================== */
#define SSC1_TB_TB_VALUE_Pos              (0UL)                     /*!< SSC1 TB: TB_VALUE (Bit 0)                             */
#define SSC1_TB_TB_VALUE_Msk              (0xffffUL)                /*!< SSC1 TB: TB_VALUE (Bitfield-Mask: 0xffff)             */


/* =========================================================================================================================== */
/* ================                                           SSC2                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  BR  =========================================================== */
#define SSC2_BR_BR_VALUE_Pos              (0UL)                     /*!< SSC2 BR: BR_VALUE (Bit 0)                             */
#define SSC2_BR_BR_VALUE_Msk              (0xffffUL)                /*!< SSC2 BR: BR_VALUE (Bitfield-Mask: 0xffff)             */
/* ==========================================================  CON  ========================================================== */
#define SSC2_CON_BSY_Pos                  (28UL)                    /*!< SSC2 CON: BSY (Bit 28)                                */
#define SSC2_CON_BSY_Msk                  (0x10000000UL)            /*!< SSC2 CON: BSY (Bitfield-Mask: 0x01)                   */
#define SSC2_CON_BE_Pos                   (27UL)                    /*!< SSC2 CON: BE (Bit 27)                                 */
#define SSC2_CON_BE_Msk                   (0x8000000UL)             /*!< SSC2 CON: BE (Bitfield-Mask: 0x01)                    */
#define SSC2_CON_PE_Pos                   (26UL)                    /*!< SSC2 CON: PE (Bit 26)                                 */
#define SSC2_CON_PE_Msk                   (0x4000000UL)             /*!< SSC2 CON: PE (Bitfield-Mask: 0x01)                    */
#define SSC2_CON_RE_Pos                   (25UL)                    /*!< SSC2 CON: RE (Bit 25)                                 */
#define SSC2_CON_RE_Msk                   (0x2000000UL)             /*!< SSC2 CON: RE (Bitfield-Mask: 0x01)                    */
#define SSC2_CON_TE_Pos                   (24UL)                    /*!< SSC2 CON: TE (Bit 24)                                 */
#define SSC2_CON_TE_Msk                   (0x1000000UL)             /*!< SSC2 CON: TE (Bitfield-Mask: 0x01)                    */
#define SSC2_CON_BC_Pos                   (16UL)                    /*!< SSC2 CON: BC (Bit 16)                                 */
#define SSC2_CON_BC_Msk                   (0xf0000UL)               /*!< SSC2 CON: BC (Bitfield-Mask: 0x0f)                    */
#define SSC2_CON_EN_Pos                   (15UL)                    /*!< SSC2 CON: EN (Bit 15)                                 */
#define SSC2_CON_EN_Msk                   (0x8000UL)                /*!< SSC2 CON: EN (Bitfield-Mask: 0x01)                    */
#define SSC2_CON_MS_Pos                   (14UL)                    /*!< SSC2 CON: MS (Bit 14)                                 */
#define SSC2_CON_MS_Msk                   (0x4000UL)                /*!< SSC2 CON: MS (Bitfield-Mask: 0x01)                    */
#define SSC2_CON_AREN_Pos                 (12UL)                    /*!< SSC2 CON: AREN (Bit 12)                               */
#define SSC2_CON_AREN_Msk                 (0x1000UL)                /*!< SSC2 CON: AREN (Bitfield-Mask: 0x01)                  */
#define SSC2_CON_BEN_Pos                  (11UL)                    /*!< SSC2 CON: BEN (Bit 11)                                */
#define SSC2_CON_BEN_Msk                  (0x800UL)                 /*!< SSC2 CON: BEN (Bitfield-Mask: 0x01)                   */
#define SSC2_CON_PEN_Pos                  (10UL)                    /*!< SSC2 CON: PEN (Bit 10)                                */
#define SSC2_CON_PEN_Msk                  (0x400UL)                 /*!< SSC2 CON: PEN (Bitfield-Mask: 0x01)                   */
#define SSC2_CON_REN_Pos                  (9UL)                     /*!< SSC2 CON: REN (Bit 9)                                 */
#define SSC2_CON_REN_Msk                  (0x200UL)                 /*!< SSC2 CON: REN (Bitfield-Mask: 0x01)                   */
#define SSC2_CON_TEN_Pos                  (8UL)                     /*!< SSC2 CON: TEN (Bit 8)                                 */
#define SSC2_CON_TEN_Msk                  (0x100UL)                 /*!< SSC2 CON: TEN (Bitfield-Mask: 0x01)                   */
#define SSC2_CON_LB_Pos                   (7UL)                     /*!< SSC2 CON: LB (Bit 7)                                  */
#define SSC2_CON_LB_Msk                   (0x80UL)                  /*!< SSC2 CON: LB (Bitfield-Mask: 0x01)                    */
#define SSC2_CON_PO_Pos                   (6UL)                     /*!< SSC2 CON: PO (Bit 6)                                  */
#define SSC2_CON_PO_Msk                   (0x40UL)                  /*!< SSC2 CON: PO (Bitfield-Mask: 0x01)                    */
#define SSC2_CON_PH_Pos                   (5UL)                     /*!< SSC2 CON: PH (Bit 5)                                  */
#define SSC2_CON_PH_Msk                   (0x20UL)                  /*!< SSC2 CON: PH (Bitfield-Mask: 0x01)                    */
#define SSC2_CON_HB_Pos                   (4UL)                     /*!< SSC2 CON: HB (Bit 4)                                  */
#define SSC2_CON_HB_Msk                   (0x10UL)                  /*!< SSC2 CON: HB (Bitfield-Mask: 0x01)                    */
#define SSC2_CON_BM_Pos                   (0UL)                     /*!< SSC2 CON: BM (Bit 0)                                  */
#define SSC2_CON_BM_Msk                   (0xfUL)                   /*!< SSC2 CON: BM (Bitfield-Mask: 0x0f)                    */
/* ========================================================  ISRCLR  ========================================================= */
#define SSC2_ISRCLR_BECLR_Pos             (11UL)                    /*!< SSC2 ISRCLR: BECLR (Bit 11)                           */
#define SSC2_ISRCLR_BECLR_Msk             (0x800UL)                 /*!< SSC2 ISRCLR: BECLR (Bitfield-Mask: 0x01)              */
#define SSC2_ISRCLR_PECLR_Pos             (10UL)                    /*!< SSC2 ISRCLR: PECLR (Bit 10)                           */
#define SSC2_ISRCLR_PECLR_Msk             (0x400UL)                 /*!< SSC2 ISRCLR: PECLR (Bitfield-Mask: 0x01)              */
#define SSC2_ISRCLR_RECLR_Pos             (9UL)                     /*!< SSC2 ISRCLR: RECLR (Bit 9)                            */
#define SSC2_ISRCLR_RECLR_Msk             (0x200UL)                 /*!< SSC2 ISRCLR: RECLR (Bitfield-Mask: 0x01)              */
#define SSC2_ISRCLR_TECLR_Pos             (8UL)                     /*!< SSC2 ISRCLR: TECLR (Bit 8)                            */
#define SSC2_ISRCLR_TECLR_Msk             (0x100UL)                 /*!< SSC2 ISRCLR: TECLR (Bitfield-Mask: 0x01)              */
/* =========================================================  PISEL  ========================================================= */
#define SSC2_PISEL_GIS_Pos                (4UL)                     /*!< SSC2 PISEL: GIS (Bit 4)                               */
#define SSC2_PISEL_GIS_Msk                (0x10UL)                  /*!< SSC2 PISEL: GIS (Bitfield-Mask: 0x01)                 */
#define SSC2_PISEL_MIS_1_Pos              (3UL)                     /*!< SSC2 PISEL: MIS_1 (Bit 3)                             */
#define SSC2_PISEL_MIS_1_Msk              (0x8UL)                   /*!< SSC2 PISEL: MIS_1 (Bitfield-Mask: 0x01)               */
#define SSC2_PISEL_CIS_Pos                (2UL)                     /*!< SSC2 PISEL: CIS (Bit 2)                               */
#define SSC2_PISEL_CIS_Msk                (0x4UL)                   /*!< SSC2 PISEL: CIS (Bitfield-Mask: 0x01)                 */
#define SSC2_PISEL_SIS_Pos                (1UL)                     /*!< SSC2 PISEL: SIS (Bit 1)                               */
#define SSC2_PISEL_SIS_Msk                (0x2UL)                   /*!< SSC2 PISEL: SIS (Bitfield-Mask: 0x01)                 */
#define SSC2_PISEL_MIS_0_Pos              (0UL)                     /*!< SSC2 PISEL: MIS_0 (Bit 0)                             */
#define SSC2_PISEL_MIS_0_Msk              (0x1UL)                   /*!< SSC2 PISEL: MIS_0 (Bitfield-Mask: 0x01)               */
/* ==========================================================  RB  =========================================================== */
#define SSC2_RB_RB_VALUE_Pos              (0UL)                     /*!< SSC2 RB: RB_VALUE (Bit 0)                             */
#define SSC2_RB_RB_VALUE_Msk              (0xffffUL)                /*!< SSC2 RB: RB_VALUE (Bitfield-Mask: 0xffff)             */
/* ==========================================================  TB  =========================================================== */
#define SSC2_TB_TB_VALUE_Pos              (0UL)                     /*!< SSC2 TB: TB_VALUE (Bit 0)                             */
#define SSC2_TB_TB_VALUE_Msk              (0xffffUL)                /*!< SSC2 TB: TB_VALUE (Bitfield-Mask: 0xffff)             */


/* =========================================================================================================================== */
/* ================                                          TIMER2                                           ================ */
/* =========================================================================================================================== */

