Wyatt-zhang/Mosfet_TLE9854/anti-rtos-mosfer_2021_0413 v0.20/RTE/Device/TLE9854QX/tle985x.h
/* ==========================================================  CNT  ========================================================== */
#define TIMER21_CNT_T2H_Pos               (8UL)                     /*!< TIMER21 CNT: T2H (Bit 8)                              */
#define TIMER21_CNT_T2H_Msk               (0xff00UL)                /*!< TIMER21 CNT: T2H (Bitfield-Mask: 0xff)                */
#define TIMER21_CNT_T2L_Pos               (0UL)                     /*!< TIMER21 CNT: T2L (Bit 0)                              */
#define TIMER21_CNT_T2L_Msk               (0xffUL)                  /*!< TIMER21 CNT: T2L (Bitfield-Mask: 0xff)                */
/* ==========================================================  CON  ========================================================== */
#define TIMER21_CON_TF2_Pos               (7UL)                     /*!< TIMER21 CON: TF2 (Bit 7)                              */
#define TIMER21_CON_TF2_Msk               (0x80UL)                  /*!< TIMER21 CON: TF2 (Bitfield-Mask: 0x01)                */
#define TIMER21_CON_EXF2_Pos              (6UL)                     /*!< TIMER21 CON: EXF2 (Bit 6)                             */
#define TIMER21_CON_EXF2_Msk              (0x40UL)                  /*!< TIMER21 CON: EXF2 (Bitfield-Mask: 0x01)               */
#define TIMER21_CON_EXEN2_Pos             (3UL)                     /*!< TIMER21 CON: EXEN2 (Bit 3)                            */
#define TIMER21_CON_EXEN2_Msk             (0x8UL)                   /*!< TIMER21 CON: EXEN2 (Bitfield-Mask: 0x01)              */
#define TIMER21_CON_TR2_Pos               (2UL)                     /*!< TIMER21 CON: TR2 (Bit 2)                              */
#define TIMER21_CON_TR2_Msk               (0x4UL)                   /*!< TIMER21 CON: TR2 (Bitfield-Mask: 0x01)                */
#define TIMER21_CON_C_T2_Pos              (1UL)                     /*!< TIMER21 CON: C_T2 (Bit 1)                             */
#define TIMER21_CON_C_T2_Msk              (0x2UL)                   /*!< TIMER21 CON: C_T2 (Bitfield-Mask: 0x01)               */
#define TIMER21_CON_CP_RL2_Pos            (0UL)                     /*!< TIMER21 CON: CP_RL2 (Bit 0)                           */
#define TIMER21_CON_CP_RL2_Msk            (0x1UL)                   /*!< TIMER21 CON: CP_RL2 (Bitfield-Mask: 0x01)             */
/* =========================================================  CON1  ========================================================== */
#define TIMER21_CON1_TF2EN_Pos            (1UL)                     /*!< TIMER21 CON1: TF2EN (Bit 1)                           */
#define TIMER21_CON1_TF2EN_Msk            (0x2UL)                   /*!< TIMER21 CON1: TF2EN (Bitfield-Mask: 0x01)             */
#define TIMER21_CON1_EXF2EN_Pos           (0UL)                     /*!< TIMER21 CON1: EXF2EN (Bit 0)                          */
#define TIMER21_CON1_EXF2EN_Msk           (0x1UL)                   /*!< TIMER21 CON1: EXF2EN (Bitfield-Mask: 0x01)            */
/* =========================================================  ICLR  ========================================================== */
#define TIMER21_ICLR_TF2CLR_Pos           (7UL)                     /*!< TIMER21 ICLR: TF2CLR (Bit 7)                          */
#define TIMER21_ICLR_TF2CLR_Msk           (0x80UL)                  /*!< TIMER21 ICLR: TF2CLR (Bitfield-Mask: 0x01)            */
#define TIMER21_ICLR_EXF2CLR_Pos          (6UL)                     /*!< TIMER21 ICLR: EXF2CLR (Bit 6)                         */
#define TIMER21_ICLR_EXF2CLR_Msk          (0x40UL)                  /*!< TIMER21 ICLR: EXF2CLR (Bitfield-Mask: 0x01)           */
/* ==========================================================  MOD  ========================================================== */
#define TIMER21_MOD_T2REGS_Pos            (7UL)                     /*!< TIMER21 MOD: T2REGS (Bit 7)                           */
#define TIMER21_MOD_T2REGS_Msk            (0x80UL)                  /*!< TIMER21 MOD: T2REGS (Bitfield-Mask: 0x01)             */
#define TIMER21_MOD_T2RHEN_Pos            (6UL)                     /*!< TIMER21 MOD: T2RHEN (Bit 6)                           */
#define TIMER21_MOD_T2RHEN_Msk            (0x40UL)                  /*!< TIMER21 MOD: T2RHEN (Bitfield-Mask: 0x01)             */
#define TIMER21_MOD_EDGESEL_Pos           (5UL)                     /*!< TIMER21 MOD: EDGESEL (Bit 5)                          */
#define TIMER21_MOD_EDGESEL_Msk           (0x20UL)                  /*!< TIMER21 MOD: EDGESEL (Bitfield-Mask: 0x01)            */
#define TIMER21_MOD_PREN_Pos              (4UL)                     /*!< TIMER21 MOD: PREN (Bit 4)                             */
#define TIMER21_MOD_PREN_Msk              (0x10UL)                  /*!< TIMER21 MOD: PREN (Bitfield-Mask: 0x01)               */
#define TIMER21_MOD_T2PRE_Pos             (1UL)                     /*!< TIMER21 MOD: T2PRE (Bit 1)                            */
#define TIMER21_MOD_T2PRE_Msk             (0xeUL)                   /*!< TIMER21 MOD: T2PRE (Bitfield-Mask: 0x07)              */
#define TIMER21_MOD_DCEN_Pos              (0UL)                     /*!< TIMER21 MOD: DCEN (Bit 0)                             */
#define TIMER21_MOD_DCEN_Msk              (0x1UL)                   /*!< TIMER21 MOD: DCEN (Bitfield-Mask: 0x01)               */
/* ==========================================================  RC  =========================================================== */
#define TIMER21_RC_RCH2_Pos               (8UL)                     /*!< TIMER21 RC: RCH2 (Bit 8)                              */
#define TIMER21_RC_RCH2_Msk               (0xff00UL)                /*!< TIMER21 RC: RCH2 (Bitfield-Mask: 0xff)                */
#define TIMER21_RC_RCL2_Pos               (0UL)                     /*!< TIMER21 RC: RCL2 (Bit 0)                              */
#define TIMER21_RC_RCL2_Msk               (0xffUL)                  /*!< TIMER21 RC: RCL2 (Bitfield-Mask: 0xff)                */


/* =========================================================================================================================== */
/* ================                                           UART1                                           ================ */
/* =========================================================================================================================== */

